[{"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/", "text": "Portside India Traders | Maritime Lifting Equipment Experts Portside India Traders | Maritime Lifting Equipment Experts Portside India Traders Home About Products Contact Strength that Anchors Your Success High-quality maritime lifting equipment engineered for durability and excellence. Get a Quote About Us Founded on innovation and a passion for quality, Portside India Traders offers state-of-the-art lifting and heavy-duty maritime equipment. We blend traditional craftsmanship with modern engineering to develop products that stand up to the challenges of today's industrial and maritime environments. Our Products Slings & Belts High-performance webbing and round slings built for strength, flexibility, and safety. Wire Rope & Fittings Precision-engineered wire ropes and essential fittings for industrial lifting solutions. Clips & Sockets Reliable wire rope clips, wedge sockets, spelter and swage sockets for secure terminations. Crosby – Shackles, Hooks, Master Links, Metric Swivel & Alloy Chain Genuine Crosby® lifting components engineered for superior performance and safety. Lifting Hooks & Connectors Heavy-duty hooks and connecting links including self-locking, clevis, and grab types. General Lifting Accessories Shackles, clamps, turnbuckles, and other must-have accessories for rigging operations. Hoists, Trolleys & Winches Manual and electric hoists, geared trolleys, and winches for seamless material handling. Plate & Beam Lifting Clamps Durable clamps designed for vertical, horizontal, I-beam, and pipe lifting applications. Anchoring & Mooring Marine-grade anchors, anchor chains, lashing chains, and mooring ropes. Contact Us Email: sales@portsideindia.com Phone: +91 93071 04214 Address: I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/about.html", "text": "Page not found · GitHub Pages 404 File not found The site configured at this address does not\n        contain the requested file. If this is your site, make sure that the filename case matches the URL\n        as well as any file permissions. For root URLs (like http://example.com/ ) you must provide an index.html file. Read the full documentation for more information about using GitHub Pages . GitHub Status — @githubstatus"}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/products.html", "text": "Page not found · GitHub Pages 404 File not found The site configured at this address does not\n        contain the requested file. If this is your site, make sure that the filename case matches the URL\n        as well as any file permissions. For root URLs (like http://example.com/ ) you must provide an index.html file. Read the full documentation for more information about using GitHub Pages . GitHub Status — @githubstatus"}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/contact.html", "text": "Page not found · GitHub Pages 404 File not found The site configured at this address does not\n        contain the requested file. If this is your site, make sure that the filename case matches the URL\n        as well as any file permissions. For root URLs (like http://example.com/ ) you must provide an index.html file. Read the full documentation for more information about using GitHub Pages . GitHub Status — @githubstatus"}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/WebbingSlings.html", "text": "Portside India Traders - Webbing Slings Portside India Traders Strength that Anchors Your Success Home About Products Contact Webbing Slings High-tenacity polyester slings for safe and efficient lifting operations Request a Quote Webbing Sling Overview Zebra flat webbing slings are manufactured from high tenacity, 100% polyester yarn. These slings are designed for maximum safety and efficiency in lifting operations, with different configurations available to suit various applications. Multi-Layer Design Available in simplex, duplex, triplex & quadraplex Heavy Capacity Up to 50 tons capacity on request Safety Certified 1:7 safety factor Color Coded Easy identification by capacity Key Features Manufactured from high tenacity 100% polyester yarn Terminated with reinforced loops or metal end fittings Comes with manufacturer's test certificate for safe work load Broad width provides wider support for lifts Available in simplex, duplex, triplex and quadraplex configurations Designed for choke hitch and basket hitch applications Tested in straight pull conditions Technical Specifications Simplex Webbing Slings Duplex Webbing Slings Triplex Webbing Slings Quadraplex Webbing Slings Simplex Webbing Slings (TYPE: SIMPLEX-KSF) Single layered webbing manufactured from high tenacity 100% polyester yarn Lifting Methods Vertical Lift (M* = 1) | Basket Lift (M* = 2) | Choker Lift (M* = 0.8) | 45° Lift (M* = 1.8) | 90° Lift (M* = 1.4) ITEM CODE WIDTH (MM) COLOUR S.W.L. Vertical Lift (kgs) S.W.L. Basket Lift (kgs) S.W.L. Choker Lift (kgs) S.W.L. 45deg Lift (kgs) S.W.L. 90deg Lift (kgs) Min. Breaking Load (kgs) KSF-500 25 VIOLET 500 1000 400 900 700 3500 KSF-1000 50 GREEN 1000 2000 800 1800 1400 7000 KSF-1500 75 YELLOW 1500 3000 1200 2700 2100 10500 KSF-2000 100 GREY 2000 4000 1600 3600 2800 14000 KSF-2500 125 RED 2500 5000 2000 4500 3500 17500 KSF-3000 150 BROWN 3000 6000 2400 5400 4200 21000 KSF-4000 200 BLUE 4000 8000 3200 7200 5600 28000 KSF-5000 250 ORANGE 5000 10000 4000 9000 7000 35000 KSF-6000 300 ORANGE 6000 12000 4800 10800 8400 42000 Product Notes Simplex slings are preferred because of their broad width which gives wider support to lifts Available in three types: simplex sling with soft eyes, simplex sling with metal end fitting, and endless sling Normally lift loads with the sling reeved around the load (Choke hitch), or on two parts of the sling (Basket hitch) Tested in straight pull conditions Duplex Webbing Slings (TYPE: DUPLEX-KDF / ENDLESS) Double layered webbing for increased strength and durability Lifting Methods Vertical Lift (M* = 1) | Basket Lift (M* = 2) | Choker Lift (M* = 0.8) | 45° Lift (M* = 1.8) | 90° Lift (M* = 1.4) ITEM CODE WIDTH (MM) COLOUR S.W.L. Vertical Lift (kgs) S.W.L. Basket Lift (kgs) S.W.L. Choker Lift (kgs) S.W.L. 45deg Lift (kgs) S.W.L. 90deg Lift (kgs) Min. Breaking Load (kgs) KDF-1000 25 VIOLET 1000 2000 800 1800 1400 7000 KDF-2000 50 GREEN 2000 4000 1600 3600 2800 14000 KDF-3000 75 YELLOW 3000 6000 2400 5400 4200 21000 KDF-4000 100 GREY 4000 8000 3200 7200 5600 28000 KDF-5000 125 RED 5000 10000 4000 9000 7000 35000 KDF-6000 150 BROWN 6000 12000 4800 10800 8400 42000 KDF-8000 200 BLUE 8000 16000 6400 14400 11200 56000 KDF-10000 250 ORANGE 10000 20000 8000 18000 14000 70000 KDF-12000 300 ORANGE 12000 24000 9600 21600 16800 84000 Product Notes Double-layer construction provides enhanced strength Available with reinforced loops or metal end fittings Ideal for medium to heavy lifting applications Endless configuration available Triplex Webbing Slings (TYPE: TRIPLEX-KTF) Three-layer construction for heavy-duty applications (AS PER ML WITH SAFE FACTORS 1:7) Lifting Methods Vertical Lift (M* = 1) | Basket Lift (M* = 2) | Choker Lift (M* = 0.8) | 45° Lift (M* = 1.8) | 90° Lift (M* = 1.4) ITEM CODE WIDTH (MM) COLOUR S.W.L. Vertical Lift (kgs) S.W.L. Basket Lift (kgs) S.W.L. Choker Lift (kgs) S.W.L. 45deg Lift (kgs) S.W.L. 90deg Lift (kgs) Min. Breaking Load (kgs) KTF-1500 25 VIOLET 1500 3000 1200 2700 2100 10500 KTF-3500 50 GREEN 3500 7000 2800 6300 4900 24500 KTF-5500 75 YELLOW 5500 11000 4400 9900 7700 38500 KTF-7500 100 GREY 7500 15000 6000 13500 10500 52500 KTF-9500 125 RED 9500 19000 7600 17100 13300 66500 KTF-12500 150 BROWN 12500 25000 10000 22500 17500 87500 KTF-17000 200 BLUE 17000 34000 13600 30600 23800 119000 KTF-18000 250 ORANGE 19000 38000 15200 34200 26600 133000 KTF-23000 300 ORANGE 23000 46000 18400 41400 32200 161000 Product Notes Triple-layer construction for maximum strength Designed for heavy industrial lifting applications Manufactured with safe factors of 1:7 Available with reinforced loops or metal end fittings Quadraplex Webbing Slings (TYPE: GUADRAPLEX-KOF) Four-layer construction for extreme lifting capacity (AS PER MFGR'S STANDARDS) Lifting Methods Vertical Lift (M* = 1) | Basket Lift (M* = 2) | Choker Lift (M* = 0.8) | 45° Lift (M* = 1.8) | 90° Lift (M* = 1.4) ITEM CODE WIDTH (MM) COLOUR S.W.L. Vertical Lift (kgs) S.W.L. Basket Lift (kgs) S.W.L. Choker Lift (kgs) S.W.L. 45deg Lift (kgs) S.W.L. 90deg Lift (kgs) Min. Breaking Load (kgs) KOF-2500 25 VIOLET 2500 5000 2000 4500 3500 17500 KOF-5000 50 GREEN 5000 10000 4000 9000 7000 35000 KOF-7500 75 YELLOW 7500 15000 6000 13500 10500 52500 KOF-10000 100 GREY 10000 20000 8000 18000 14000 70000 KOF-12500 125 RED 12500 25000 10000 22500 17500 87500 KOF-17000 150 BROWN 17000 34000 13600 30600 23800 119000 KOF-22500 200 BLUE 22500 45000 18000 40500 31500 157500 KOF-25000 250 ORANGE 25000 50000 20000 45000 35000 175000 KOF-30000 300 ORANGE 30000 60000 24000 54000 42000 210000 Product Notes Quadraplex design for extreme lifting capacity Manufactured according to manufacturer's standards Ideal for specialized heavy lifting applications Available in capacities up to 50 tons on request Factor of safety: 1:7 Colour combinations may change subject to availability of raw materials Safety Features 1:7 Safety Factor Rigorous testing ensures maximum safety during operations 100% Polyester High tenacity polyester yarn for superior strength Test Certificate Comes with manufacturer's test certificate for safe work load Multi-Layer Design Available in simplex to quadraplex for various capacity needs Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Webbing Slings Round Slings Lowering & Safety Belts Single‑Part Slings Multiple‑Leg Slings Grommet Slings Flemish‑Eye Slings Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/RoundSlings2.html", "text": "Portside India Traders - Round Slings Portside India Traders Strength that Anchors Your Success Home About Products Contact Round Slings High-strength polyester round slings for safe and efficient lifting operations Request a Quote Round Sling Overview Our round slings are manufactured from high-tenacity polyester yarn, providing superior strength and flexibility for various lifting applications. Designed for maximum safety and efficiency, these slings are ideal for a wide range of industrial lifting needs. Heavy Capacity Up to 50 tons capacity Safety Certified 6:1 & 7:1 safety factors Specialized Options Custom solutions for pipelines Durable Construction Designed for long service life Key Features Manufactured from high-tenacity 100% polyester yarn Available with reinforced eyes at both ends Comes with manufacturer's test certificate for safe work load Designed for various lifting applications Specialized versions available for pipeline lifting Available in fluorescent and light-fast styles High resistance to abrasion and chemicals Technical Specifications Eye & Eye Polyester Sling Petroleum Pipeline Sling Eye & Eye Polyester Sling General purpose round slings with reinforced eyes at both ends, suitable for a wide range of lifting operations. Lifting Methods Vertical Lift | Basket Lift | Choker Lift Art. No. Working Load Limit (kg) Approx Thickness (mm) Approx Width (mm) Length (m) Weight (kg/m) R03-01 1000 11 50 1.0 0.29 R03-02 2000 12 60 1.5 0.41 R03-03 3000 14 70 1.5 0.63 R03-04 4000 15 80 1.5 0.80 R03-05 5000 23 90 1.5 0.96 R03-06 6000 25 90 2.0 1.12 R03-08 8000 26 100 3.0 1.45 R03-10 10000 27 110 3.0 1.90 R03-12 12000 28 125 3.0 2.36 R03-15 15000 29 150 3.0 2.86 R03-20 20000 31 180 3.0 4.50 R03-25 25000 34 200 3.0 5.70 R03-30 30000 36 220 4.0 7.90 R03-40 40000 40 250 4.0 10.6 R03-50 50000 46 300 4.0 12.5 Product Notes 6:1 & 7:1 safety factor is available Can provide fluorescence and light-fest style according to customer requirements Designed for vertical, basket, and choke hitch applications High resistance to abrasion and chemicals Available in custom lengths upon request Special Sling For Petroleum Pipeline Designed specifically for lifting petroleum pipes, featuring a rubber coating for non-slip, heat resistance, and anti-corrosion properties. Pipeline Sling Features Mainly used for pipes hoisting | Rubber coated | Non-slip | Heat resistant | Anti-corrosion Key Advantages Lifting belt has a large width for easy balance in operations Coated with a layer of rubber for protection Can be used with beams and metal parts Construction safety, convenience, and long life Designed for U-lifting method applications Working Load Limit (kg) Approx Thickness (mm) Approx Width (mm) Min. Length (m) Max. Length (m) L (m) Weight (kg/m) 16000 14 250 500 2.3 100 3.15 20000 14 300 550 2.4 100 3.92 24000 14 400 600 2.5 100 4.78 32000 14 500 650 2.6 100 6.47 40000 14 600 700 2.8 100 8.16 48000 14 600 600 3.0 100 9.71 Product Notes 5:1 & 6:1 safety factor is available Working load limit is for U-lifting method Product raw material is PES (polyester) Rubber coating protects against pipe surface roughness Ideal for pipeline installation and maintenance Available in custom configurations Safety Features Multiple Safety Factors Available with 5:1, 6:1, and 7:1 safety factors to meet various requirements 100% Polyester High tenacity polyester yarn for superior strength and flexibility Reinforced Eyes Durable eye terminations for secure lifting operations Pipeline Protection Rubber coated for non-slip, heat resistant and anti-corrosion properties Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Webbing Slings Round Slings Lowering & Safety Belts Single‑Part Slings Multiple‑Leg Slings Grommet Slings Flemish‑Eye Slings Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/LoweringBelts.html", "text": "Portside India Traders - Lowering Belts Portside India Traders Strength that Anchors Your Success Home About Products Contact Lowering Belts Heavy-duty lowering belts for safe pipe handling operations Request a Quote Lowering Belt Overview Our lowering belts are manufactured from duplex polyester webbing slings joined together with heavy-duty steel terminals, designed for high load capacity when lowering pipes. They offer high safety, low elasticity, and resistance to ultraviolet rays, ensuring long-term reliability in demanding conditions. Heavy Capacity Up to 45,000 kgs SWL Safety Features UV Resistant & Low Elasticity Easy Replacement On-site replacement in minutes Long Life Economical due to long working life Key Features Manufactured from duplex polyester webbing slings Designed for use with heavy-duty steel terminals High load capacity for lowering pipes High safety with low elasticity Resistant to ultraviolet rays Simple on-site belt replacement in minutes Economical due to long working life Extra heavy-duty versions available on request Technical Specifications Item Code Nominal Pipe Size (Inches) Holes Per Strip Width (mm) Length (mtr) Hooks Per Side S.W.L. (FS 5:1 kgs) SPLB - 12 12 2 300 1.45 2 12000 SPLB - 18 18 4 450 2.10 4 20000 SPLB - 24 24 5 600 2.70 5 25000 SPLB - 30 30 6 750 3.35 6 32000 SPLB - 36 36 7 900 3.80 7 38000 SPLB - 42 42 8 1050 4.21 8 45000 Product Notes Factor of safety for webbing: 1:7 Factor of safety for steel terminals: 1:4 Extra heavy-duty lowering belts available on request Advanced terminal design for quick on-site replacement Resistant to ultraviolet rays for outdoor applications Economical solution due to long working life Key Advantages Long-lasting Do not weaken with age and provide long-term reliability Shock Absorbent Inherently absorbent of shocks during operations Corrosion Free Polyester construction ensures resistance to corrosion Easy Inspection Simpler, more positive inspection - if it looks all right, it is all right Lightweight Lighter weight means easier working and less risk of injury Transport Savings Lower weight also means lower transport costs Surface Protection Less risk of damage to polished, painted or sensitive surfaces Cargo Control Superior level of cargo control through high pre-tensioning Lashing Systems Ratchet Lashing Cambuckle Lashing Ratchet Lashing With hook at both sides Ref Width (mm) MBS (kg) RAS (kg) KRL-25 25 1500/3000 750/1500 KRL-35 35 3000/6000 1500/3000 KRL-50 50 5000/10000 2500/5000 KRL-75 75 8000/16000 4000/8000 MBS: Minimum Breaking Strength (Two Part / Endless) RAS: Rated Assembly Strength (Two Part / Endless) Cambuckle Lashing With hook at both sides Ref Width (mm) MBS (kg) RAS (kg) KCB-25 25 250/500 125/250 KCB-35 35 1000/2000 500/1000 KCB-50 35 1500/3000 750/1500 MBS: Minimum Breaking Strength (Two Part / Endless) RAS: Rated Assembly Strength (Two Part / Endless) Benefits of Our Lashing Systems Modern, lightweight and thoroughly reliable method of securing all types of loads Significant advantages over steel banding, rope or chains Superior performance and properties compared to traditional methods Suppleness of polyester accommodates irregularities of the load Less risk of damage to sensitive surfaces Superior level of cargo control through high pre-tensioning Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Webbing Slings Round Slings Lowering & Safety Belts Single‑Part Slings Multiple‑Leg Slings Grommet Slings Flemish‑Eye Slings Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/SinglePartSlings.html", "text": "Portside India Traders - Single Part Slings Portside India Traders Strength that Anchors Your Success Home About Products Contact Single Part Slings Heavy-duty lifting solutions engineered for maximum safety and reliability in industrial applications Request a Quote Single Part Sling Overview Single Part Slings are essential lifting components consisting of a single length of wire rope with fittings attached at both ends. These slings are designed for straightforward lifting applications where simplicity and reliability are paramount. High Strength 1770/1980 N/mm² tensile strength Safety Factor 5:1 safety factor Diverse Sizes 6mm to 32mm diameters Custom Lengths Available upon request What are Single Part Slings? Constructed from high-tensile steel wire rope, single part slings offer exceptional strength and durability for a wide range of industrial lifting operations. Key Features High strength-to-weight ratio Excellent resistance to abrasion Flexible design for various applications Available in multiple configurations Technical Specifications Factor of Safety: 5:1 Tensile Strength: 1770/1980 N/mm² Construction: 6x19, 6x36 Core options: Fibre Core or Steel Core Single Part Sling Types SPL-9 Open type Spelter socket on one end and closed type on other end Primarily used in gantry ropes applied in cranes. The combination of open and closed sockets provides versatility in attachment options. Ideal for crane operations Excellent for applications requiring different connection types Common in shipyards and construction sites SPL-10 Open type Thimble SL on one end and solid Thimble at the other end Designed for applications requiring different termination methods. The open type Thimble SL allows for quick connection, while the solid Thimble provides secure termination. Perfect for rigging operations Common in material handling applications Used in manufacturing and assembly lines SPL-11 Open and closed Swaged socket at both ends Features specialized sockets at both ends for secure connections. The Swaged socket design ensures maximum grip and security. Ideal for critical lifting operations Used in mining and heavy equipment industries Suitable for applications requiring high security connections Capacity Specifications Vertical Lift Basket Hitch Choker Hitch Vertical Lift Capacities Diameter (mm) Fibre Core (Tons) Steel Core (Tons) 6 0.4 0.5 8 0.6 0.8 9 1.0 1.1 10 1.2 1.3 12 1.6 1.9 13 2.1 2.2 14 2.4 2.6 15 3.1 3.4 16 4.0 4.3 17 4.4 4.8 18 4.9 5.3 19 5.9 6.4 20 7.0 7.2 21 7.5 7.5 22 8.1 8.7 23 9.3 10.1 24 12.2 13.2 25 14.4 15.7 26 17.6 18.6 27 18.4 19.6 28 22.1 24.9 29 27.4 29.8 30 37.0 40.3 31 48.0 52.7 32 55.0 65.0 Basket Hitch Capacities Diameter (mm) Fibre Core (Tons) Steel Core (Tons) 6 0.8 1.0 8 1.5 1.7 9 2.0 2.1 10 1.0 2.8 12 3.5 3.8 13 4.1 4.4 14 4.8 5.2 15 6.2 6.7 16 8.9 8.5 17 8.8 9.5 18 9.7 10.5 19 11.8 12.7 20 14.0 14.4 21 15.0 15.2 22 16.1 17.4 23 17.2 20.1 24 24.4 25.3 25 28.9 31.3 26 35.2 37.1 27 39.9 41.1 28 46.1 49.9 29 54.6 59.5 30 74.0 80.7 31 86.0 105.3 32 110.0 130.0 Choker Hitch Capacities Diameter (mm) Fibre Core (Tons) Steel Core (Tons) 6 0.3 0.4 8 0.6 0.7 9 0.8 0.8 10 1.0 1.1 12 1.4 1.5 13 1.6 1.8 14 1.9 2.1 15 2.5 2.7 16 3.2 3.4 17 3.9 3.8 18 3.9 5.1 19 4.7 5.1 20 5.6 5.8 21 6.0 6.1 22 6.4 6.9 23 7.5 8.1 24 8.9 10.5 25 11.5 12.6 26 14.1 14.8 27 14.8 15.5 28 18.4 19.9 29 21.9 23.6 30 29.6 32.3 31 38.4 42.1 32 44.0 52.0 Important Note The capacity indicated in the above tables for basket hitch and choker hitch is for guidance only. The vertical column is the actual load the slings can be tested and certified. In other words, safe working load is applicable for vertical lift only. Applications & Usage Single Part Slings are versatile lifting components used across various industries. Their robust construction and flexibility make them ideal for numerous applications: Construction Industry Essential for lifting and positioning structural steel, precast concrete, and heavy building materials on construction sites. Their durability makes them perfect for demanding conditions. Maritime Operations Used in shipyards and ports for loading/unloading cargo, shipbuilding, and maintenance operations. Corrosion-resistant variants are particularly valuable in marine environments. Manufacturing Facilities Indispensable in plants for moving heavy machinery, positioning equipment, and assembly line operations. Their reliability ensures efficient production processes. Mining Operations Handle heavy loads of ore, equipment, and machinery. Their strength and abrasion resistance make them suitable for rugged mining environments. Energy Sector Power plants use these slings for maintenance and installation of turbines, generators, and other heavy equipment. Also essential in oil and gas operations. Transportation & Logistics For loading and unloading heavy goods from trucks, trains, and ships, providing reliable lifting solutions for efficient logistics operations. Proper Usage Guidelines Always inspect slings before use for signs of wear, kinking, or damage Never exceed the rated working load limit Use appropriate protection when lifting over sharp edges Store slings properly in a clean, dry environment Follow manufacturer recommendations for sling angles and configurations Train all personnel in proper sling handling and inspection techniques Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Webbing Slings Round Slings Single Part Slings Multiple-Leg Slings Grommet Slings Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/MultipleLegSlings.html", "text": "Portside India Traders - Multiple Leg Slings Portside India Traders Strength that Anchors Your Success Home About Products Contact Multiple Leg Slings Versatile lifting solutions for complex and heavy-duty industrial applications Request a Quote Multiple Leg Sling Overview Multiple Leg Slings are specialized lifting assemblies consisting of several wire rope legs connected to a central master link. These slings are designed for lifting large, heavy, or irregularly shaped loads where balanced lifting is essential. Versatile Configurations 2, 3, or 4 legs for balanced lifting Safety Certified High-strength wire rope construction Heavy Capacity Designed for large, irregular loads Customizable Various leg lengths and fittings What are Multiple Leg Slings? With configurations ranging from 2 to 4 legs, these slings distribute weight evenly and provide stability during lifting operations. Key Features Versatile configurations (2, 3, or 4 legs) Central master link for balanced weight distribution Available with various termination types High-strength wire rope construction Technical Specifications Wire Rope: Improved Plow Steel (IPS) Core: Independent Wire Rope Core (IWRC) Constructions: 6x19, 6x36, 8x36 Tensile Strength: 1770 kN/mm² Multiple Leg Sling Combinations SPL-5B Leg wire rope sling with master link on top. This configuration provides balanced lifting for irregular loads. Also available with nut bolt bow shackle Round pin bow shackle option Screw pin D shackle alternative Ideal for construction and manufacturing SPL-17B Specialized configuration for heavy-duty lifting applications requiring precise load distribution. Designed for critical lifting operations Enhanced safety features Common in shipbuilding and energy sectors Available in various sizes and leg configurations SPL-24B Robust multiple leg sling configuration suitable for extreme lifting conditions and heavy loads. High-capacity lifting solution Engineered for industrial applications Available with double ferrule termination Ideal for mining and heavy equipment industries SPL-18B Versatile multiple leg sling design with flexible attachment options for various lifting scenarios. Adaptable to different load types Available with various hook configurations Perfect for material handling and logistics Customizable to specific requirements Multiple Leg Sling Capacity Specifications Wire Rope Specifications: Improved Plow Steel - IWRC - 6 X 19, 6 X 36 AND 8 X 36 fitted with turnback termination. Tensile Strength 1770 kN/mm² Wire Rope Size (mm) MBL (kN) Shackle Size Vertical (Single Leg) Choker Two Leg Slings (0° - 45°) Two Leg Slings (45° - 60°) Vertical Choker Vertical Choker 9 40.3 3/8 7.5 8.1 12.5 15 12.5 11.0 10 63.0 7/16 11.5 9.2 15.0 15 24.0 17.0 12 90.7 1/2 17.0 13.6 23.0 17.0 33.5 25.0 13 106 5/8 22.0 13.0 23.0 23.0 41.5 34.0 14 124 6/8 22.5 13.0 21.5 22.5 48.0 34.0 16 161 3/4 30.0 24.0 42.0 30.0 53.0 45.0 18 204 7/8 37.0 23.6 52.0 37.0 78.0 55.5 20 252 7/8 45.0 38.6 55.0 45.0 58.0 68.0 22 365 11/8 53.5 45.2 74.0 53.5 118.0 84.0 24 363 1/8 67.0 53.5 84.0 67.0 148.0 108.0 26 426 1/8 78.0 62.4 110.0 78.0 165.0 115.0 28 494 1/8 90.0 72.0 125.0 90.0 190.0 135.0 32 645 1/8 118.0 94.4 165.0 118.0 250.0 175.0 36 817 1/8 150.0 120.0 210.0 150.0 315.0 225.0 Important Notes Rated capacities based on pin diameter or hook no larger than the natural eye width (1/2 x eye length) or less than the nominal sling diameter Turnback efficiency: k = 0.9 (Eye termination offers higher efficiency) Vertical sling angles greater than 60° are not recommended Refer to prEN 13414-1 for full details Double Ferrule Wire Rope Slings Double Aluminum Ferrule Our double ferrule wire rope slings feature high-quality aluminum ferrules for secure termination. Available configurations: SFL-1DF SFL-23DF SFL-2DF Termination Types We offer various termination options for multiple leg slings: Turnback Termination The traditional method with efficiency k = 0.9. Provides reliable performance for standard applications. Eye Termination Offers higher efficiency and strength. Recommended for critical lifting operations. Benefits of double ferrule termination Enhanced grip strength Superior load distribution Increased durability Corrosion resistance Master Links & Hooks Master Links Master links are available in the following varieties: Standard master links for balanced lifting Heavy-duty master links for extreme loads Rotating master links for load positioning Custom configurations for specialized applications All master links are manufactured to the highest standards for safety and reliability. Swivel Self Locking Hooks Our premium hook options: SPL-320: Swivel self-locking hook with safety latch SPL-316: Heavy-duty locking hook for critical applications Hook Features Automatic locking mechanism 360° rotation for load positioning High-strength alloy construction Safety latches to prevent accidental release Safety Recommendation Always use appropriate hooks and master links rated for the load. Regularly inspect all components for wear and damage. Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Webbing Slings Round Slings Single Part Slings Multiple-Leg Slings Grommet Slings Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/GrommetSlings.html", "text": "Portside India Traders - Grommet Slings Portside India Traders Strength that Anchors Your Success Home About Products Contact Grommet Slings High-strength endless slings for demanding lifting applications Request Specifications Premium Quality Grommet Slings Portside India Traders offers superior grommet slings engineered for maximum strength and durability. Manufactured from one continuous length of strand or wire rope, our grommet slings provide exceptional breaking strength beyond the limits of single part ropes. Endless Design One continuous length for maximum strength High Strength Breaking strength beyond single part ropes Compact Size Can be fabricated in short circumferences Specialized Ideal for demanding lifting applications Construction Advantages Made from one continuous length of strand or wire rope Requires only one tuck-in point (vs. six for endless slings) 6/1 construction for maximum breaking strength Can be fabricated in very short circumferences Manufacturing Methods Method A: Outer strand unlaid from 6/1 rope specimen Method B: Unlaying from 6/4 rope specimen Method C: Virgin strand (preformed or post formed) Preformed lay maintained during construction Technical Specifications Spliced grommet requires strand length ≈7.5× perimeter Streamline splicing requires length ≈4× effective length Ideal where high ultimate breaking strength is required Superior to single part rope strength limits Technical Specifications Performance data for our Grommet Slings Nominal of Single Part Nominal Diameter (mm) Component Ropes (mm) Breaking Load (tonnes) Breaking Load (tons 200 lb) Breaking Load (tons 2240 lb) 2\" 52 18 211 233 208 2 ½\" 64 22 316 348 311 3\" 76 26 442 486 434 3 ½\" 89 30 589 650 580 4\" 102 34 756 833 744 4 ½\" 115 38 944 1040 930 5\" 125 42 1152 1268 1132 5 ½\" 140 48 1509 1668 1489 6\" 152 52 1775 1954 1744 6 ½\" 165 58 2030 2262 2020 7\" 180 60 2356 2593 2315 Construction & Finishing 1 Method of Tucking Tucks made over one strand and under one strand against the lay of the rope. The heart strand is not removed but may be cut to a suitable length. 2 Splice Construction During construction, the preformed lay of the strand is maintained and not interfered with, except when laying in the core where the strand is straightened. 3 Finishing Process Ends of the splice are tightly served with seizing wire after parceling with canvas, hessian, or wax paper between the end and the third tuck. Key Features & Applications Construction Advantages Made from one continuous length of strand or wire rope Requires only one tuck-in point (vs. six for endless slings) 6/1 construction for maximum breaking strength Can be fabricated in very short circumferences Manufacturing Methods Method A: Outer strand unlaid from 6/1 rope specimen Method B: Unlaying from 6/4 rope specimen Method C: Virgin strand (preformed or post formed) Preformed lay maintained during construction Technical Specifications Spliced grommet requires strand length ≈7.5× perimeter Streamline splicing requires length ≈4× effective length Ideal where high ultimate breaking strength is required Superior to single part rope strength limits Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Webbing Slings Round Slings Single Part Slings Multiple-Leg Slings Grommet Slings Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/FlemishEyeSlings.html", "text": "Portside India Traders - Flemish Eye Slings Portside India Traders Strength that Anchors Your Success Home About Products Contact Flemish Eye Slings Precision-engineered lifting solutions with superior strength and reliability View Specifications Why Choose Flemish Eye Slings Superior Construction Crafted using specialized splicing techniques for maximum strength and reduced wear Mechanical Splicing Pressed ferrules swaged with tremendous force for permanent, high-strength connections Precise Dimensions Manufactured to exact specifications with optimal core butt positioning Quality Materials Constructed with high-grade steel for exceptional durability and corrosion resistance Flemish Eye Construction Process 1 Blinding and Splitting Blind the rope end at distance equal to desired loop length plus 10 times rope diameter 2 Forming the Loop Bend the larger section into desired loop size and lay separated strands into grooves 3 Strand Placement Lay three strands around the loop deep into the throat for optimal strength 4 Ferrule Application Position special ferrule over the rolled-in splice in preparation for swaging 5 Swaging Process Apply tremendous force to taper the ferrule, creating a permanent high-strength connection Technical Specifications Nominal of Single Part Nominal Diameter (mm) Component Ropes (mm) Breaking Load (tonnes) Breaking Load (tons 200 lb) Breaking Load (tons 2240 lb) 2\" 52 18 211 233 208 2 ½\" 64 22 316 348 311 3\" 76 26 442 486 434 3 ½\" 89 30 589 650 580 4\" 102 34 756 833 744 4 ½\" 115 38 944 1040 930 5\" 125 42 1152 1268 1132 5 ½\" 140 48 1509 1668 1489 6\" 152 52 1775 1954 1744 6 ½\" 165 58 2030 2262 2020 7\" 180 60 2356 2593 2315 Note All specifications are based on standard manufacturing practices. Custom configurations available upon request. Breaking loads are minimum requirements and may vary based on material composition. Tucking & Finishing Process Method of Tucking The tucks of the splice are made over one strand and under one strand against the lay of the rope. The heart strand of the rope is not removed when strands are opened for tucking, but may be cut to a suitable length. Professional Finishing The ends of the splice are tightly served with seizing wire after parceling with canvas, hessian or wax paper. This ensures maximum durability and protection against environmental factors. This professional finishing process creates a smooth, streamlined connection that minimizes wear and maximizes the lifespan of your slings. Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium marine equipment engineered for safety and reliability since our founding. Products Webbing Slings Round Slings Single Part Slings Multiple-Leg Slings Grommet Slings Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/WireLockKits.html", "text": "Portside India Traders - Wirelock Kits Portside India Traders Strength that Anchors Your Success Home About Products Contact Wirelock Kits Professional socketing solutions with 100% termination efficiency Request a Quote Premium Wirelock Features Advanced socketing technology for industrial applications with professional termination efficiency Key Advantages 100% termination efficiency Meets EN13411-4:2002 requirements Improved fatigue life No hazardous molten metal Ideal for onsite applications Temperature Range Operating range: -54°C to +114°C Pouring temperature: 9°C to 43°C 0°C to 9°C: Requires one booster pack -10°C to 0°C: Requires two booster packs Kit Components Pre-measured containers One container with resin One container with granular compound Shelf life clearly marked Never use out-of-date kits Wirelock Requirements Recommended quantities for different wire rope sizes Specifications Installation Guide Temperature Guidelines Wire Rope Size Wirelock Required (cc) Wire Rope Size Wirelock Required (cc) mm in. mm in. 6-7 1/4 9 9 8 5/16 17 44 9-10 3/8 17 48 11 7/16 35 51 13 1/2 35 54 14 9/16 52 56 16 5/8 52 60 20 3/4 86 64 22 7/8 125 67 26 1 160 70 28 1-1/8 210 76 32 1-1/4 350 82 36 1-3/8 350 88 40 1-1/2 420 94 42 1-5/8 495 102 1 Socket Selection Recommended for Crosby 416-417 Speller Sockets Sockets must comply with Federal or International Standards Rough finish inside socket may increase seating load 2 Seizing & Brooming Seize wire rope using soft annealed iron wire Unlay strands as far as seizing Cut out any fiber core Unlay individual wires down to seizing 3 Cleaning & Positioning Clean according to lubricant/coating type Comply with EPA regulations Position socket over broom until wires are level with socket basket Clamp rope and socket vertically 4 Seal & Prepare Seal socket base with putty to prevent leakage WIRELOCK® kits contain resin and granular compound Use complete kit - never mix partial contents Check shelf life before use 5 Mixing & Pouring Mix within 9-43°C temperature range Pour resin into container with granular compound Mix thoroughly for 2 minutes Pour slowly down one side of socket 6 Curing & Finishing Gel time: ~15 minutes at 18-24°C Keep vertical for 10 minutes after gelling Ready for service after 60 minutes Never heat to accelerate curing Re-lubricate as required Proof Loading & Compliance Wherever possible, assemblies should be proof loaded. All slings with poured sockets, in accordance with ASMEB30.9, shall be Proof Loaded. Standard Operation Pouring temperature: 9°C to 43°C Cold Condition 0°C to 9°C: Requires one booster pack Extreme Cold -10°C to 0°C: Requires two booster packs Important Notes Always use complete kits - never mix partial contents Check expiration date before use Follow safety guidelines when handling chemicals Store in cool, dry place away from direct sunlight Always wear appropriate PPE during installation Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Wire Rope Products Wire Lock Kits Vitalife Kits WireRope Clips & Sockets Open/Closed Spelter Sockets Open/Closed Swage Sockets Thimbles Quick Links Home About Us All Products Contact Certifications EN13411-4:2002 Certified ASMEB30.9 Compliant OSHA Approved ISO Quality Standards © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/VitaLife.html", "text": "Portside India Traders - Vitalife Wire Rope Lubricants Portside India Traders Strength that Anchors Your Success Home About Products Contact Vitalife Wire Rope Lubricants Premium lubricants that penetrate wire ropes to displace water and contaminants, reducing wear and corrosion Request Product Info Key Benefits Deep Core Penetration Unlike surface-only lubricants, Vitalife penetrates to the rope core for complete protection Strand Preservation Provides inner strand preservation and lubricity for extended rope life Visual Inspection Allows visual rope inspection without obscuring damage Reduces Friction Significantly reduces inter-strand friction during operation Extended Service Life Extends rope service life by up to 40% compared to conventional lubricants Protective Film Forms protective outer film against corrosion and environmental damage Non-tacky Formula Won't attract dust or debris during operation Eco-Friendly Options Environmentally friendly Bio-Lube option available Product Line Overview Vitalife 400 Vitalife 410 Bio-Lube Vitalife 500 Container Size Stock No. Weight (kg) Applications 349 grams 1038945 0.6 General Purpose Lubricant 18.9 Liters 1038954 18.8 268 Liters 1038964 191 Container Size Stock No. Weight (kg) Applications 342 grams 1039043 0.6 Environmentally Friendly Option 18.9 Liters 1039051 18.8 269 Liters 1039022 191 Container Size Stock No. Weight (kg) Applications 18.9 Liters 1038927 18.8 Gas Use & Transport 268 Liters 1038982 191 28.1 Liters 1039034 0.91 3.7 Liters 1039027 3.72 Important Note Aerosol forms are regulated dangerous goods - consult MSDS for shipping regulations and safety information. Field Usage Recommendations Regular Inspection Determine lubrication needs through frequent examinations of wire rope condition. Look for signs of wear, corrosion, and dryness. Re-lubrication Frequency Frequency of application is more critical than quantity applied. Regular maintenance ensures optimal rope performance and longevity. Application Note Expect some field loss due to spillage and handling - use application guidelines as reference points rather than exact measures. Core Penetration Unlike greasy lubricants, Vitalife penetrates to the rope core for complete internal protection and lubrication. Vitalife 400® Specifications Available Formats 12 oz. spray cans 5-gallon pails 55-gallon drums Ideal Applications Bridges and suspension systems Construction cranes Drag lines and mining equipment Mining operations Marine applications Industrial hoists Application Guide Wire Rope Diameter (in.) Gallons per 1,000 ft Wire Rope Diameter (in.) Gallons per 1,000 ft 1/2 0.15 1-1/8 0.55 5/8 0.20 1-1/4 0.60 3/4 0.30 1-3/8 0.70 7/8 0.40 1-1/2 0.75 1 0.45 2 0.90 Spray Application Systems 15 Liter Backpack Sprayer Designed for rugged construction conditions with specially designed seals for Vitalife products Stock No: 1039082 Weight: 5.3 kg Compatible with Vitalife 400® and Bio-Lube® Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium lubrication solutions for industrial and maritime applications since our founding. Wire Rope Products Wire Lock Kits Vitalife Kits WireRope Clips & Sockets Open/Closed Spelter Sockets Open/Closed Swage Sockets Thimbles Quick Links Home About Us All Products Contact Certifications EN13411-4:2002 Certified ASMEB30.9 Compliant OSHA Approved ISO Quality Standards © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/CrossbyClipsAndSockets.html", "text": "Portside India Traders - Crosby Forged Wire Rope Clips & Sockets Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby Forged Wire Rope Clips & Sockets Premium-grade components for secure wire rope connections in demanding industrial applications Request Technical Specifications Product Features Forged Construction Manufactured from high-grade forged steel for superior strength and durability Precision Fit Engineered to exact tolerances for secure, vibration-resistant connections Corrosion Resistance Hot-dip galvanized finish for protection in harsh environments Comprehensive Sizing Available for wire rope diameters from 3mm to 90mm Wire Rope Clips Wedge Sockets Crosby Forged Wire Rope Clips Premium Forged Construction Designed for maximum holding power with U-bolt and saddle configuration for secure connections Rope Size (mm) Stock No. Package Qty Weight/100 (kg) Dimensions (mm) A B C D E F G H 3-4* 1010015 100 2.72 5.60 18.3 11.2 11.9 10.4 9.65 20.6 23.9 5* 1010033 100 4.54 6.35 24.6 14.2 15.0 12.7 11.2 23.9 29.5 6-7 1010051 100 8.62 7.85 26.2 12.7 19.1 16.8 14.2 30.2 36.6 8 1010079 100 12.7 9.65 35.1 19.1 22.4 18.3 17.5 33.3 42.9 9-10 1010097 100 21.8 11.2 38.1 19.1 25.4 23.1 19.1 41.4 49.3 11 1010113 50 35.4 12.7 47.8 25.4 30.2 26.2 22.4 46.0 58.0 12-13 1010131 50 36.3 12.7 47.8 25.4 30.2 28.7 22.4 48.5 58.0 14-15 1010159 50 49.4 14.2 57.0 31.8 33.3 31.0 23.9 52.5 63.5 16 1010177 50 49.9 14.2 60.5 31.8 33.3 34.0 23.9 52.5 63.5 18-20 1010195 25 64 15.7 70.0 36.6 38.1 35.8 26.9 57.0 72.0 22 1010211 25 96 19.1 79.0 41.1 44.5 40.4 31.8 62.0 80.5 24-26 1010239 10 114 19.1 89.0 46.0 47.8 45.2 31.8 67.0 88.0 28-30 1010257 10 128 19.1 98.5 51.0 51.0 48.5 31.8 71.5 91.0 32-34 1010275 10 199 22.4 108 54.0 58.5 55.5 36.6 78.5 105 36 1010293 10 200 22.4 118 58.5 60.5 58.5 36.6 78.5 106 38 1010319 10 247 22.4 125 60.5 66.5 62.0 36.6 86.5 113 41-42 1010337 Bulk 319 26.4 136 66.5 70.0 67.5 41.4 92.0 121 44-46 1010355 Bulk 424 28.7 146 70.0 77.5 74.5 46.0 97.0 134 48-52 1010373 Bulk 590 31.8 164 76.0 86.0 83.5 51.0 113 149 56-58 1010391 Bulk 726 31.8 181 81.0 98.5 81.0 51.0 114 162 62-65 1010417 Bulk 862 31.8 195 87.5 105 93.5 51.0 103 168 68-72** 1010435 Bulk 1043 31.8 211 90.5 111 124 51.0 127 175 75-78 1010453 Bulk 1406 38.1 233 98.5 121 119 60.5 149 194 85-90** 1010426 Bulk 1814 38.1 273 114 140 152 60.5 157 213 Technical Notes *Electro-plated U-Bolt and Nuts **70 mm and 89 mm base: cast steel construction All clips are hot-dip galvanized for corrosion resistance Proper installation requires correct torque application Always follow manufacturer's installation guidelines S-421T Wedge Sockets Assembly Specifications Wire Rope (mm) Assembly Stock No. Weight (kg) Wedge Only Stock No. Wedge Weight (kg) Bolt Kit (Optional) 9-10 1035000 1.44 1035555 0.23 Stock No. 1092227 (Weight: 0.17 kg) 11-13 1035009 2.79 1035554 0.48 14-16 1035018 4.40 1035573 0.81 18-19 1035027 6.58 1035582 1.18 20-22 1035036 9.75 1035591 1.82 24-26 1035045 13.9 1035600 2.00 28 1035054 20.5 1035609 3.00 30-32 1035063 29.4 1035618 4.00 Dimensional Specifications (mm) Wire Rope (mm) Stock No. A B C D G H J K L P R S T U V 9-10 1035000 145 69.1 20.6 20.6 35.1 77.7 198 47.8 22.4 39.6 11.2 54.1 11.2 31.8 35.1 11-13 1035009 175 88.1 25.4 25.4 41.1 95.5 226 32.0 26.9 49.3 12.7 65.0 13.5 44.5 47.8 14-16 1035018 210 109 31.8 30.2 53.8 114 273 50.5 31.0 57.2 14.2 82.6 17.5 51.0 55.5 18-19 1035027 251 130 38.1 35.1 62.0 134 314 61.2 35.6 66.8 16.8 92.2 19.8 59.5 65.0 20-22 1035036 286 149 44.5 41.4 68.5 156 365 63.0 42.4 79.5 19.1 109 22.4 68.5 74.5 24-26 1035045 325 161 51.0 51.0 74.7 177 414 77.2 51.0 95.5 22.4 119 26.2 73.0 83.5 28 1035054 365 176 57.0 57.0 84.0 194 466 65.0 57.0 108 25.4 138 27.9 82.6 90.5 30-32 1035063 415 222 66.5 63.5 90.5 239 520 74.7 59.5 114 26.9 156 30.2 117 125 Technical Notes Assembly includes: Socket, Wedge, Pin, and Wire Rope Clip Dimensions J and K are nominal values For intermediate wire rope sizes: Use next larger size socket Proper installation is critical for safety - always follow manufacturer guidelines Regular inspection required for all wire rope connections Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium rigging solutions for industrial and maritime applications since our founding. Wire Rope Products Wire Lock Kits Vitalife Kits WireRope Clips & Sockets Open/Closed Spelter Sockets Open/Closed Swage Sockets Thimbles Quick Links Home About Us All Products Contact Certifications EN13411-4:2002 Certified ASMEB30.9 Compliant OSHA Approved ISO Quality Standards © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/CrossbyOpenAndClosedSpelterSockets.html", "text": "Portside India Traders - Spelter Sockets Portside India Traders Strength that Anchors Your Success Home About Products Contact Premium Spelter Sockets Heavy-duty wire rope termination solutions for marine and industrial applications Request Technical Specifications Spelter Sockets Overview Our spelter sockets are engineered to provide the strongest, most reliable termination for wire ropes in demanding marine, construction, and industrial applications. Manufactured from high-grade alloy steel with hot-dip galvanized finishes, they offer exceptional corrosion resistance and durability. Secure Termination Designed to provide maximum grip and prevent rope slippage under extreme loads and conditions. Safety Certified Manufactured to meet international safety standards with rigorous quality control processes. Easy Installation Engineered for straightforward installation with clear guidelines for proper setup. Corrosion Resistant Hot-dip galvanized finish provides superior protection in marine and corrosive environments. Quality Assurance All spelter sockets undergo rigorous testing and quality control to ensure maximum safety and performance Forged Construction Manufactured from high-grade forged steel for superior strength Load Rated Precisely rated for specific working load limits Versatile Applications Suitable for marine, construction, and industrial use Technical Specifications Our G-416/S-416 and G-417/S-417 Spelter Sockets are designed for maximum strength and reliability. Open Spelter Sockets (G-416/S-416) Closed Spelter Sockets (G-417/S-417) Rope Dia. (mm) Structural Strand Dia. (mm) Stock No. Weight Each (kg) A (mm) C (mm) D (mm) F (mm) G (mm) 6-7 - 1039619 0.50 116 19.1 17.5 9.65 17.5 8-10 - 1039687 0.59 123 20.6 20.6 12.7 20.6 11-13 - 1039655 1.02 141 25.4 25.4 14.2 23.9 14-16 12-13 1039673 1.63 171 31.8 30.2 17.5 28.7 18 14-16 1039691 2.64 202 38.1 35.1 20.6 31.8 20-22 18-19 1039717 4.38 235 44.5 41.4 23.9 38.1 24-26 20-22 1039735 7.03 268 51.0 51.0 28.7 44.5 28-30 24-26 1039753 9.75 300 57.0 57.0 31.8 51.0 32-35 28 1039771 14.1 335 63.5 68.5 38.1 67.0 38 30-32 1039796 21.4 434 76.0 71.0 41.4 70.0 40-42 33-35 1039815 24.9 413 76.0 76.0 44.5 76.0 44-48 36-40 1039833 37.2 464 89.0 89.0 51.0 79.5 50-54 42-45 1039851 59 546 102 95.5 57.0 95.5 Rope Dia. (mm) Structural Strand Dia. (mm) Stock No. Weight Each (kg) A (mm) B (mm) C (mm) D (mm) F (mm) 6-7 - 1039897 0.23 116 12.7 39.6 22.4 9.65 8-10 - 1039913 0.34 125 15.8 42.9 24.6 12.7 11-13 - 1039931 0.68 140 17.5 51.0 29.5 14.2 14-16 12-13 1039959 1.13 162 20.6 67.0 35.8 17.5 18 14-16 1039977 1.92 194 26.9 76.2 42.2 22.4 20-22 18-19 1039995 3.28 226 33.3 92.0 49.3 25.4 24-26 20-22 1040019 4.76 254 36.6 105 58.5 28.7 28-30 24-26 1040037 6.46 283 39.6 114 65.0 31.8 32-35 28 1040055 8.95 309 41.4 127 71.0 38.1 38 30-32 1040073 13.24 355 49.3 137 81.0 41.4 40-42 33-35 1040091 16.32 390 54.0 146 82.5 44.5 44-48 36-40 1040117 25.96 445 55.5 171 95.5 51.0 50-54 42-45 1040135 35.83 505 62.0 194 111 57.2 Important Notes All sockets manufactured from high-grade alloy steel Hot-dip galvanized for superior corrosion resistance Designed for permanent wire rope terminations Proper installation is critical for safety and performance Always consult manufacturer's guidelines for installation procedures Regular inspection required for continued safe operation Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Wire Rope Products Wire Lock Kits Vitalife Kits WireRope Clips & Sockets Open/Closed Spelter Sockets Open/Closed Swage Sockets Thimbles Quick Links Home About Us All Products Contact Certifications EN13411-4:2002 Certified ASMEB30.9 Compliant OSHA Approved ISO Quality Standards © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/CrossbyOpenAndClosedSwageSockets.html", "text": "Portside India Traders - Crosby Swage Sockets Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby® Swage Sockets Premium forged steel fittings for reliable wire rope terminations Request Technical Specifications Swage Sockets Overview Our Crosby® swage sockets are precision-engineered from high-grade forged steel, offering superior strength and reliability for critical lifting applications. Designed with safety as the top priority, these sockets undergo rigorous testing to exceed industry standards and ensure maximum performance. Closed Swage Sockets Designed for permanent wire rope terminations with a seamless, high-strength connection. Open Swage Sockets Feature an open design for easy rope insertion while maintaining secure termination. Quality Assurance Each socket undergoes rigorous testing to ensure it meets international standards. Safety Certified Manufactured to meet international safety standards with rigorous quality control. Quality Assurance All swage sockets undergo rigorous testing and quality control to ensure maximum safety and performance Forged Construction Manufactured from high-grade forged steel for superior strength Load Rated Precisely rated for specific working load limits Versatile Applications Suitable for marine, construction, and industrial use Technical Specifications Our Crosby S-501 and S-502 Swage Sockets are designed for maximum strength and reliability. Open Swage Sockets (S-501) Closed Swage Sockets (S-502) S-501 Stock No. Rope Size (mm) Weight (kg) A (mm) B (mm) C (mm) D (mm) E (mm) F (mm) H (mm) L (mm) M (mm) N (mm) 1039021 6 0.24 122 12.7 35.1 17.5 8.65 54.0 17.5 102 9.65 38.1 1039049 8 0.51 159 19.6 41.1 20.6 8.65 81.0 20.6 135 11.9 44.5 1039067 9-10 0.59 159 19.6 41.1 20.6 10.4 81.0 20.6 135 11.9 44.5 1039085 11-12 0.94 198 24.9 51.0 25.4 12.2 108 25.4 170 14.2 51.0 1039101 13 0.94 198 24.9 51.0 25.4 14.0 108 25.4 170 14.2 51.0 1039129 14 2.12 241 31.8 60.5 30.2 15.5 135 31.8 207 17.3 57.0 1039147 16 2.05 241 31.8 60.5 30.2 17.0 135 31.8 207 17.3 57.0 1039165 18-20 3.62 294 39.4 70.0 35.1 20.3 162 38.1 254 19.8 70.0 S-502 Stock No. Rope Size (mm) Weight (kg) A (mm) B (mm) C (mm) D (mm) E (mm) F (mm) H (mm) L (mm) 1039325 6 0.15 109 12.7 35.1 19.1 6.85 54.0 12.7 89.0 1039343 8 0.34 138 19.6 41.1 22.4 8.65 81.0 17.0 114 1039361 9-10 0.33 138 19.6 41.1 22.4 10.4 81.0 17.0 114 1039389 11-12 0.64 176 24.9 51.0 26.9 12.2 108 21.8 146 1039405 13 0.64 176 24.9 51.0 26.9 14.0 108 21.8 146 1039423 14 1.32 220 31.8 60.5 31.8 15.5 135 28.7 184 1039441 16 1.29 220 31.8 60.5 31.8 17.0 135 28.7 184 1039469 18-20 2.27 261 39.4 73.0 36.6 20.3 162 33.3 219 1039487 22 3.08 303 43.2 79.0 42.9 23.9 189 38.1 257 Important Notes All sockets are forged from high-grade steel for maximum strength Individually proof tested at 2.5 times the Working Load Limit with certification Proper swaging tools must be used for installation Inspect sockets regularly for signs of wear, deformation, or corrosion Do not exceed Working Load Limits under any circumstances Consult manufacturer guidelines for proper installation procedures Replacement parts available for all socket types Industry Applications Swage sockets are essential components in various industries requiring secure wire rope terminations Marine & Offshore Mooring systems, ship rigging, and offshore platform installations Construction Crane operations, suspension bridges, and structural cable systems Industrial Material handling, conveyor systems, and heavy machinery Renewable Energy Wind turbine installations and maintenance operations Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Wire Rope Products Wire Lock Kits Vitalife Kits WireRope Clips & Sockets Open/Closed Spelter Sockets Open/Closed Swage Sockets Thimbles Quick Links Home About Us All Products Contact Certifications EN13411-4:2002 Certified ASMEB30.9 Compliant OSHA Approved ISO Quality Standards © 2025 Portside India Traders. All Rights Reserved. Crosby® is a registered trademark of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/Thimbles.html", "text": "Portside India Traders - Extra Heavy Wire Rope Thimbles Portside India Traders Strength that Anchors Your Success Home About Products Contact Extra Heavy Wire Rope Thimbles Premium protection for wire rope eyes, engineered for maximum strength and durability View Specifications Request Quote Why Choose Our Thimbles Superior wire rope protection for demanding applications Maximum Protection Our thimbles protect wire rope eyes from crushing, abrasion, and deformation, extending the life of your equipment. Heavy-Duty Construction Manufactured from high-grade steel to withstand extreme loads and harsh marine environments. Precise Dimensions Engineered to exact specifications to ensure perfect fit and optimal performance with your wire rope. Standard Thimbles Our G-414 Extra Heavy Wire Rope Thimbles provide superior protection for wire rope eyes in standard applications. Manufactured to exacting specifications for maximum strength and durability. Ideal for: General marine, construction, and industrial applications Shackle-Loc Thimbles The G-414 SL series features an additional J dimension for shackle compatibility, ensuring a perfect fit with standard shackles. Designed for applications requiring quick connection to shackles. Ideal for: Rigging systems, lifting applications, and quick-connect scenarios Technical Specifications G-414 Extra Heavy Wire Rope Thimbles Standard Thimbles Shackle-Loc Thimbles Rope Dia. (in) Stock No. Weight per 100 (lb) A (in) B (in) C (in) D (in) E (in) F (in) G (in) H (in) 1/4 1037639 7 2.19 1.62 1.50 0.88 0.41 0.28 0.06 0.25 5/16 1037657 14 2.50 1.68 1.81 1.06 0.50 0.34 0.08 0.30 3/8 1037675 23 2.88 2.12 2.12 1.12 0.63 0.41 0.11 0.39 7/16 1037683 37 3.25 2.38 2.38 1.25 0.72 0.47 0.12 0.45 1/2 - 9/16 1037719 50 3.62 2.75 2.75 1.50 0.89 0.59 0.15 0.48 5/8 1037755 82 4.25 3.25 3.12 1.75 1.00 0.66 0.16 0.53 3/4 1037773 157 5.00 3.75 3.81 2.00 1.22 0.79 0.22 0.69 7/8 1037911 190 5.50 4.25 4.25 2.25 1.38 0.94 0.22 0.78 1 1037817 280 6.12 4.50 4.75 2.50 1.56 1.06 0.25 0.88 1-1/8 - 1-1/4 1037835 830 7.00 5.12 5.88 2.88 1.88 1.31 0.25 1.25 1-1/4 - 1-3/8 1037853 1250 9.08 6.50 6.81 3.50 2.25 1.44 0.37 1.29 1-3/8 - 1-1/2 1037871 1860 9.00 6.25 7.12 3.50 2.62 1.56 0.50 1.31 1-5/8 1037899 2780 11.25 8.00 8.12 4.00 3.00 1.72 0.50 1.38 1-3/8 - 2 1037915 - 12.19 9.00 8.50 4.50 3.06 1.84 0.50 1.50 1-7/8 - 2-1/4 1037933 - 15.12 12.00 10.38 6.00 3.38 2.09 0.50 1.99 1-6/8 - 56 1037951 - 17.50 14.00 11.88 7.00 3.88 2.38 0.62 1.82 Rope Dia. (in) Stock No. Weight per 100 (lb) A (in) B (in) C (in) D (in) E (in) F (in) G (in) H (in) J (in) 3/8 1036800 24 2.18 2.12 2.12 1.12 0.63 0.41 0.11 0.39 0.81 1/2 - 9/16 1036808 55 3.62 2.75 2.75 1.50 0.89 0.59 0.15 0.48 - 5/8 1036817 82 4.25 3.25 3.12 1.75 1.00 0.66 0.16 0.53 - 3/4 1036826 161 5.00 3.75 3.81 2.00 1.22 0.78 0.22 0.69 0.50 7/8 1036835 206 5.50 4.25 4.25 2.25 1.38 0.94 0.22 0.78 0.88 1 1036844 300 7.00 5.12 5.88 2.88 1.88 1.31 0.25 1.25 2.13 1-1/8 - 1-1/4 1036853 425 9.00 6.25 7.12 3.50 2.62 1.56 0.50 1.31 2.50 1-3/8 - 1-1/2 1036862 1317 - - - - - - - - - Important Notes Weights are per 100 pieces (lbs) \"-\" indicates missing data in original document All dimensions in inches (in) G-414 SL includes an additional J dimension for shackle compatibility All thimbles are forged from high-grade steel for maximum strength Inspect thimbles regularly for signs of wear, deformation, or corrosion Industry Applications Extra Heavy Wire Rope Thimbles for demanding environments Marine & Offshore Mooring systems, ship rigging, and offshore platform installations Construction Crane operations, suspension bridges, and structural cable systems Industrial Material handling, conveyor systems, and heavy machinery Contact Us Get in touch for quotes or more information Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Wire Lock Kits Vita Life Crossby Wirerope Clips and Sockets Crossby Open / Closed Spelter Sockets Crossby Open / Closed Swage Sockets Thimbles Quick Links Home About Us All Products Contact Certifications ASME B30.26 Certified DNV Offshore Certified OSHA Compliant ISO Quality Standards © 2025 Portside India Traders. All Rights Reserved. Crosby® is a registered trademark of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/Hooks-hardware.html", "text": "Portside India Traders - Crosby Hooks & Swivels Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby® Brand Hooks & Swivels Premium forged lifting hooks engineered for maximum safety and durability Request a Quote Hooks & Swivels Overview Our Crosby® hooks and swivels are forged from high-strength alloy steel, quenched and tempered for superior performance. Designed with safety as the top priority, these hooks feature self-locking latches, fatigue ratings, and meet OSHA regulations for personnel lifting applications. SHUR-LOC® Hook Features Forged alloy steel, Quenched & Tempered Recessed trigger design protects from damage Easy to operate with enlarged thumb access Positive lock latch self-locks when loaded OSHA compliant for personnel lifting Fatigue rated to 20,000 cycles at 1.5x WLL Individually proof tested at 2.5x WLL Grade 100 Performance Rated for both wire rope and Grade 80/100 chain with permanent WLL markings. Swivel Design S-13326 features anti-friction bearing design for free rotation under load. Fatigue Rated Rated at 1.5 times the Working Load Limit at 20,000 cycles for extended durability. Safety Certified Meets OSHA Rule 1926.1431(g)(1)(i)(A) and 1926.1501(g)(4)(iv)(B) for personnel lifting. Technical Specifications All Crosby hooks feature forged alloy steel construction with quenched and tempered treatment. Available in multiple configurations with various load capacities. S-1326 Swivel Hooks S-13326 Swivel Hooks w/Bearing S-1316 Eye Hook S-1318A Shank Hook L-320 Eye Hooks S-1326 SHUR-LOC® Swivel Hooks Positioning device not intended to rotate under load. Rated for wire rope and Grade 80/100 chain. Chain Size (in) Frame Code Grade 100 WLL (lb) WLL (lb) Stock No. Weight (lb) A (in) B (in) C (in) - D 3200 2560 1004304 1.26 1.50 1.32 6.13 1/4 - 5/16 G 5700 4560 1004313 2.62 1.75 1.59 7.60 3/8 H 8800 7040 1004322 4.70 2.00 1.73 8.83 1/2 I 15000 12000 1004331 8.64 2.50 2.38 11.20 5/8 - 25000 18000 1004340 17.00 2.75 2.20 12.90 3/4 - 35300 23400 1004349 24.00 2.83 2.52 14.10 7/8 - 42700 34160 1004358 29.00 3.44 3.19 16.40 S-13326 SHUR-LOC® Swivel Hooks with Bearing Utilizes anti-friction bearing design which allows hook to rotate freely under load. Chain Size (in) Frame Code Grade 100 WLL (lb) WLL (lb) Stock No. Weight (lb) A (in) B (in) C (in) - D 3200 2560 1004404 1.50 1.50 1.14 6.17 1/4 - 5/16 G 5700 4560 1004413 3.10 1.75 1.52 7.54 3/8 H 8800 7040 1004422 5.26 2.00 1.61 8.88 1/2 I 15000 12000 1004431 11.22 2.50 2.03 11.11 5/8 - 22600 18000 1004440 17.32 2.75 2.25 12.90 S-1316 SHUR-LOC® Eye Hook with Positive Locking Latch Meets performance requirements of EN1677-3. Suitable for Grade 100 and Grade 80 chain. Chain Size (in) Frame Code Grade 100 WLL (lb) WLL (lb) Stock No. Weight (lb) A (in) C (in) D (in) - D 3200 - 1022896 0.85 0.78 3.95 0.79 1/4-5/16 G 5700 4560 1022914 1.80 1.08 5.31 1.10 3/8 H 8800 7040 1022923 3.40 1.30 6.57 1.17 1/2 I 15000 12000 1022932 6.00 1.65 8.23 1.67 5/8 J 22600 18000 1022941 15.1 2.20 10.08 2.04 S-1318A SHUR-LOC® Shank Hook Designed for applications requiring a straight shank configuration. Chain Size (in) Frame Code Grade 100 WLL (lb) Stock No. A (in) B (in) C (in) - D 3200 1098200 0.79 2.16 3.31 1/4-5/16 G 5700 1098209 1.00 2.40 4.16 3/8 H 8800 1098218 1.14 2.95 5.14 1/2 I 15000 1098227 1.34 3.35 6.31 L-320 / L-320N Eye Hooks Available in carbon steel and alloy steel. Fatigue rated to 20,000 cycles at 1.5 times WLL. WLL (t) Hook ID Carbon Stock No. Alloy Stock No. Weight (lb) Replacement Latch Kit 0.75 1D 1022205 1022208 0.61 1096325 1 1F 1022216 1022219 0.89 1096374 1.5 1G 1022227 1022230 1.44 1096421 2 1H 1022238 1022241 2.07 1096468 3 1I 1022246 1022249 4.30 1096515 5 1J 1022260 1022282 8.30 1096562 Important Notes All hooks are forged from alloy steel, quenched and tempered for maximum strength Individually proof tested at 2.5 times the chain Working Load Limit with certification Fatigue rated to 20,000 cycles at 1.5 times the Working Load Limit S-1326 is a positioning device and is not intended to rotate under load S-13326 utilizes anti-friction bearing design for free rotation under load SHUR-LOC® hooks meet OSHA regulations for personnel lifting when properly installed Trigger repair kits available (S-4316) for SHUR-LOC® hooks Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Hooks & Swivels Master Links Metric Swivel & Alloy Chain Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved. Crosby® is a registered trademark of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/Masterlinkes.html", "text": "Portside India Traders - Crosby Master Links Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby® Master Links Premium forged alloy master links engineered for maximum safety and durability in demanding lifting applications Request a Quote Master Links Overview Engineered for superior performance in the most demanding lifting applications Maximum Safety Individually proof tested with certification to ensure reliability in critical lifting operations Alloy Steel Construction Forged from high-strength alloy steel, quenched and tempered for superior durability Full Traceability Product Identification Code (PIC) for complete material traceability and quality assurance Key Product Features Forged alloy steel - Quenched & Tempered for maximum strength Individually Proof Tested with certification for each unit Product Identification Code (PIC) for material traceability Fatigue rated to 20,000 cycles at 1.5 times the Working Load Limit Meets or exceeds all requirements of ASME B30.26 DNV certified for offshore container applications Available with QUIC-CHECK® deformation indicators Technical Specifications Comprehensive technical data for Crosby Master Links A-342 Alloy Master Links A-347 Welded Master Links A-342 Alloy Master Links Designed for chain sling applications with Grade 80 and Grade 100 chain Size (in) Stock No. Weight (lb) WLL (lb) Proof Load (lb) Grade 100 Chain Grade 80 Chain 1/2W 1014266 1.3 7400 17,200 6mm, 9/32, 5/16 6mm, 9/32 5/8 1014280 1.5 9000 18,000 5/16, 3/8 9/32, 3/8 3/4W 1014265 2.0 12300 28,400 5/16, 3/8 3/8 7/8W 3522213 3.3 15200 38,000 3/8, 1/2 3/8 1W 3522214 6.1 26000 65,000 1/2, 5/8 1/2 1-1/4W 3522215 12.0 39100 97,750 5/8, 3/4 5/8 1-1/2W 3522216 18.6 61100 152,750 7/8, 1 3/4, 7/8 1-3/4 3522217 25.2 84900 212,250 1 7/8 2 3522218 37.0 102600 256,500 1-1/4 1 A-342 Specifications 5:1 Design Factor based on single leg sling or resultant load on multiple legs with angle ≤ 120° Proof Tested with special fixtures sized to prevent localized point loading Selected sizes with \"W\" designation have enlarged inside dimensions 7/8\" to 2\" master links are type approved to DNV-ST-E271-2.7-1 Offshore Containers Incorporates patented QUIC-CHECK® deformation indicators Fatigue rated to 20,000 cycles at 1.5 times the Working Load Limit A-347 Welded Master Link Assembly Grade 80 alloy master links with engineered flat for use with S-1325A coupler link Stock No. Weight (lb) Chain Size (in) WLL (lb) Proof Load (lb) 1257755 2.4 6mm 7000 17,632 1257762 3.5 6mm, 9/32 9,000 22,701 1257832 3.9 9/32 9,200 23,362 1258058 7.3 5/16 15,400 38,570 1258067 8.9 5/16 15,400 38,570 1258049 8.4 3/8 18,700 46,725 1258076 10.1 3/8 19,600 49,149 1258102 11.4 3/8 19,600 49,149 1258142 15.6 1/2 31,900 80,005 A-347 Specifications 5:1 Design Factor for lifting applications Proof Tested with 70% inside width special fixtures per EN1677 Each main link marked with Product Identification Code (PIC) Type approved to DNV Certification Notes 2.7-1 - Offshore Containers Engineered Flat for use with S-1325A coupler link Available only in EMEA region Fatigue rated to 20,000 cycles at 1.5 times the Working Load Limit Contact Us Get in touch for quotes and product information Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Inquiry Form For product inquiries and quotes, please contact us directly via email or phone. Our team will respond promptly to your request with detailed product information and pricing. Portside India Traders Products Hooks & Swivels Master Links Metric Swivel & Alloy Chain Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved. Crosby® is a registered trademark of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/MetricSwivelAndAlloyChain.html", "text": "Portside India Traders - Crosby Alloy Chain & Connecting Links Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby® Alloy Chain & Connecting Links Premium Grade 10 alloy chains and connecting links engineered for maximum safety and performance in demanding lifting applications Request a Quote Product Overview Superior strength and reliability for critical lifting operations Maximum Strength 25% stronger than Grade 80 alloy chain for enhanced safety Industry Compliant Meets NACM and ASTM A952/A973M standards for Grade 10 chain Premium Construction Forged alloy steel construction, quenched and tempered Key Product Features Peerless 10 Alloy Chain: 25% stronger than Grade 80 alloy chain Permanently embossed with \"P\" (Peerless) and \"10\" (Grade) for identification Black paint finish for corrosion resistance Meets latest NACM and ASTM A952/A952M and ASTM A973/A973M standards Proof tested at minimum 2 times Working Load Limit with certification A-1337 LOK-A-LOY® 10 Connecting Links: Suitable for both Grade 80 and 100 chains Locking system for simple assembly/disassembly - no special tools needed Forged alloy steel - Quenched & Tempered Product Specifications Detailed technical specifications for our alloy chain and connecting links Chain Specifications 4:1 Design Factor | Proof tested at 2x WLL | Black paint finish Connecting Link Features Locking system for simple assembly | Fatigue rated for sizes 9/32\" to 1\" | Meets ASTM A-952 standards Applications Overhead lifting | Construction | Marine operations | Industrial rigging | Mining operations Certifications NACM compliant | ASTM A952/A952M | ASTM A973/A973M | Grade 10 certification Technical Specifications Comprehensive technical data for Crosby Alloy Chain & Connecting Links Grade 10 Alloy Chain LOK-A-LOY® Connecting Links Grade 100 Alloy Chain Specifications Recommended for overhead lifting applications with 4:1 Design Factor Chain Size (in/mm) Stock No. Feet Per Drum/Crate Material Size (in) WLL (lb) Inside Length (in) Inside Width (in) Weight Per Foot (lb) 9/32 (7) 5510226 800 0.286 4300 0.87 0.42 0.77 5/16 (8) 5510326 500 0.332 5700 1.01 0.49 1.12 3/8 (10) 5510426 500 0.334 8800 1.23 0.58 1.52 1/2 (13) 5510826 300 0.529 15000 1.57 0.75 2.71 5/8 (16) 5510826 200 0.641 22600 1.96 0.90 3.74 3/4 (20) 5510926 100 0.812 35300 2.42 1.14 6.29 7/8 (22) 5511026 100 0.906 42700 2.66 1.26 7.94 1 (26) 5511126 50 1.06 59700 3.09 1.42 10.10 1-1/4 (32) *1210075 82 1.34 90400 3.89 1.73 16.40 Chain Specifications Notes 4:1 Design Factor for all chain sizes Size 1-1/4\" (32mm) is embossed \"CG\" instead of \"P\" Proof Tested at minimum 2 times the Working Load Limit with certification Permanently embossed with P (Peerless) and 10 (Grade) for identification Black paint finish for enhanced corrosion resistance Meets latest guidelines of the National Association of Chain Manufacturers (NACM) Compliant with ASTM A952/A952M and ASTM A973/A973M for Grade 10 chain A-1337 LOK-A-LOY® 10 Alloy Connecting Links Premium connecting links for Grade 80 and Grade 100 chain applications Chain Size (in/mm) Stock No. Weight Each (lb) WLL (lb) A (in) B (in) C (in) D (in) E (in) 9/32 (7) 1015104 0.29 4300 0.38 1.94 2.00 0.80 0.68 5/16 (8) 1015113 0.42 5700 0.37 2.36 2.13 0.99 0.72 3/8 (10) 1015122 0.77 8800 0.51 2.65 2.55 1.09 0.91 1/2 (13) 1015136 1.60 15000 0.68 3.46 3.39 1.45 1.13 5/8 (16) 1015145 3.10 22600 0.78 4.25 4.00 1.77 1.34 3/4 (20) 1015154 6.39 35300 1.01 5.14 5.30 2.15 1.64 7/8 (22) 1015163 7.85 42700 1.09 5.46 5.78 2.27 1.97 1 (26) 1015172 11.05 59700 1.24 5.94 6.50 2.41 2.21 1-1/4 (32) 1015181 21.00 90400 1.56 7.43 7.60 3.07 2.57 Connecting Link Specifications 4:1 Design Factor for all connecting links Suitable for use with both Grade 80 and Grade 100 chain Individually Proof Tested at 2-1/2 times Working Load Limit with certification Locking system provides for simple assembly and disassembly - no special tools needed Meets ASTM A-952 standards for Grade 100 chain fittings Forged alloy steel — Quenched & Tempered for maximum durability Sizes 9/32 through 1 inch are fatigue rated for extended service life Contact Us Get in touch for quotes and product information Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Inquiry Form For product inquiries and quotes, please contact us directly via email or phone. Our team will respond promptly to your request with detailed product information and pricing. Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Hooks & Swivels Master Links Metric Swivel & Alloy Chain Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved. Crosby® is a registered trademark of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/ForgedMasterLinks.html", "text": "Portside India Traders - Crosby Forged Master Links Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby® A-342 Forged Master Links Premium forged lifting links engineered for maximum safety and reliability Request a Quote Master Links Overview Our Crosby® A-342 Forged Master Links are made of high-strength alloy steel, quenched and tempered for superior performance. Designed with safety as the top priority, these master links are individually proof tested and meet the highest industry standards. Key Features Made of alloy steel - quenched and tempered Individually proof tested with certification Proof tested with special fixtures to avoid localized point loading Includes raised letter markings for product identification Available with enlarged inside dimensions (W sizes) Includes patented QUIC-CHECK® deformation indicators Fatigue rated: 20,000 cycles at 1.5x WLL Meets/exceeds ASME B30.26 standards Offshore Approved 7/8\" to 2\" sizes DNV-ST-E271-2.7-1 Offshore Containers type approved Forged Construction Forged from high-strength alloy steel for superior durability Fatigue Rated Rated at 1.5 times the Working Load Limit at 20,000 cycles Safety Certified Meets DNV rules for Loose Gear lifting appliances Technical Specifications All Crosby A-342 Forged Master Links feature alloy steel construction with quenched and tempered treatment. Available in multiple sizes with various load capacities. Size (in) Size (mm) Stock No. Weight (kg) WLL (tonnes) Proof Load (kN) G100 Single Leg G100 Double Leg G80 Single Leg G80 Double Leg A (mm) B (mm) C (mm) Deformation Indicator 1/2W 13W 1014266 0.59 3.40 77 6, 7, 8 6mm 6mm, 9/32 5/16, 3/8 71.1 127 89 No 5/8 16 1014280 0.69 4.00 80 8, 10 9/32 3/8 5/16 76.2 152 89 No 3/4W 19W 1014285 0.91 5.60 126 8, 10 5/16 1/2 3/8 81.3 152 102 No 7/8W 22W 3522213 1.50 6.90 †169 10, 13 3/8 1/2 3/8 95.3 162 114 Yes 1W 26W 3522214 2.77 11.8 †289 13, 16 1/2 5/8 1/2 109 191 140 Yes 1-1/4W 32W 3522215 5.44 17.7 †435 16, 20 5/8 3/4, 7/8 5/8 140 241 178 Yes 1-1/2W 38W 3522216 8.44 27.7 †680 22, 26 3/4 1 3/4, 7/8 150 267 191 Yes 1-3/4 44 3522217 11.4 38.5 †944 26 7/8 1-1/4 1 152 305 191 Yes 2 51 3522218 16.8 46.5 †1141 32 7/8 1-1/4 1 178 356 229 Yes 2-1/4 57 1014422 24.5 64.9 1287 32 1 1-1/4 1-1/4 203 406 254 No 2-1/2 63 1014468 31.1 72.6 1423 1-1/4 1-1/4 - - 213 406 279 No 2-3/4 70 1014440 42.6 98.4 1930 - - - - 251 457 318 No 3 76 1014486 52.0 103 2029 - - - - 251 457 330 No 3-1/4 83 1014501 66.0 119 2332 - - - - 254 508 343 No 3-1/2 89 1014529 91.0 126 2483 - - - - 305 610 394 No 3-3/4 95 1015051 90.0 152 2990 - - - - 254 508 343 No 4 102 1015060 120 169 3319 - - - - 305 610 406 No 4-1/4†† 108 1015067 137 160 3150 - - - - 305 610 - No 4-1/2†† 114 1015079 156 163 3202 - - - - 356 711 - No 4-3/4†† 121 1015088 198 176 778,000 - - - - 356 711 - No 5†† 127 1015094 234 179 790,000 - - - - 381 762 - No Important Notes Design Factor: 5:1 (for single leg slings or resultant load with angle ≤120°) Offshore Container Master Links (†): Proof tested at 2.5x WLL Welded Master Links (††): Minimum ultimate load = 4x WLL Markings: Forgings include Product Identification Code (PIC), size, \"Crosby\", and \"USA\" in raised letters W Sizes: Have enlarged inside dimensions for extra room for sling hardware and crane hooks Conformance: Conforms with ASTM A952 and ASME B30.9 standards Testing: These links are 100% proof tested, MPI and impact tested, and have 3.1 test certification available on request Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Forged Master Link Master Link Assembly Connecting Link (Hammer Lock) Web Sling Connector Clevis Chain Sling Hook Clevis Self‑Locking Hook Eye Self‑Locking Hook Swivel Self‑Locking Hook Eye Hoist Hook Eye Foundry Hook Eye Grab Hook Clevis Grab Hook Quick Links Home About Us All Products Contact Certifications ASME B30.26 Certified DNV Offshore Certified OSHA Compliant ISO Quality Standards © 2025 Portside India Traders. All Rights Reserved. Crosby® is a registered trademark of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/MasterLinkAssembly.html", "text": "Portside India Traders - Crosby Welded Master Links Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby® A-347 Welded Master Link Assembly Premium welded lifting links engineered for maximum safety and reliability Request a Quote Master Links Overview Our Crosby® A-347 Welded Master Link Assemblies are made of high-strength alloy steel, quenched and tempered for superior performance. Designed with safety as the top priority, these master links are individually proof tested and meet the highest industry standards. Key Features Made of alloy steel - quenched and tempered Individually proof tested to the values shown, with certification 5:1 Design Factor Proof tested with 70% inside width special fixtures to avoid localized point loading per EN1677 Main link marked with Product Identification Code (PIC) for material traceability Sublinks marked with individual traceability code Type approved to DNV Certification Notes 2.7-1 Offshore Containers 100% proof tested and every batch is impact tested 3.1 test certification available upon request Engineered flat for use with S-1325A coupler link Fatigue rated to 20,000 cycles at 1.5 times the Working Load Limit Meets/exceeds ASME B30.26 standards Available only in EMEA Offshore Approved Type approved to DNV Certification Notes 2.7-1 Offshore Containers Welded Construction High-strength welded assembly for superior durability Fatigue Rated Rated at 1.5 times the Working Load Limit at 20,000 cycles Safety Certified Meets/exceeds ASME B30.26 standards Technical Specifications All Crosby A-347 Welded Master Link Assemblies feature alloy steel construction with quenched and tempered treatment. Available in multiple sizes with various load capacities. Stock No. Weight (kg) Grade 100 Chain Size (mm) Grade 80 Chain Size (mm) WLL (t) Proof Load (t) A (mm) B (mm) C (mm) D (mm) E (mm) F (mm) G (mm) Flat Size for S1325A 1257755 1.1 6 6 3.2 8.0 13 60 120 13 120 60 6.5 6 1257762 1.6 6 6, 7 4.1 10.3 17 90 160 13 120 60 6.5 6, 7 1257832 1.8 6, 7 7 4.2 10.6 19 90 160 13 120 60 6.5 7, 8 1258058 3.3 8 10 7.0 17.5 22 100 180 17 160 90 8.5 10 1258067 4.1 8 10 7.0 17.5 22 145 275 17 160 90 8.5 10 1258049 3.8 10 10 8.5 21.2 22 100 180 19 160 90 8.5 10 1258076 4.6 10 10 8.9 22.2 25 115 210 19 160 90 8.5 10 1258102 5.3 10 10 8.9 22.2 25 145 275 19 160 90 8.5 10 1258142 7.2 13 13 14.5 36.2 28 145 275 22 180 100 10.5 13 1258182 9.9 13 16 17.0 42.5 32 145 275 25 210 115 13.5 16 1258185 12.7 16 16 23.6 59.0 36 155 285 28 190 110 13.5 16 1258187 18.4 16 19, 20 28.1 70.2 40 140 270 32 275 145 16.7 - 1258402 26.7 19, 20 22 38.3 95.7 45 180 340 36 285 155 - - 1258471 35.5 22, 23 26 45.0 112.5 51 215 390 40 270 140 - - 1258491 61.1 26 32 67.0 167.5 55 203 406 51 390 215 - - Important Notes Design Factor: 5:1 based on single-leg slings or multiple legs with included angle ≤ 120° Wire Rope & Synthetic Sling Applications: Require a Design Factor of 5 Chain Slings: Require a 4:1 Design Factor Proof Test Load: Meets/exceeds ASTM A952(8.1) and ASME B30.9 Manufactured Flats: Not available for links above 32mm (1-1/4\") Traceability: Main link marked with Product Identification Code (PIC) for material traceability, Grade, CE, chain size, and \"CG\" Sublinks: Marked with individual traceability code Availability: Available only in EMEA Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Forged Master Link Master Link Assembly Connecting Link (Hammer Lock) Web Sling Connector Clevis Chain Sling Hook Clevis Self‑Locking Hook Eye Self‑Locking Hook Swivel Self‑Locking Hook Eye Hoist Hook Eye Foundry Hook Eye Grab Hook Clevis Grab Hook Quick Links Home About Us All Products Contact Certifications ASME B30.26 Certified DNV Offshore Certified OSHA Compliant ISO Quality Standards © 2025 Portside India Traders. All Rights Reserved. Crosby® is a registered trademark of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/ConnectingLinks.html", "text": "Portside India Traders - Crosby Connecting Links Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby® A-1337 LOK-A-LOY® 10 Alloy Connecting Link Premium alloy connecting links engineered for maximum strength and safety Request a Quote Connecting Links Overview Our Crosby® A-1337 LOK-A-LOY® 10 Alloy Connecting Links are made of high-strength alloy steel, quenched and tempered for superior performance. Designed with safety as the top priority, these connecting links are proof tested and meet the highest industry standards. Key Features 25% stronger than Grade 80 alloy chain Permanently embossed with CG (Crosby Group) and \"10\" (Grade) Red paint finish for 6–16 mm sizes Black paint finish for 20–32 mm sizes Meets ASTM A973 for Grade 10 chain Proof tested at 2.5× the Working Load Limit (WLL), with certification Compatible with both Grade 80 and Grade 100 chains Forged alloy steel – quenched and tempered Locking system enables simple assembly/disassembly – no special tools needed Meets ASTM A952 standards for Grade 100 chain fittings Sizes 7 mm to 26 mm are fatigue rated 4:1 Design Factor Strength Advantage 25% stronger than Grade 80 alloy chain Easy Locking System Simple assembly/disassembly with no special tools needed Fatigue Rated Sizes 7 mm to 26 mm are fatigue rated for long-term use Safety Certified Meets ASTM A973 and ASTM A952 standards Technical Specifications All Crosby A-1337 LOK-A-LOY® 10 Alloy Connecting Links feature alloy steel construction with quenched and tempered treatment. Available in multiple sizes with various load capacities. Chain Size (in) Chain Size (mm) Stock No. Pkg. Qty. Weight Each (kg) WLL (t) A (mm) B (mm) C (mm) D (mm) E (mm) F (mm) 9/32 (1/4) 7 1015104 60 0.13 2.0 9.7 49.3 50.8 20.3 17.3 13.5 5/16 8 1015113 50 0.19 2.6 9.4 59.9 54.1 25.1 18.3 15.0 3/8 10 1015122 40 0.35 4.0 13.0 67.3 64.8 27.7 23.1 18.5 1/2 13 1015136 12 0.73 6.8 17.3 87.9 86.1 36.8 28.7 22.6 5/8 16 1015145 10 1.41 10.3 19.8 108.0 101.6 45.0 34.0 30.5 3/4 20 1015154 1 2.90 16.0 25.7 130.6 134.6 54.6 41.7 39.6 7/8 22 1015163 1 3.56 19.4 27.7 138.7 146.8 57.7 50.0 39.4 1 26 1015172 1 5.01 27.1 31.5 150.9 165.1 61.2 56.1 47.8 1-1/4 32 1015181 1 9.53 41.0 39.6 188.7 193.0 78.0 65.3 56.4 Important Notes Design Factor: 4:1 for all applications Proof Testing: Each link is proof tested at 2.5× the Working Load Limit (WLL) Finishes: Red paint for sizes 6–16 mm, Black paint for sizes 20–32 mm Markings: Permanently embossed with CG (Crosby Group) and \"10\" (Grade) Compatibility: Compatible with both Grade 80 and Grade 100 chains Construction: Forged alloy steel – quenched and tempered Fatigue Rating: Sizes 7 mm to 26 mm are fatigue rated Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Forged Master Link Master Link Assembly Connecting Link (Hammer Lock) Web Sling Connector Clevis Chain Sling Hook Clevis Self‑Locking Hook Eye Self‑Locking Hook Swivel Self‑Locking Hook Eye Hoist Hook Eye Foundry Hook Eye Grab Hook Clevis Grab Hook Quick Links Home About Us All Products Contact Certifications ASME B30.26 Certified ASTM A973 Compliant ASTM A952 Compliant ISO Quality Standards © 2025 Portside India Traders. All Rights Reserved. Crosby® and LOK-A-LOY® are registered trademarks of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/WebSlingConnectors.html", "text": "Portside India Traders - Crosby Sling Connectors Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby® S-237 & S-238 High Performance Sling Connectors Premium connectors designed for maximum load distribution and sling efficiency Request a Quote Sling Connectors Overview Our Crosby® S-237 and S-238 High Performance Sling Connectors are engineered to provide superior load distribution and enhanced sling efficiency. Designed for use with slings made of all materials, these connectors allow easy connection to master links or eye hooks. Key Features Designed for use with slings made of all materials Allows easy connection to master links or eye hooks - ideal for bridles Increased bow radius provides wider sling bearing surface Better load distribution on internal fibers Enhances sling efficiency, allowing 100% of the sling's WLL to be achieved Made from alloy steel, forged construction Marked with Product Identification Code (PIC), frame size, and \"Crosby\" Meets WSTDA-RS1 minimum diameter and effective contact width specifications Design Factor: 5:1 Maximum Proof Load: 2× WLL (when used at 4:1 Design Factor) Enhanced Load Distribution Increased bow radius provides wider sling bearing surface Full Sling Efficiency Allows 100% of the sling's WLL to be achieved Forged Construction Made from alloy steel for superior durability Safety Certified Meets WSTDA-RS1 specifications Technical Specifications Available in two models - S-237 and S-238 - each designed to meet specific application requirements. Both models feature alloy steel construction with forged treatment. S-237 Connector S-238 Connector S-237 High Performance Sling Connector Specifications WLL (4:1) kg WLL (5:1) kg Stock No. Frame No. Sling Width (mm) Lok-A-Loy Size (mm) Weight (kg) A (mm) B (mm) C (mm) E (mm) G (mm) H (mm) L (mm) N (mm) R (mm) S (mm) W (mm) 2835 2268 1020695 5 51 10 0.52 22.4 36.1 50.8 80.8 25.4 20.3 107 26.4 74.2 12.2 35.1 5670 4536 1020704 10 76 16 1.34 36.1 38.6 69.9 105 31.8 24.9 144 43.4 100 19.0 44.5 8505 6804 1020713 15 76 20 2.15 41.4 40.1 69.9 111 35.1 27.9 165 51.8 113 23.6 47.8 14175 11340 1020722 25 102 22 3.90 50.8 59.2 95.3 152 44.5 35.8 202 57.7 140 26.9 57.2 17010 13607 1020731 30 102 22 4.19 50.8 55.9 95.3 157 44.5 35.8 199 57.7 137 26.9 60.5 22680 18145 1020740 40 127 26 7.10 57.2 73.9 121 184 57.2 45.2 240 62.0 164 31.0 78.5 34020 27215 1020759 60 152 32 11.8 65.0 85.3 146 232 58.7 47.2 281 78.0 196 38.1 80.3 S-238 High Performance Sling Connector Specifications WLL (kg) Stock No. Frame No. Sling Width (mm) Weight (kg) A (mm) B (mm) C (mm) E (mm) G (mm) H (mm) K (mm) M (mm) W (mm) 2268 1020415 5 50.8 0.73 22.4 36.1 50.8 80.8 25.4 20.3 124 83.8 35.1 4536 1020423 10 76.2 1.50 36.1 38.6 69.9 105 31.8 24.9 145 95.5 44.5 6804 1020432 15 76.2 2.22 41.4 40.1 69.9 111 35.1 27.9 156 101 47.8 11340 1020441 25 102 4.58 50.8 59.2 95.3 152 44.5 35.8 213 142 57.2 13608 1020450 30 102 5.17 50.8 55.9 95.3 157 44.5 35.8 207 135 60.5 18144 1020469 40 127 9.39 57.2 73.9 121 184 57.2 45.2 266 176 78.5 27216 1020478 60 152 14.5 65.0 85.3 146 232 58.7 47.2 298 203 80.3 Important Notes Design Factor: 5:1 for all applications Proof Load: Maximum 2× WLL when used at 4:1 Design Factor Construction: Made from alloy steel with forged construction Markings: Each connector is marked with Product Identification Code (PIC), frame size, and \"Crosby\" Compatibility: Designed for use with slings made of all materials Standards: Meets WSTDA-RS1 minimum diameter and effective contact width specifications Application: Ideal for bridles and multi-leg sling configurations Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Forged Master Link Master Link Assembly Connecting Link (Hammer Lock) Web Sling Connector Clevis Chain Sling Hook Clevis Self‑Locking Hook Eye Self‑Locking Hook Swivel Self‑Locking Hook Eye Hoist Hook Eye Foundry Hook Eye Grab Hook Clevis Grab Hook Quick Links Home About Us All Products Contact Certifications WSTDA-RS1 Compliant ASME Certified OSHA Compliant ISO Quality Standards © 2025 Portside India Traders. All Rights Reserved. Crosby® is a registered trademark of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/ClevisChainSlingHook.html", "text": "Portside India Traders - Crosby Clevis Chain Hook Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby® S-314A Clevis Chain Hook with Integrated Latch Premium forged alloy steel hooks engineered for maximum strength and safety Request a Quote Clevis Chain Hook Overview The Crosby® S-314A Clevis Chain Hook with Integrated Latch is manufactured from high-strength forged alloy steel, quenched and tempered for superior performance. Designed for secure connections in demanding lifting applications, this hook features an integrated heavy-duty latch for enhanced safety. Key Features Forged alloy steel construction - quenched & tempered Integrated heavy-duty latch for secure connections Individually proof tested at 2.5× WLL with certification Meets ASTM A952 standards for Grade 80 chain fittings Fatigue rated to 20,000 cycles at 1.5× WLL 4:1 Design Factor for Grade 80 Chain Available in sizes for 6mm to 16mm chain Replacement latches available for maintenance Heavy-Duty Construction Forged alloy steel, quenched and tempered for superior strength and durability Integrated Safety Latch Heavy-duty integrated latch prevents accidental disengagement Fatigue Rated Rated for 20,000 cycles at 1.5× WLL for long service life Quality Certified Proof tested and certified to meet ASTM A952 standards Technical Specifications The S-314A Clevis Chain Hook is available in multiple sizes with varying load capacities to suit different chain diameters and lifting requirements. Chain Size (in) Chain Size (mm) Stock No. Grade 80 WLL (t) Weight (kg) D (mm) E (mm) G (mm) K (mm) R (mm) T (mm) Replacement Latch No. - 6 1225020 1.12 0.32 66.0 20.6 20.0 16.0 72.3 26.0 1291332 1/4 - 5/16 7 - 8 1225021 2.00 0.70 89.0 27.4 28.0 20.5 98.0 32.6 1291402 3/8 10 1225091 3.15 1.29 110.5 36.1 29.3 24.0 125.3 42.2 1291472 1/2 13 1225161 5.3 2.34 138.5 38.6 42.1 29.5 144.5 49.2 1291542 5/8 16 1225162 8.0 3.67 166.5 48.5 52.0 38.0 172.6 58.9 1291612 Important Notes Design Factor: 4:1 for Grade 80 Chain applications Proof Testing: Each hook is individually proof tested at 2.5× the Working Load Limit (WLL) Compatibility: Designed for use with Grade 80 chains Fatigue Rating: Rated for 20,000 cycles at 1.5× WLL Maintenance: Replacement latches are available for each size Standards: Meets ASTM A952 standards for Grade 80 chain fittings Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Forged Master Link Master Link Assembly Connecting Link (Hammer Lock) Web Sling Connector Clevis Chain Sling Hook Clevis Self‑Locking Hook Eye Self‑Locking Hook Swivel Self‑Locking Hook Eye Hoist Hook Eye Foundry Hook Eye Grab Hook Clevis Grab Hook Quick Links Home About Us All Products Contact Certifications ASME B30.26 Certified ASTM A952 Compliant ISO Quality Standards © 2025 Portside India Traders. All Rights Reserved. Crosby® and S-314A are registered trademarks of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/ClevisSelfLockingHook.html", "text": "Portside India Traders - Crosby S-1317 Clevis Hook Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby® S-1317 Clevis Hook Premium self-locking clevis hook engineered for maximum safety and reliability Request a Quote Clevis Hook Overview The Crosby® S-1317 Clevis Hook is a heavy-duty, self-locking hook manufactured from forged alloy steel and quenched & tempered for superior performance. Designed with safety as the top priority, this hook features a positive lock latch that automatically secures when under load. Key Features Forged alloy steel - quenched & tempered Individually proof tested to 2.5× WLL with certification Recessed trigger flush with hook body for damage protection Enlarged thumb access for easy operation Positive Lock Latch self-locks when loaded Designed for engineered flat eye to connect to S-1325 chain coupler Suitable for Grade 100 and Grade 80 chain OSHA compliant for personnel lifting when properly installed Fatigue rated to 20,000 cycles at 1.5× WLL 4:1 Design Factor for all applications Self-Locking Mechanism Positive Lock Latch automatically secures when under load Personnel Safe OSHA compliant for personnel lifting applications Fatigue Rated Rated for 20,000 cycles at 1.5× Working Load Limit Damage Protection Recessed trigger flush with hook body prevents damage Technical Specifications The S-1317 Clevis Hook is available in multiple sizes to accommodate chain from 6mm to 26mm with varying load capacities to suit different lifting requirements. Chain Size (in) Chain Size (mm) WLL (t) Stock No. Weight (kg) C (mm) D (mm) E (mm) G (mm) J (mm) L (mm) AA (mm) - 6 1.5 1028991 0.35 87.4 20.1 66.0 121 16.0 29.0 38.1 1/4 7 2.0 1029000 0.82 114 27.9 89.0 159 20.6 35.1 51.0 5/16 8 2.6 1029009 0.82 114 27.9 89.0 159 20.6 35.1 51.0 3/8 10 4.0 1029018 1.66 140 29.7 112 192 24.1 46.5 63.5 1/2 13 6.8 1029027 3.08 173 42.4 139 242 29.5 56.4 76.2 5/8 16 10.3 1029036 5.40 209 51.8 167 295 38.1 67.3 89.0 3/4 18-20 16.0 1029071 6.80 239 56.4 197 336 51.6 89.4 - 7/8 22 20.0 1029080 12.7 283 62.2 222 392 55.9 97.3 - 1 26 27.1 1029089 22.5 319 81.5 251 468 68.1 104 - Important Notes Design Factor: 4:1 for all applications Proof Testing: Each hook is individually proof tested at 2.5× WLL Chain Compatibility: Suitable for both Grade 80 and Grade 100 chains Personnel Lifting: OSHA compliant when properly installed Fatigue Rating: Rated for 20,000 cycles at 1.5× WLL Dimensions: All dimensions in millimeters (mm) Load Capacity: Working Load Limit (WLL) in metric tons (t) S-4338 Grab Hook Latch Kits These latch kits are designed for use with Crosby L-1338 and L-1358 Grab Hooks. Kits are shipped unassembled and individually packaged with installation instructions. Hook Size (in) Hook Size (mm) Stock No. Weight Each (kg) A (mm) B (mm) 1/4 7 1048426 0.01 4.7 40.4 3/8 10 1048435 0.01 4.7 45.2 1/2 13 1048444 0.02 6.3 57.2 5/8 16 1048453 0.03 7.9 65.2 Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Forged Master Link Master Link Assembly Connecting Link (Hammer Lock) Web Sling Connector Clevis Chain Sling Hook Clevis Self‑Locking Hook Eye Self‑Locking Hook Swivel Self‑Locking Hook Eye Hoist Hook Eye Foundry Hook Eye Grab Hook Clevis Grab Hook Quick Links Home About Us All Products Contact Certifications ASME B30.26 Certified ASTM A952 Compliant ISO Quality Standards OSHA Compliant © 2025 Portside India Traders. All Rights Reserved. Crosby® and S-1317 are registered trademarks of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/EyeSelfLockingHook.html", "text": "Portside India Traders - Crosby SHUR-LOC® Eye Hook Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby® S-1316 SHUR-LOC® Eye Hook Premium self-locking eye hook with positive locking latch for maximum safety Request a Quote SHUR-LOC® Eye Hook Overview The Crosby® S-1316 SHUR-LOC® Eye Hook with Positive Locking Latch is engineered for superior safety and reliability in critical lifting applications. Manufactured from forged alloy steel and quenched & tempered for maximum strength, this hook features innovative safety mechanisms that automatically engage under load. OSHA Approved for Personnel Lifting Complies with OSHA 1926.1431(g)(1)(i)(A) and 1926.1501(g)(4)(iv)(B) when properly installed and locked Key Features Forged alloy steel construction - quenched & tempered Recessed trigger design flush with hook body to prevent damage Enlarged thumb access for easy operation Positive lock latch automatically engages under load Approved for personnel lifting when properly installed Fatigue rated: 20,000 cycles at 1.5× Working Load Limit Individually proof tested at 2.5× WLL with certification Suitable for Grade 100 and Grade 80 chain Engineered flat design for use with S-1325 chain coupler Meets performance requirements of EN1677-3 4:1 Design Factor (based on Grade 100 chain) Deformation indicators present for safety checks Automatic Locking Positive lock latch automatically engages when under load Personnel Safe OSHA compliant for personnel lifting applications Damage Protection Recessed trigger design prevents accidental damage Fatigue Rated Rated for 20,000 cycles at 1.5× Working Load Limit Technical Specifications The S-1316 SHUR-LOC® Eye Hook is available in multiple sizes to accommodate chain from 6mm to 26mm with varying load capacities. All dimensions are in millimeters (mm) and Working Load Limits (WLL) in metric tons (t). Product Dimension Diagram (Image not included per requirements) Chain Size (in) Chain Size (mm) Stock No. Frame Code WLL 4:1 (t) WLL 5:1 (t) Weight (kg) A (mm) C (mm) D (mm) E (mm) F (mm) H (mm) J (mm) L (mm) AA* (mm) - 6 1022896 D 1.45 1.00 0.39 19.8 100 20.1 66.0 17.0 7.87 16.0 29.5 38.1 1/4–5/16 7–8 1022914 G 2.60 1.90 0.82 27.4 135 27.9 88.9 22.1 9.91 20.6 37.6 51.0 3/8 10 1022923 H 4.00 2.50 1.54 33.0 167 29.7 112 27.9 12.9 23.9 46.5 63.5 1/2 13 1022932 I 6.80 5.62 2.72 41.9 209 42.4 139 32.0 17.0 29.5 56.4 76.2 5/8 16 1022941 J 10.30 7.53 6.83 55.9 256 51.8 167 38.1 22.1 38.1 67.3 89.0 3/4 18–20 1022952 – 16.00 9.98 8.61 64.0 274 56.4 197 51.1 22.1 51.6 89.4 – 7/8 22 1022943 – 20.00 12.00 12.70 72.9 317 62.2 222 57.7 24.9 55.9 97.3 – 1 26 1022944 – 27.10 – 22.45 80.0 371 81.5 251 62.5 32.0 68.1 104 – Important Notes Design Factor: 4:1 based on Grade 100 chain Proof Testing: Each hook is individually proof tested at 2.5× WLL with certification Personnel Lifting: OSHA compliant when properly installed and locked Fatigue Rating: Rated for 20,000 cycles at 1.5× WLL Dimensions: All dimensions in millimeters (mm) Deformation Indicators: Present for safety checks Compatibility: Suitable for Grade 100 and Grade 80 chain Standard Compliance: Meets EN1677-3 performance requirements Note: Dimension A is measured before machining (as-forged) Safety Features Positive Locking Mechanism The latch automatically engages when under load, preventing accidental disengagement Recessed Trigger Design Flush with hook body to prevent damage during operation Ergonomic Operation Enlarged thumb access for easy operation even with gloves Certified Testing Individually proof tested at 2.5× WLL with certification Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Forged Master Link Master Link Assembly Connecting Link (Hammer Lock) Web Sling Connector Clevis Chain Sling Hook Clevis Self‑Locking Hook Eye Self‑Locking Hook Swivel Self‑Locking Hook Eye Hoist Hook Eye Foundry Hook Eye Grab Hook Clevis Grab Hook Quick Links Home About Us All Products Contact Certifications ASME B30.26 Certified OSHA Compliant EN1677-3 Compliant ISO Quality Standards © 2025 Portside India Traders. All Rights Reserved. Crosby® and SHUR-LOC® are registered trademarks of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/SwivelSelfLockingHook.html", "text": "Portside India Traders - Crosby SHUR-LOC® Swivel Hook with Bearing Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby® S-13326 SHUR-LOC® Swivel Hook with Bearing Premium rotating self-locking hook with anti-friction bearing for maximum safety and efficiency Request a Quote SHUR-LOC® Swivel Hook Overview The Crosby® S-13326 SHUR-LOC® Swivel Hook with Anti-Friction Bearing is engineered for superior performance in demanding lifting applications. Manufactured from forged alloy steel and featuring a unique bearing design, this hook rotates freely under load while maintaining the safety of the SHUR-LOC® self-locking mechanism. OSHA Approved for Personnel Lifting Complies with OSHA 1926.1431(g)(1)(i)(A) and 1926.1501(g)(4)(iv)(B) when properly installed and locked Key Features Anti-friction bearing allows free rotation under load Forged alloy steel construction - quenched & tempered Self-locking latch engages automatically when loaded Recessed trigger design prevents damage during operation Large thumb access for easy operation with gloves Approved for personnel lifting when properly installed Fatigue rated: 20,000 cycles at 1.5× Working Load Limit Individually proof tested at 2.5× WLL with certification Rated for wire rope and Grade 80 / Grade 100 chains Design Factor: 4:1 for chain (5:1 available for added safety) Deformation indicators present for safety checks Trigger repair kit available (S-4316) Free Rotation Anti-friction bearing allows rotation under load Automatic Locking Self-locking latch engages when under load Personnel Safe OSHA compliant for personnel lifting applications Easy Maintenance Trigger repair kit available for maintenance Technical Specifications The S-13326 SHUR-LOC® Swivel Hook with Bearing is available in multiple sizes with varying load capacities. All dimensions are in millimeters (mm) and Working Load Limits (WLL) in metric tons (t). Chain Size (in) Chain Size (mm) Frame Code WLL 4:1 (t) WLL 5:1 (t) Stock No. Weight (kg) A (mm) B (mm) C (mm) D (mm) E (mm) F (mm) H (mm) J (mm) L (mm) AA* (mm) - 6 D 1.45 1.16 1004304 0.57 38.1 33.5 156 20.1 66.0 17.0 12.7 16.0 28.7 38.1 1/4–5/16 7–8 G 2.60 2.10 1004313 1.18 44.5 40.4 193 27.9 88.9 22.1 16.0 20.6 35.1 51.0 3/8 10 H 4.00 3.20 1004322 2.13 50.8 43.9 224 29.7 112 27.9 19.1 23.9 44.5 63.5 1/2 13 I 6.80 5.40 1004331 3.92 63.5 60.5 284 42.4 139 32.0 25.4 29.5 53.6 76.2 5/8 16 - 10.30 8.20 1004340 7.71 69.9 64.3 328 51.8 167 38.1 28.7 38.1 63.2 89.0 3/4 18 - 16.00 12.80 1004349 10.9 71.9 64.0 358 56.4 197 51.1 27.9 51.6 89.4 127 7/8 22 - 20.00 16.00 1004358 13.2 87.4 81.0 417 62.2 222 57.4 33.0 55.9 97.3 152 Important Notes Design Factor: 4:1 for chain (5:1 available for added safety) Proof Testing: Each hook is individually proof tested at 2.5× WLL with certification Personnel Lifting: OSHA compliant when properly installed and locked Fatigue Rating: Rated for 20,000 cycles at 1.5× WLL Dimensions: All dimensions in millimeters (mm) Deformation Indicators: Present for safety checks Compatibility: Suitable for wire rope and Grade 80 / Grade 100 chains Maintenance: Trigger repair kit available (S-4316 - includes spring, roll pin, trigger) Safety: Self-locking latch engages automatically when loaded Safety Features Free Rotation Under Load Anti-friction bearing allows the hook to rotate freely even when under load Self-Locking Latch Automatically engages when loaded to prevent accidental disengagement Recessed Trigger Protected design prevents damage during operation Rigorous Testing Individually proof tested at 2.5× WLL with certification Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Forged Master Link Master Link Assembly Connecting Link (Hammer Lock) Web Sling Connector Clevis Chain Sling Hook Clevis Self‑Locking Hook Eye Self‑Locking Hook Swivel Self‑Locking Hook Eye Hoist Hook Eye Foundry Hook Eye Grab Hook Clevis Grab Hook Quick Links Home About Us All Products Contact Certifications ASME B30.26 Certified OSHA Compliant EN1677-3 Compliant ISO Quality Standards © 2025 Portside India Traders. All Rights Reserved. Crosby® and SHUR-LOC® are registered trademarks of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/EyeHoistHook.html", "text": "Portside India Traders - Crosby® Eye Hoist Hook Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby® Eye Hoist Hooks L-320CN Premium lifting hooks with QUIC-CHECK® deformation indicators for enhanced safety Request a Quote Eye Hoist Hook Overview The Crosby® L-320CN Eye Hoist Hook is engineered for superior performance in demanding lifting applications. Available in carbon steel and alloy steel, these hooks are rigorously tested for chemical composition and tensile strength to ensure reliability in critical operations. Fatigue Rated for 20,000 Cycles Tested at 1.5× Working Load Limit for maximum durability and safety Key Features Available in carbon steel and alloy steel Fatigue rated to 20,000 cycles at 1.5× Working Load Limit Each piece tested with chemical analysis and tensile testing Includes QUIC-CHECK® deformation and angle indicators Load rated and marked with Working Load Limit Multiple model variants for various applications Proof load tested for safety assurance Designed with high safety factors Material Options Available in carbon steel and alloy steel variants Fatigue Rated 20,000 cycles at 1.5× Working Load Limit QUIC-CHECK® Deformation and angle indicators for safety Rigorous Testing Chemical analysis and tensile testing on each piece Model Variants L-320C Frame Size O-T L-320N / L-320 Standard Eye Hooks GL-320CN Galvanized Carbon Steel L-320A / L-320AN Alloy Steel Variants Technical Specifications The L-320CN Eye Hoist Hook is available in multiple sizes with varying load capacities. All specifications are in metric tons (t) and kilograms (kg). Design Factors Carbon Hooks 5:1 Design Factor Alloy Hooks (1t-22t) 5:1 Design Factor Alloy Hooks (30t-60t) 4.5:1 Design Factor Proof Load Specifications 3/4t Carbon - 22t Alloy 2.5× Working Load Limit 20t Carbon - 60t Alloy 2× Working Load Limit WLL (t) Hook ID Code Carbon Stock No. Galv. Carbon Stock No. Alloy Stock No. Weight (kg) S-4320 Stock No. PL Stock No. SS-4055 Stock No. 0.75 +D 1022205 1022208 1022380 0.28 1096325 - - 1 +F 1022216 1022219 1022391 0.40 1096374 - - 1.6 +G 1022227 1022230 1022402 0.65 1096421 - - 2 +H 1022238 1022241 1022413 0.94 1096468 - - 3.2 - 1022246 1022249 1022424 1.95 1096515 1092000 - 5 +J 1022260 1022262 1022435 3.76 1096562 1092001 - 7.5 tK 1022271 1022274 1022446 6.80 1096609 1092002 - 10 +L 1022282 1022285 1022457 9.42 1096657 1092003 - 15 +N 1022293 1022296 1022468 17.9 1096704 1092004 - 20 O 1022302 - 1022477 27.2 1093716 1090161 - 25 P 1023306 - 1023565 47.6 1093717 1090189 - 30 S 1023324 - 1023583 67.0 - 1090189 - 40 T 1023342 - 1023609 103.0 - 1090205 - Important Notes Material Options: Available in carbon steel and alloy steel variants Fatigue Rating: Rated for 20,000 cycles at 1.5× Working Load Limit Testing: Each piece tested with chemical analysis and tensile testing Safety Indicators: QUIC-CHECK® deformation and angle indicators included Design Factors: Carbon Hooks: 5:1 Alloy Hooks (1t-22t): 5:1 Alloy Hooks (30t-60t): 4.5:1 Proof Load: 3/4t Carbon through 22t Alloy = 2.5× WLL 20t Carbon through 60t Alloy = 2× WLL Working Load Limit: Clearly marked on each hook for safety compliance Compatibility: Designed for various lifting applications including industrial and marine Safety Features QUIC-CHECK® Indicators Deformation and angle indicators for quick safety verification Fatigue Resistance Rated for 20,000 cycles at 1.5× Working Load Limit Material Integrity Each piece undergoes chemical analysis and tensile testing Proof Load Tested Rigorous testing at 2-2.5× WLL depending on material Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Forged Master Link Master Link Assembly Connecting Link (Hammer Lock) Web Sling Connector Clevis Chain Sling Hook Clevis Self‑Locking Hook Eye Self‑Locking Hook Swivel Self‑Locking Hook Eye Hoist Hook Eye Foundry Hook Eye Grab Hook Clevis Grab Hook Quick Links Home About Us All Products Contact Certifications ASME B30.26 Certified OSHA Compliant EN1677-3 Compliant ISO Quality Standards © 2025 Portside India Traders. All Rights Reserved. Crosby® is a registered trademark of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/EyeFoundryHook.html", "text": "Portside India Traders - Crosby® Eye Foundry Hook Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby® A-1329 Eye Foundry Hook Premium forged alloy steel hook engineered for demanding foundry applications Request a Quote Eye Foundry Hook Overview The Crosby® A-1329 Eye Foundry Hook is engineered for superior performance in the most demanding industrial environments. Manufactured from forged alloy steel and quenched & tempered for maximum strength, this hook is designed to withstand extreme conditions found in foundry applications. Optimized for Foundry Applications Specially designed to withstand high-heat environments and demanding industrial conditions Key Features Forged alloy steel construction – quenched & tempered Proof tested to 2.5× Working Load Limit (WLL) with certification Product Identification Code (PIC), Crosby name, and chain size engraved Suitable for Grade 100 and Grade 80 chain Fatigue rated to 20,000 cycles at 1.5× WLL Can be tip loaded at reduced WLL (operator must ensure load retention) Design Factor: 4:1 for maximum safety Durable construction for long service life in harsh environments Clear working load limit markings for safety compliance Heat Resistant Engineered to perform in high-temperature foundry environments Proof Tested Individually tested at 2.5× WLL with certification Fatigue Rated 20,000 cycles at 1.5× Working Load Limit Dual Loading Can be loaded at saddle or tip (with reduced capacity) Technical Specifications The A-1329 Eye Foundry Hook is available in multiple sizes with varying load capacities. All dimensions are in millimeters (mm) and Working Load Limits (WLL) in metric tons (t). Design Factor: 4:1 Engineered for maximum safety in demanding applications Dimensions and Load Capacities Chain Size (in) Chain Size (mm) Stock No. WLL at Saddle (t) WLL at Tip (t) Weight (kg) B (mm) D (mm) I (mm) K (mm) L (mm) M (mm) N (mm) O (mm) AA (mm) 1/4–5/16 7–8 1026280 2.6 1.3 0.91 39.6 122.4 22.4 39.9 16.0 122.2 63.5 28.7 89 3/8 10 1026289 4.0 2.0 1.72 52.6 147.8 33.0 47.8 20.6 139.7 76.2 35.1 102 1/2 13 1026297 6.8 3.4 3.27 64.3 178.8 38.1 57.2 26.2 180.6 88.9 41.4 114 5/8 16 1026306 10.3 5.1 5.58 76.2 207.5 44.5 64.3 31.8 202.2 101.6 55.6 127 3/4 18–20 1026315 16.0 8.0 10.4 104.9 245.1 55.9 86.1 50.0 273.1 127.0 61.0 165 7/8 22–23 1026324 21.0 10.0 18.4 121.2 280.2 69.1 95.0 57.9 311.2 139.7 78.0 178 1 26 1026333 27.1 13.5 23.5 135.4 302.3 71.9 99.8 65.0 339.6 152.4 84.1 191 1 1/4 32 1026342 41.0 20.5 38.3 167.9 336.6 88.9 110.0 80.0 387.4 165.1 97.5 203 Important Notes Material: Forged alloy steel – quenched & tempered for maximum strength Proof Testing: Each hook is individually proof tested at 2.5× WLL with certification Fatigue Rating: Rated for 20,000 cycles at 1.5× WLL Tip Loading: Can be tip loaded at reduced WLL (operator must ensure load retention) Chain Compatibility: Suitable for Grade 100 and Grade 80 chain Identification: Product Identification Code (PIC), Crosby name, and chain size engraved Design Factor: 4:1 for maximum safety Applications: Ideal for foundry, industrial, and heavy manufacturing environments Safety Features Foundry-Optimized Specially engineered for high-heat and demanding industrial environments Forged Alloy Steel Quenched & tempered for maximum strength and durability Fatigue Resistance Rated for 20,000 cycles at 1.5× Working Load Limit Proof Tested Each hook individually tested at 2.5× WLL with certification Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Forged Master Link Master Link Assembly Connecting Link (Hammer Lock) Web Sling Connector Clevis Chain Sling Hook Clevis Self‑Locking Hook Eye Self‑Locking Hook Swivel Self‑Locking Hook Eye Hoist Hook Eye Foundry Hook Eye Grab Hook Clevis Grab Hook Quick Links Home About Us All Products Contact Certifications ASME B30.26 Certified OSHA Compliant EN1677-3 Compliant ISO Quality Standards © 2025 Portside India Traders. All Rights Reserved. Crosby® is a registered trademark of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/EyeGrabHook.html", "text": "Portside India Traders - Crosby® Eye Grab Hook Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby® Eye Grab Hooks Premium forged alloy steel grab hooks for maximum chain efficiency and safety Request a Quote Grab Hook Overview Crosby® Grab Hooks are engineered for superior performance in demanding lifting applications. Available in both Cradle Grab Hook and standard Grab Hook designs, these forged alloy steel hooks are quenched & tempered for maximum strength and durability. Optimized for Chain Efficiency Cradle design allows for 100% efficiency of Grade 100 chain Key Features Forged alloy steel construction – quenched & tempered Proof tested to 2.5× Working Load Limit (WLL) with certification Product Identification Code (PIC), size, and Crosby name engraved Suitable for Grade 100 and Grade 80 chain Fatigue rated to 20,000 cycles at 1.5× WLL Cradle design allows full sling capacity in choker configuration Design Factor: 4:1 for maximum safety Durable construction for long service life Forged Alloy Steel Quenched & tempered for maximum strength Proof Tested Individually tested at 2.5× WLL with certification Fatigue Rated 20,000 cycles at 1.5× Working Load Limit Chain Efficiency 100% efficiency with Grade 100 chain Technical Specifications Cradle Grab Hook (A-1338) Standard Grab Hook (A-1358) Cradle Grab Hook (A-1338) Dimensions The innovative cradle design allows for 100% efficiency of Grade 100 chain and full sling capacity in choker configuration (minimum choke angle: 120°). Design Factor: 4:1 Engineered for maximum safety in demanding applications Chain Size (in) Chain Size (mm) WLL (t) A-1338 Stock No. L-1338 Stock No. Weight (kg) A (mm) B (mm) C (mm) D (mm) E (mm) F (mm) S-4338 Latch Kit 1/4 7 2.0 1049417 1049480 0.20 43.7 64.5 55.9 98.5 38.1 22.4 1048426 5/16 8 2.6 1049426 1049489 0.45 43.7 64.5 55.4 98.5 38.1 22.4 1048426 3/8 10 4.0 1049435 1049498 0.82 47.0 78.5 65.5 119 46.5 27.7 1048435 1/2 13 6.8 1049444 1049507 1.78 60.7 97.3 83.3 149 57.2 36.1 1048444 Cradle Grab Hook Features Innovative Design: Cradle shape allows for 100% efficiency of Grade 100 chain Choker Configuration: Maintains full sling capacity with minimum 120° choke angle Material: Forged alloy steel – quenched & tempered Proof Testing: Each hook individually proof tested at 2.5× WLL with certification Fatigue Rating: Rated for 20,000 cycles at 1.5× WLL Identification: Product Identification Code (PIC), size, and Crosby name engraved Chain Compatibility: Suitable for Grade 100 and Grade 80 chain Design Factor: 4:1 for maximum safety Standard Grab Hook (A-1358) Dimensions The Crosby® A-1358 Grab Hook provides reliable performance for various lifting applications with forged alloy steel construction. Design Factor: 4:1 Engineered for maximum safety in demanding applications Chain Size (in) Chain Size (mm) WLL (t) A-1358 Stock No. L-1358 Stock No. Weight (kg) A (mm) B (mm) C (mm) D (mm) F (mm) S-4338 Latch Kit 1/4 7 2.0 1049610 1049605 0.20 43.7 64.5 55.9 98.5 22.4 1048426 5/16 8 2.6 1049629 1049614 0.45 43.7 64.5 55.4 98.5 22.4 1048426 3/8 10 4.0 1049638 1049623 0.82 47.0 78.5 65.5 119 27.7 1048435 1/2 13 6.8 1049647 1049634 1.78 60.7 97.3 83.3 149 36.1 1048444 5/8 16 10.3 1049656 1049643 3.18 67.8 115 97.8 179 44.5 1048453 Standard Grab Hook Features Reliable Performance: Proven design for various lifting applications Material: Forged alloy steel – quenched & tempered Proof Testing: Each hook individually proof tested at 2.5× WLL with certification Fatigue Rating: Rated for 20,000 cycles at 1.5× WLL Identification: Product Identification Code (PIC), size, and Crosby name engraved Chain Compatibility: Suitable for Grade 100 and Grade 80 chain Design Factor: 4:1 for maximum safety Versatility: Suitable for a wide range of industrial applications Safety Features Forged Alloy Steel Quenched & tempered for maximum strength and durability Proof Tested Each hook individually tested at 2.5× WLL with certification Fatigue Resistance Rated for 20,000 cycles at 1.5× Working Load Limit Chain Compatibility Suitable for Grade 100 and Grade 80 chain Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Forged Master Link Master Link Assembly Connecting Link (Hammer Lock) Web Sling Connector Clevis Chain Sling Hook Clevis Self‑Locking Hook Eye Self‑Locking Hook Swivel Self‑Locking Hook Eye Hoist Hook Eye Foundry Hook Eye Grab Hook Clevis Grab Hook Quick Links Home About Us All Products Contact Certifications ASME B30.26 Certified OSHA Compliant EN1677-3 Compliant ISO Quality Standards © 2025 Portside India Traders. All Rights Reserved. Crosby® is a registered trademark of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/ClevisGrabHooks.html", "text": "Portside India Traders - Crosby® Clevis & Eye Grab Hooks Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby® Clevis & Eye Grab Hooks Premium forged steel grab hooks for maximum chain efficiency and safety Request a Quote Grab Hook Overview Crosby® Grab Hooks are engineered for superior performance in demanding lifting applications. Available in both Clevis Grab Hook and Eye Grab Hook designs, these forged steel hooks are quenched & tempered for maximum strength and durability. Quenched & Tempered Forged steel construction Grade 8 Chain Specially designed for high-grade chains Quick Assembly Easy to install and use Safety Certified 4:1 Design Factor Key Features Forged steel construction – quenched & tempered Design factor: 4:1 for maximum safety Quick and easy assembly Designed specifically for Grade 8 chain Hooks with \"*\" are forged with an \"8\" to designate Grade 80 Require proof-testing per ASME B30.9 for overhead lifting* Durable construction for long service life Technical Specifications Clevis Grab Hook (A-330) Eye Grab Hook (A-323) Clevis Slip Hook (A-331) Clevis Grab Hook (A-330) Dimensions Forged steel – Quenched & Tempered | Design factor: 4:1 | Designed for Grade 8 chain Overhead Lifting Note Hooks with \"*\" are forged with an \"8\" to designate Grade 80 and require proof-testing per ASME B30.9 for overhead lifting* Chain Size (mm) Stock No. WLL (t) Weight (kg) A B C D E G H K L N P R 7 1027249* 1.59 0.16 25.4 8.15 8.15 46 8.65 22.4 18.3 11.9 77.5 44.5 7.85 41.7 8 1027267* 2.04 0.29 30.2 9.90 9.90 54 11.20 24.6 23.1 15.0 93.0 52.5 9.65 61.5 10 1027285* 3.22 0.45 35.1 11.40 11.40 64.5 12.70 29.7 25.4 18.3 109.0 59.5 11.20 61.0 13 1027329* 8.21 0.95 47.8 14.50 14.50 90.5 16.80 38.9 31.8 19.8 145.0 75.5 16.00 81.0 16 1027347 11.20 1.91 58.0 23.10 23.10 112 19.80 45.2 39.6 27.7 179.0 109.0 19.10 104.0 19 1027365 11.20 2.95 66.5 23.90 23.90 133 23.90 54.0 47.8 33.3 207.0 129.0 22.40 118.0 Product Notes Forged steel construction – quenched & tempered Design Factor: 4:1 for maximum safety Quick and easy assembly Designed specifically for Grade 8 chain Hooks with \"*\" are forged with an \"8\" to designate Grade 80 Require proof-testing per ASME B30.9 for overhead lifting* Eye Grab Hook (A-323) Dimensions Forged steel – Quenched & Tempered | Design factor: 4:1 | Designed for Grade 8 chain Overhead Lifting Note Hooks with \"*\" are Grade 80, suitable for overhead lifting if properly proof tested. Crosby recommends A-1328 for certified use* Chain Size (mm) Stock No. WLL (t) Weight (kg) A B C D E G K L N R 7 1026384* 1.59 0.13 27.7 13.50 7.85 46 8.65 22.4 11.90 77.5 44.5 47.8 8 1026400* 2.04 0.20 33.3 15.70 9.65 54 11.20 24.6 15.00 91.0 52.5 58.0 10 1026428* 3.22 0.36 39.6 19.10 11.20 64.5 12.70 29.7 18.30 109.0 59.5 68.5 13 1026464* 5.44 0.79 49.3 22.40 13.50 90.5 16.80 38.9 19.50 138.0 75.5 86.0 16 1026482* 8.21 1.47 60.5 26.90 16.80 112 19.80 48.0 25.40 169.0 96.0 104.0 19 1026507 11.20 2.69 73.0 35.10 19.10 133 23.90 54.0 33.30 205.0 129.0 131.0 Product Notes Forged steel construction – quenched & tempered Design Factor: 4:1 for maximum safety Designed specifically for Grade 8 chain Hooks with \"*\" are Grade 80, suitable for overhead lifting if properly proof tested Crosby recommends A-1328 for certified use* Clevis Slip Hook (A-331) Dimensions Forged alloy steel – Quenched & Tempered | Alloy steel pins – Quenched & Tempered Important Note Not recommended for Grade 80 or 100 slings used in overhead lifting applications Chain Size (mm) Stock No. WLL (t) Weight (kg) A B C D E F G H K L N P R T 7 1027524 1.25 0.25 26.9 8.15 7.35 70 23.90 30.20 20.60 22.40 12.70 100.0 54.00 7.87 65.50 18.30 8 1027542 1.95 0.36 31.0 10.90 8.65 77.5 26.90 31.80 23.90 25.40 14.20 115.0 57.00 9.65 73.00 24.60 10 1027560 2.38 0.55 35.1 11.40 11.20 92.0 33.30 38.10 28.70 30.20 16.80 131.0 65.00 11.20 82.50 26.90 11 1027588 3.18 0.93 43.9 15.00 15.20 110 39.60 46.00 35.10 36.60 20.60 152.0 77.50 14.20 94.00 30.20 13 1027604 4.08 1.25 47.8 14.50 13.50 122 42.90 49.30 39.60 41.40 23.10 166.0 87.50 16.00 102.0 33.30 16 1027622 6.12 2.15 58.5 18.00 18.00 143 51.00 60.50 46.00 49.30 27.70 200.0 102.0 19.10 125.0 39.60 19 1027640 8.73 5.12 81.0 30.00 32.80 187 63.50 76.20 60.50 63.50 36.60 255.0 129.0 25.40 155.0 53.00 Product Notes Forged alloy steel – quenched & tempered Alloy steel pins – quenched & tempered Design Factor: 4:1 for maximum safety Not recommended for Grade 80 or 100 slings used in overhead lifting applications Ideal for non-overhead lifting applications Safety Features Forged Steel Quenched & tempered for maximum strength and durability Design Factor 4:1 safety margin for maximum reliability Chain Compatibility Designed specifically for Grade 8 chain Heavy-Duty Construction Built for demanding industrial applications Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Forged Master Link Master Link Assembly Connecting Link (Hammer Lock) Web Sling Connector Clevis Chain Sling Hook Clevis Self‑Locking Hook Eye Self‑Locking Hook Swivel Self‑Locking Hook Eye Hoist Hook Eye Foundry Hook Eye Grab Hook Clevis Grab Hook Quick Links Home About Us All Products Contact Certifications ASME B30.26 Certified OSHA Compliant EN1677-3 Compliant ISO Quality Standards © 2025 Portside India Traders. All Rights Reserved. Crosby® is a registered trademark of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/DShackles_AnchorBowShackles.html", "text": "Portside India Traders - Crosby® Shackles Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby® Shackles Premium forged steel shackles for maximum lifting efficiency and safety Request a Quote Shackle Overview Crosby® Shackles are engineered for superior performance in demanding lifting applications. Available in various designs including bolt type chain shackles, screw pin anchor shackles, and more. These forged steel shackles are quenched & tempered for maximum strength and durability. Quenched & Tempered Forged steel construction Grade 6 High-strength alloy pins Durable Finish Hot-dip galvanized Safety Certified 6:1 Design Factor Key Features Forged steel construction - quenched & tempered Alloy pins for maximum strength Working Load Limit and Grade 6 permanently shown on every shackle Hot-dip galvanized (G) or self-colored (S) options Fatigue rated to 20,000 cycles at 1.5x Working Load Limit Approved for use in extreme temperatures (-40°C to 204°C) Meets or exceeds ASME B30.26 requirements Look for the Red Pin® - the mark of genuine Crosby quality Technical Specifications Design Factor: 6:1 Maximum Proof Load: 2 times the Working Load Limit Temperature Range: -40°C (-40°F) to 204°C (400°F) Fatigue Rating: 20,000 cycles at 1.5 times WLL Certifications: ASME B30.26, EN13889:2003, ABS, DIN, Lloyds, and more Technical Specifications Bolt Type Chain Shackles (G-2150/S-2150) Screw Pin Anchor Shackles (G-209/S-209) Screw Pin Chain Shackles (G-210/S-210) Bolt Type Anchor Shackles (G-2130/S-2130) Bolt Type Chain Shackles (G-2150/S-2150) Forged, Quenched & Tempered, with alloy pins | Design factor: 6:1 | Hot-dip galvanized (G) or self-colored (S) Key Features Working Load Limit and Grade 6 permanently shown on every shackle. Fatigue rated to 20,000 cycles at 1-1/2 times WLL. Meets or exceeds ASME B30.26. Type Approval certification available per ABS 2016 Steel Vessel Rules. Nominal Size (in / mm) WLL (t) Stock No. (G) Stock No. (S) Weight (kg) A (mm) B (mm) D (mm) F (mm) G (mm) K (mm) M (mm) P (mm) R (mm) 1/4 / 6.35 0.5 1019768 - 0.06 11.9 7.9 6.4 15.5 19.1 40.4 24.6 39.6 6.35 5/16 / 7.94 0.75 1019770 - 0.10 13.5 9.7 7.9 19.1 25.4 48.5 29.5 46.2 7.85 3/8 / 9.53 1 1019772 - 0.15 16.8 11.2 9.7 23.1 31.0 58.5 35.8 55.0 9.65 7/16 / 11.11 1.5 1019774 - 0.22 19.1 12.7 11.2 26.9 36.1 67.5 41.1 63.5 11.2 1/2 / 12.7 2 1019775 1019784 0.34 20.6 16.0 12.7 30.2 41.4 77.0 46.0 71.0 12.7 5/8 / 15.88 3.25 1019793 1019800 0.67 26.9 19.1 16.0 38.1 51.0 95.5 58.5 89.5 16.0 3/4 / 19.05 4.75 1019819 1019828 1.14 31.8 22.4 19.1 46.0 60.5 115 70.0 103 20.6 7/8 / 22.23 6.5 1019837 1019846 1.74 36.6 25.4 22.4 53.0 71.5 135 81.0 120 24.6 1 / 25.4 8.5 1019855 1019864 2.52 42.9 28.7 25.4 60.5 81.0 151 93.5 135 25.4 1-1/8 / 28.58 9.5 1019873 1019882 3.45 46.0 31.8 28.7 68.5 91.0 172 103 150 31.8 1-1/4 / 31.75 12 1019891 1019908 4.90 51.5 35.1 31.8 76.0 100 191 115 165 35.1 1-3/8 / 34.93 13.5 1019917 1019926 6.24 57.0 38.1 35.1 84.0 111 210 127 183 38.1 1-1/2 / 38.1 17 1019935 1019944 7.72 60.5 41.4 38.1 92.0 122 230 137 196 41.1 1-3/4 / 44.45 25 1019953 1019962 14.2 73.0 51.0 44.5 106 146 279 162 230 54.0 2 / 50.8 35 1019971 1019980 21.2 82.5 57.0 51.0 122 172 312 184 264 60.0 2-1/2 / 63.5 55 1019999 1020004 38.6 105 70.0 66.5 145 203 377 238 344 66.5 3 / 76.2 85 1020013 - 56.0 127 82.5 76.0 165 216 429 279 419 89.0 Product Notes Forged, quenched & tempered with alloy pins Hot-dip galvanized (G) or self-colored (S) Fatigue rated to 20,000 cycles at 1.5 times WLL Approved for use at -40°C to 204°C Meets or exceeds ASME B30.26 requirements Sizes 1/2t - 25t meet EN13889:2003 performance requirements Available with proof testing certificates (ABS, DIN, Lloyds) Screw Pin Anchor Shackles (G-209/S-209) Forged, Quenched & Tempered, with alloy pins | Design factor: 6:1 | Hot-dip galvanized (G) or self-colored (S) Key Features Working Load Limit and Grade 6 permanently shown on every shackle. Fatigue rated to 20,000 cycles at 1-1/2 times WLL. Meets or exceeds ASME B30.26. Type Approval certification available per ABS 2016 Steel Vessel Rules. Nominal Size (in) Nominal Size (mm) WLL (t) Stock No. (G) Stock No. (S) Weight (kg) A B C D E F G H L M 3/16 4.76 0.33 1018357 - 0.03 9.7 6.4 22.4 4.8 15.2 14.2 24.9 37.3 4.1 29.0 1/4 6.35 0.5 1018375 1018384 0.05 11.9 7.9 28.7 6.4 19.8 15.7 32.5 46.7 4.8 36.3 5/16 7.94 0.75 1018393 1018400 0.09 13.5 9.7 30.7 7.9 21.3 19.1 37.1 53.1 5.6 43.4 3/8 9.53 1 1018419 1018428 0.14 16.8 11.2 36.8 9.7 26.2 23.4 45.5 63.5 6.4 52.3 7/16 11.11 1.5 1018437 1018446 0.17 19.1 12.7 42.9 11.2 29.5 26.9 51.8 73.9 7.9 60.2 1/2 12.7 2 1018455 1018464 0.33 20.6 15.7 47.8 12.7 33.3 30.0 58.7 83.3 9.7 68.3 5/8 15.88 3.25 1018473 1018482 0.62 26.9 19.1 60.5 15.7 42.9 38.1 74.4 106 11.2 84.8 3/4 19.05 4.75 1018491 1018507 1.07 31.8 22.4 71.4 19.1 50.8 46.0 88.9 126 12.7 101 7/8 22.23 6.5 1018516 1018525 1.64 36.6 25.4 84.1 22.4 57.9 53.3 103 148 12.7 114 1 25.4 8.5 1018534 1018543 2.28 42.9 28.4 95.5 25.4 68.3 60.5 119 167 14.2 130 1-1/8 28.58 9.5 1018552 1018561 3.36 46.0 31.8 108 29.5 73.9 68.1 131 190 16.0 152 1-1/4 31.75 12 1018570 1018589 4.31 51.6 35.1 119 32.8 82.8 76.2 146 210 17.5 165 1-3/8 34.93 13.5 1018598 1018605 6.14 57.2 38.9 133 36.1 91.9 84.1 162 233 19.1 176 1-1/2 38.1 17 1018614 1018623 7.80 60.5 41.4 146 38.9 98.6 91.9 176 254 20.6 189 1-3/4 44.45 25 1018632 1018641 12.6 73.2 50.8 178 46.7 127 106 224 313 25.4 233 2 50.8 35 1018650 1018669 20.4 82.6 57.2 197 52.8 146 122 258 347 28.7 263 2-1/2 63.5 55 1018678 1018687 38.9 105 69.9 267 69.1 184 148 324 455 35.1 335 Product Notes Forged, quenched & tempered with alloy pins Hot-dip galvanized (G) or self-colored (S) Meets performance requirements of Grade 6 shackles Available with proof testing certificates (ABS, DNV, Lloyds) Meets performance requirements of Federal Specification RR-C-271H All shackles can meet charpy requirements of 42 Joules avg at -20°C upon special request Screw Pin Chain Shackles (G-210/S-210) Forged, Quenched & Tempered, with alloy pins | Design factor: 6:1 | Hot-dip galvanized (G) or self-colored (S) Key Features Working Load Limit and Grade 6 permanently shown on every shackle. Fatigue rated to 20,000 cycles at 1-1/2 times WLL. Meets or exceeds ASME B30.26. Type Approval certification available per ABS 2016 Steel Vessel Rules. Nominal Size Nominal Size (mm) WLL (t) Stock No. (G) Stock No. (S) Weight (kg) A B C D E F G K L M 1/4 6.35 0.5 1019150 1019169 0.05 11.9 7.85 6.35 6.35 24.6 15.5 22.4 40.4 4.85 35.1 5/16 7.94 0.75 1019178 1019187 0.08 13.5 9.65 7.85 7.85 29.5 19.1 26.2 48.5 5.60 42.2 3/8 9.53 1 1019196 1019203 0.13 16.8 11.2 9.65 9.65 35.8 23.1 31.8 58.5 6.35 51.5 7/16 11.11 1.5 1019212 1019221 0.20 19.1 12.7 11.2 11.2 41.4 26.9 36.6 67.5 7.85 60.5 1/2 12.70 2 1019230 1019249 0.27 20.6 16.0 12.7 12.7 46.0 30.2 41.4 77.0 9.65 68.5 5/8 15.88 3.25 1019258 1019267 0.57 26.9 19.1 15.7 16.0 58.5 38.1 51.0 95.5 11.2 85.0 3/4 19.05 4.75 1019276 1019285 1.20 31.8 22.4 20.6 19.1 70.0 46.0 60.5 115 12.7 101 7/8 22.23 6.5 1019294 1019301 1.43 36.6 25.4 24.6 22.4 81.0 53.0 71.5 135 12.7 114 1 25.40 8.5 1019310 1019329 2.15 42.9 28.7 25.4 25.4 93.5 60.5 81.0 151 14.2 129 1-1/8 28.58 9.5 1019338 1019347 3.06 46.0 31.8 31.8 28.7 103 68.5 91.0 172 16.0 142 1-1/4 31.75 12 1019356 1019365 4.11 51.5 35.1 35.1 31.8 115 76.0 100 191 17.5 156 1-3/8 34.93 13.5 1019374 1019383 5.28 57.0 38.1 38.1 35.1 127 84.0 111 210 19.1 174 1-1/2 38.10 17 1019392 1019409 7.23 60.5 41.4 41.1 38.1 137 92.0 122 230 20.6 187 1-3/4 44.45 25 1019418 1019427 12.1 73.0 51.0 54.0 44.5 162 106 146 279 25.4 231 2 50.80 35 1019436 1019445 19.2 82.5 57.0 60.0 51.0 184 122 172 312 31.0 263 2-1/2 63.50 55 1019454 1019463 32.5 105 70.0 66.5 66.5 238 145 203 377 35.1 330 Product Notes Forged, quenched & tempered with alloy pins Hot-dip galvanized (G) or self-colored (S) Meets performance requirements of Grade 6 shackles Available with proof testing certificates (ABS, DNV, Lloyds) Meets performance requirements of Federal Specification RR-C-271H All shackles can meet charpy requirements of 42 Joules avg at -20°C upon special request Bolt Type Anchor Shackles (G-2130/S-2130) Forged, Quenched & Tempered, with alloy bolts | Design factor: 6:1 | Hot-dip galvanized (G) or self-colored (S) Key Features Working Load Limit and Grade 6 permanently shown on every shackle. Fatigue rated to 20,000 cycles at 1-1/2 times WLL. Meets or exceeds ASME B30.26. Type Approval certification available per ABS 2016 Steel Vessel Rules. Nominal Size (in) Nominal Size (mm) WLL (t) Stock No. (G) Stock No. (S) Stock No. (G-2130OC) Weight (kg) A B C D E F H M 3/16 4.76 0.33 1019464 - - 0.03 9.7 6.4 22.4 4.9 15.2 14.2 37.3 4.85 1/4 6.35 0.5 1019466 - - 0.05 11.9 7.9 28.7 6.4 19.8 15.5 46.7 6.35 5/16 7.94 0.75 1019468 - - 0.10 13.5 9.7 31.0 7.9 21.3 19.1 53.0 7.85 3/8 9.53 1 1019470 - - 0.15 16.8 11.2 36.6 9.7 26.2 23.1 63.0 9.65 7/16 11.11 1.5 1019471 - - 0.22 19.1 12.7 42.9 11.2 29.5 26.9 74.0 11.2 1/2 12.7 2 1019472 1019481 - 0.36 20.6 16.0 47.8 12.7 33.3 30.2 83.5 12.7 5/8 15.88 3.25 1019490 1019506 1262013 0.62 26.9 19.1 60.5 16.0 42.9 38.1 106 17.5 3/4 19.05 4.75 1019515 1019524 1262022 1.23 31.8 22.4 71.5 19.1 51.0 46.0 126 20.6 7/8 22.23 6.5 1019533 1019542 1262031 1.79 36.6 25.4 84.0 22.4 58.0 53.0 148 24.6 1 25.4 8.5 1019551 1019560 1262040 2.28 42.9 28.7 95.5 25.4 68.5 60.5 167 26.9 1-1/8 28.58 9.5 1019579 1019588 1262059 3.75 46.0 31.8 108 28.7 74.0 68.5 190 31.8 1-1/4 31.75 12 1019597 1019604 1262068 5.31 51.5 35.1 119 31.8 82.5 76.0 210 35.1 1-3/8 34.93 13.5 1019613 1019622 1262077 7.18 57.0 38.1 133 35.1 92.0 84.0 233 38.1 1-1/2 38.1 17 1019631 1019640 1262086 8.62 60.5 41.4 146 38.1 98.5 92.0 254 41.1 1-3/4 44.45 25 1019659 1019668 1262095 15.4 73.0 51.0 178 44.5 127 106 313 57.0 2 50.8 35 1019677 1019686 - 23.7 82.5 57.0 197 51.0 146 122 348 61.0 2-1/2 63.5 55 1019695 1019702 - 44.6 105 70.0 267 66.5 184 145 453 79.5 3 76.2 85 1019711 - - 70.0 127 82.5 330 76.0 200 165 546 92.0 3-1/2 88.9 120 1019739 - - 120 133 95.5 372 92.0 229 203 626 105 4 101.6 150 1019757 - - 153 140 108 368 104 254 229 653 116 Product Notes Forged, quenched & tempered with alloy bolts Hot-dip galvanized bows with Dimetcoted® bolts painted red for larger sizes Shackles 85 metric tons and larger individually proof tested to 2.0 times WLL Certification available for charpy and statistical proof test Meets performance requirements of Federal Specification RR-C-271H All shackles can meet charpy requirements of 42 Joules avg at -20°C upon request Safety Features Forged Steel Quenched & tempered for maximum strength and durability Design Factor 6:1 safety margin for maximum reliability Extreme Temperature Approved for -40°C to 204°C environments Certifications Meets ASME, EN, ABS, and other standards Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products D‑Shackles & Anchor Bow Shackles Forged Wire Rope Clamps Turnbuckles / Straining Screws Quick Links Home About Us All Products Contact Certifications ASME B30.26 Certified OSHA Compliant EN1677-3 Compliant ISO Quality Standards © 2025 Portside India Traders. All Rights Reserved. Crosby® is a registered trademark of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/WireRopeClamps.html", "text": "Portside India Traders - Crosby® G-450 Red U-Bolt® Clip Portside India Traders Strength that Anchors Your Success Home About Products Contact Forged Wire Rope Clamps Premium wire rope clips for secure connections and maximum safety Request a Quote Product Overview The Crosby® G-450 Red U-Bolt® Clip is engineered for superior performance in demanding wire rope applications. These hot-dip galvanized wire rope clips provide maximum strength and corrosion resistance for critical connections. Efficiency: 80% for 3mm-22mm sizes | 90% for 24mm-90mm sizes Traceability Product Identification Code (PIC) on each base Certified Exceeds ASME B30.26 requirements Durable Hot-dip galvanized for corrosion resistance Forged Forged bases for sizes 3mm-62mm and 75mm Key Features Each base has a Product Identification Code (PIC) for material traceability Name Crosby or \"CG\" and size forged into each base 80% efficiency rating for 3mm-22mm sizes, 90% for 24mm-90mm sizes Entire clip is galvanized to resist corrosion and rust Sizes 3mm-62mm and 75mm have forged bases All clips individually bagged or tagged with application instructions and warnings Clip sizes up to 38mm have rolled threads Meets or exceeds all requirements of ASME B30.26 Look for the Red U-Bolt® for genuine Crosby Clips Technical Specifications Efficiency: 80% for 3mm-22mm, 90% for 24mm-90mm Material: Hot-dip galvanized steel Traceability: PIC code on each base Threads: Rolled threads on sizes up to 38mm Packaging: Individually bagged or tagged Certifications: ASME B30.26 compliant Base Construction: Forged bases for sizes 3mm-62mm and 75mm Technical Specifications Product Dimensions The table below provides detailed specifications for all available sizes of the Crosby® G-450 Red U-Bolt® Clip. All dimensions are in millimeters unless otherwise specified. Rope Size (in) Rope Size (mm) Stock No. Std. Package Weight Per 100 (kg) A B C D E F G H 1/8 3.18 1010015 100 2.72 5.60 18.3 11.2 11.9 10.4 9.65 20.6 23.9 3/16* 4.76 1010033 100 4.54 6.35 24.6 14.2 15.0 12.7 11.2 23.9 29.5 1/4 6.35 1010051 100 8.62 7.85 26.2 12.7 19.1 16.8 14.2 30.2 36.6 5/16 7.94 1010079 100 12.7 9.65 35.1 19.1 22.4 18.3 17.5 33.3 42.9 3/8 9.53 1010097 100 21.8 11.2 38.1 19.1 25.4 23.1 19.1 41.4 49.3 7/16 - 1/2 11.11 - 12.70 1010131 50 80 1.88 1.00 1.19 1.13 0.88 1.91 2.28 9/16 - 5/8 14.29 - 15.88 1010177 50 110 2.25 1.25 1.31 1.34 0.94 2.06 2.50 3/4 19.05 1010195 25 64 15.7 70.0 36.6 38.1 35.8 26.9 57.0 72.0 7/8 22.23 1010211 25 96 19.1 79.0 41.1 44.5 40.4 31.8 62.0 80.5 1 25.40 1010239 10 114 19.1 89.0 46.0 47.8 45.2 31.8 67.0 88.0 1-1/8 28.58 1010257 10 128 19.1 98.5 51.0 51.0 48.5 31.8 71.5 91.0 1-1/4 31.75 1010275 10 199 22.4 108 54.0 59.4 55.5 36.6 79.5 105 1-3/8 34.93 1010293 10 200 22.4 118 58.5 59.4 58.5 36.6 79.5 106 1-1/2 38.10 1010319 10 247 22.4 125 60.5 66.5 62.0 36.6 86.5 113 1-5/8 41.28 1010337 Bulk 319 25.4 135 66.5 70.0 67.5 41.4 92.0 121 1-3/4 44.45 1010355 Bulk 424 28.7 146 70.0 77.5 74.5 46.0 97.0 134 2 50.80 1010373 Bulk 590 31.8 164 76.0 86.0 77.0 51.0 113 149 2-1/4 57.15 1010391 Bulk 726 31.8 181 81.0 98.5 81.0 51.0 114 162 2-1/2 63.50 1010417 Bulk 862 31.8 195 87.5 105 93.5 51.0 119 168 2-3/4 69.85 1010435 Bulk 1043 31.8 211 90.5 111 124 51.0 127 175 3 76.20 1010453 Bulk 1406 38.1 233 98.5 121 119 60.5 149 194 3-1/2 88.90 1010426 Bulk 1814 38.1 273 114 140 152 60.5 157 213 Product Notes & Specifications *Electro-plated U-Bolt and Nuts for sizes marked with asterisk ** 70mm and 89mm base made of cast steel All clips are individually bagged or tagged with proper application instructions and warning information Meets or exceeds all requirements of ASME B30.26 including identification, ductility, design factor, proof load and temperature requirements These wire rope clips meet other critical performance requirements, including fatigue life, impact properties, and material traceability not addressed by ASME B30.26 Look for the Red U-Bolt®, your assurance of genuine Crosby Clips Safety & Performance Features Material Traceability Product Identification Code (PIC) on each base for full traceability High Efficiency 80-90% efficiency rating based on wire rope breaking strength Corrosion Resistance Hot-dip galvanized for protection against rust and corrosion Certifications Exceeds ASME B30.26 requirements Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products D‑Shackles & Anchor Bow Shackles Forged Wire Rope Clamps Turnbuckles / Straining Screws Quick Links Home About Us All Products Contact Certifications ASME B30.26 Certified Federal Specs Compliance ASTM Compliant ISO Quality Standards © 2025 Portside India Traders. All Rights Reserved. Crosby® and Red U-Bolt® are registered trademarks of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/Turnbuckles_StrainingScrews.html", "text": "Portside India Traders - Crosby® Turnbuckles Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby® Turnbuckles Premium turnbuckles for precise tensioning and maximum safety Request a Quote Turnbuckle Overview Crosby® Turnbuckles are engineered for superior performance in demanding tensioning applications. Available in various configurations including Hook-Hook, Eye-Eye, Jaw-Eye, and Jaw-Jaw. These hot-dip galvanized steel turnbuckles are designed for maximum strength and durability. TURNBUCKLES RECOMMENDED FOR STRAIGHT OR IN-LINE PULL ONLY. Heat-Treated Quenched & Tempered fittings Durable Finish Hot-dip galvanized steel Fatigue Resistant 20,000 cycles at 1.5x WLL Safety Certified 5:1 Design Factor Key Features End fittings are Quenched & Tempered or normalized, bodies heat-treated by normalizing Hot-dip galvanized steel construction Modified UNJ thread on end fittings for improved fatigue properties Body has UNC threads Lock nuts available for all sizes Fatigue rated to 20,000 cycles at 1-1/2 times the Working Load Limit Meets or exceeds all requirements of ASME B30.26 including identification, ductility, design factor, proof load and temperature requirements Meets performance requirements of Federal Specifications FF-T-791b and ASTM F-1145 5:1 Design Factor with Proof Load at 2.5 times the Working Load Limit Technical Specifications Design Factor: 5:1 Proof Load: 2.5 times the Working Load Limit Fatigue Rating: 20,000 cycles at 1.5 times WLL Materials: Hot-dip galvanized steel Threads: Modified UNJ on end fittings, UNC on bodies Certifications: ASME B30.26, Federal Specifications FF-T-791b, ASTM F-1145 Technical Specifications Hook & Hook (HG-223) Eye & Eye (HG-226) Jaw & Eye (HG-227) Jaw & Jaw (HG-228) Hook & Hook Turnbuckles (HG-223) Forged hooks with greater cross-sectional area for strength | Design factor: 5:1 | Hot-dip galvanized Key Features Hooks are forged with a greater cross sectional area that results in a stronger hook with better fatigue properties. Modified UNJ thread on end fittings for improved fatigue properties. Body has UNC threads. Thread Dia. & Take Up (in) Stock No. Working Load Limit (t) Weight Each (kg) A (mm) D (mm) E (mm) F Closed (mm) J (mm) K Open (mm) M Closed (mm) N Open (mm) BB Closed (mm) 1 x 12 1030333 2.27 6.70 25.4 31.8 167 108 929 637 1019 714 309 Product Notes Hooks are forged with greater cross sectional area for strength and fatigue resistance Hot-dip galvanized steel construction Quenched & Tempered or normalized end fittings Bodies heat-treated by normalizing Fatigue rated to 20,000 cycles at 1.5 times WLL Meets or exceeds ASME B30.26 requirements Meets performance requirements of Federal Specifications FF-T-791b, Type 1 Form 1 - CLASS 5 Eye & Eye Turnbuckles (HG-226) Forged elongated eyes for easy attachment | Design factor: 5:1 | Hot-dip galvanized Key Features Turnbuckle eyes are forged elongated, by design, to maximize easy attachment in system and minimize stress in the eye. For turnbuckle sizes 6 mm through 64 mm, a shackle one size smaller can be reeved through eye. Thread Dia. & Take Up (in) Stock No. Working Load Limit (t) Weight Each (kg) A (mm) J Open (mm) J Closed (mm) K Open (mm) K Closed (mm) L Open (mm) L Closed (mm) M Open (mm) M Closed (mm) 5/16 x 4-1/2 1031270 0.36 0.22 7.94 354 239 368 253 24.1 11.2 55.8 116 3/8 x 6 1031298 0.54 0.34 9.53 446 294 463 311 28.7 13.5 62.9 155 1/2 x 6 1031314 1.00 0.78 12.7 506 354 529 376 35.8 18.0 90.4 153 1/2 x 12 1031350 1.00 1.19 12.7 819 514 841 536 35.8 18.0 89.9 314 5/8 x 6 1031378 1.59 1.25 15.9 552 399 577 425 45.7 22.4 110 153 5/8 x 12 1031412 1.59 1.87 15.9 865 560 891 586 45.7 22.4 110 315 3/4 x 6 1031430 2.36 1.91 19.1 590 438 622 470 53.1 25.4 130 156 3/4 x 12 1031476 2.36 2.78 19.1 905 600 937 632 53.1 25.4 129 320 3/4 x 18 1031494 2.36 3.55 19.1 1210 753 1242 785 53.1 25.4 130 471 7/8 x 12 1031519 3.27 4.01 22.2 932 627 970 665 60.5 31.8 147 309 7/8 x 18 1031537 3.27 5.22 22.2 1249 792 1287 830 60.5 31.8 147 473 1 x 6 1031555 4.54 4.36 25.4 666 514 711 559 76.2 36.3 165 157 1 x 12 1031573 4.54 5.88 25.4 971 666 1016 711 76.2 36.3 165 309 1 x 18 1031591 4.54 7.40 25.4 1276 819 1321 864 76.2 36.3 165 462 1 x 24 1031617 4.54 9.14 25.4 1596 987 1641 1031 76.2 36.3 164 631 1-1/4 x 12 1031635 6.89 9.01 31.8 1070 766 1127 822 91.2 46.2 216 306 1-1/4 x 18 1031653 6.89 10.8 31.8 1375 918 1432 975 91.2 46.2 216 459 1-1/4 x 24 1031671 6.89 12.6 31.8 1694 1085 1751 1141 91.2 46.2 216 625 1-1/2 x 12 1031699 9.71 13.0 38.1 1124 819 1187 882 104 53.8 240 313 1-1/2 x 18 1031715 9.71 15.4 38.1 1428 971 1492 1035 104 53.8 240 465 1-1/2 x 24 1031733 9.71 17.9 38.1 1749 1139 1813 1203 104 53.8 240 633 1-3/4 x 18 1031779 12.7 23.0 44.5 1457 1000 1534 1076 118 60.5 253 467 1-3/4 x 24 1031797 12.7 26.4 44.5 1762 1153 1838 1229 118 60.5 253 619 2 x 24 1031813 16.8 37.9 50.8 1922 1313 2011 1402 148 68.3 331 622 2-1/2 x 24 1031831 27.2 67.4 63.5 2011 1402 2113 1503 165 79.2 350 625 2-3/4 x 24 1031859 34.0 79.1 69.9 2066 1456 2180 1571 178 82.6 383 626 Product Notes Forged elongated eyes for easy attachment and reduced stress Hot-dip galvanized steel construction Quenched & Tempered or normalized end fittings Bodies heat-treated by normalizing Fatigue rated to 20,000 cycles at 1.5 times WLL Meets or exceeds ASME B30.26 requirements Meets performance requirements of Federal Specifications FF-T-791b, Type 1 Form 1 - CLASS 4 Jaw & Eye Turnbuckles (HG-227) Combination jaw and eye configuration | Design factor: 5:1 | Hot-dip galvanized Key Features Turnbuckle eyes are forged elongated for easy attachment. Forged jaw ends are fitted with bolts and nuts for 6mm through 16mm, and pins and cotters on 19 mm through 70 mm sizes. Thread Dia & Take Up (in) Stock No. Working Load Limit (t) Weight Each (kg) E Close (mm) G Open (mm) J Close (mm) M Open (mm) N Close (mm) R Close (mm) S Close (mm) X BB (mm) 5/16 x 4-1/2 1031895 0.36 0.24 7.94 12.7 51.2 22.0 343 228 363 249 3/8 x 6 1031911 0.54 0.36 9.53 13.5 53.5 21.5 429 277 454 301 1/2 x 6 1031939 1.00 0.80 12.7 16.3 81.8 27.1 490 338 520 368 1/2 x 9 1031957 1.00 1.02 12.7 16.3 81.3 27.1 650 421 680 451 1/2 x 12 1031975 1.00 1.21 12.7 16.3 81.3 27.1 802 497 832 528 5/8 x 6 1031993 1.59 1.35 15.9 20.1 99.1 33.5 527 374 566 413 5/8 x 9 1032019 1.59 1.69 15.9 20.1 98.8 33.5 688 459 727 498 5/8 x 12 1032037 1.59 1.97 15.9 20.1 98.8 33.5 840 535 879 574 3/4 x 6 1032055 2.36 2.05 19.1 24.6 120 38.5 563 411 612 459 3/4 x 9 1032073 2.36 2.52 19.1 24.6 119 38.5 726 497 774 546 3/4 x 12 1032091 2.36 2.91 19.1 24.6 119 38.5 878 573 927 622 3/4 x 18 1032117 2.36 3.69 19.1 24.6 120 38.5 1183 726 1232 774 7/8 x 12 1032135 3.27 4.13 22.2 29.5 140 44.8 906 601 963 658 7/8 x 18 1032153 3.27 5.28 22.2 29.5 140 44.8 1223 766 1280 822 1 x 6 1032171 4.54 4.55 25.4 34.0 155 52.1 636 483 701 548 1 x 12 1032199 4.54 6.06 25.4 34.0 155 52.1 941 636 1006 701 1 x 18 1032215 4.54 7.58 25.4 34.0 155 52.1 1245 788 1310 853 1 x 24 1032233 4.54 9.33 25.4 34.0 154 52.1 1565 956 1630 1021 1-1/4 x 12 1032251 6.89 9.48 31.8 46.7 205 71.5 1035 730 1117 812 1-1/4 x 18 1032279 6.89 11.3 31.8 46.7 205 71.5 1340 883 1422 965 1-1/4 x 24 1032297 6.89 13.1 31.8 46.7 205 71.5 1659 1050 1741 1131 1-1/2 x 12 1032313 9.71 13.9 38.1 52.3 227 71.4 1080 775 1174 869 1-1/2 x 18 1032331 9.71 16.3 38.1 52.3 227 71.4 1384 927 1479 1021 1-1/2 x 24 1032359 9.71 18.8 38.1 52.3 227 71.4 1705 1095 1799 1189 1-3/4 x 18 1032395 12.7 23.6 44.5 66.0 238 85.0 1406 949 1518 1061 1-3/4 x 24 1032411 12.7 27.1 44.5 66.0 238 85.0 1711 1101 1823 1213 2 x 24 1032439 16.8 40.8 50.8 66.5 300 95.0 1846 1236 1980 1370 2-1/2 x 24 1032457 27.2 71.7 63.5 77.7 337 113 1932 1323 2100 1490 2-3/4 x 24 1032475 34.0 84.6 69.9 93.7 379 106 1982 1373 2176 1566 Product Notes Combination jaw and eye configuration for versatile applications Hot-dip galvanized steel construction Quenched & Tempered or normalized end fittings Bodies heat-treated by normalizing Fatigue rated to 20,000 cycles at 1.5 times WLL Meets or exceeds ASME B30.26 requirements Meets performance requirements of Federal Specifications FF-T-791b, Type 1 Form 1 - CLASS 8 Jaw & Jaw Turnbuckles (HG-228) Dual jaw configuration for pin connections | Design factor: 5:1 | Hot-dip galvanized Key Features Forged jaw ends are fitted with bolts and nuts for 6mm through 16mm, and pins and cotters on 19 mm through 70 mm sizes. Designed for maximum strength and reliability. Thread No. Stock No. Working Load Limit (t) Weight Each (kg) A (mm) B (mm) Closed (mm) G (mm) Open (mm) K Closed (mm) K Open (mm) BB (mm) 5/16 x 4-1/2 1032518 0.36 0.25 7.94 12.7 51.2 22.0 332 218 359 244 3/8 x 6 1032536 0.54 0.39 9.53 13.5 53.5 21.5 413 260 445 292 1/2 x 6 1032554 1.00 0.83 12.7 16.3 81.8 27.1 474 321 512 359 1/2 x 9 1032572 1.00 1.04 12.7 16.3 81.3 27.1 633 405 671 443 1/2 x 12 1032590 1.00 1.23 12.7 16.3 81.3 27.1 786 481 824 519 5/8 x 6 1032616 1.59 1.46 15.9 20.1 99.1 33.5 501 349 554 402 5/8 x 9 1032634 1.59 1.79 15.9 20.1 98.8 33.5 662 434 715 487 5/8 x 12 1032652 1.59 2.08 15.9 20.1 98.8 33.5 815 510 868 563 3/4 x 6 1032670 2.36 2.18 19.1 24.6 120 38.5 536 383 601 449 3/4 x 9 1032698 2.36 2.65 19.1 24.6 119 38.5 698 470 764 535 3/4 x 12 1032714 2.36 3.05 19.1 24.6 119 38.5 851 546 916 612 3/4 x 18 1032732 2.36 3.83 19.1 24.6 120 38.5 1155 698 1221 764 7/8 x 12 1032750 3.27 4.25 22.2 29.5 140 44.8 880 575 956 651 7/8 x 18 1032778 3.27 5.34 22.2 29.5 140 44.8 1197 740 1272 815 1 x 6 1032796 4.54 4.74 25.4 34.0 155 52.1 605 453 690 538 1 x 12 1032812 4.54 6.25 25.4 34.0 155 52.1 910 605 995 690 1 x 18 1032830 4.54 7.77 25.4 34.0 155 52.1 1215 757 1300 843 1 x 24 1032858 4.54 9.51 25.4 34.0 154 52.1 1535 925 1620 1010 1-1/4 x 12 1032876 6.89 9.94 31.8 46.7 205 71.5 1000 695 1107 802 1-1/4 x 18 1032894 6.89 11.7 31.8 46.7 205 71.5 1305 848 1412 955 1-1/4 x 24 1032910 6.89 13.5 31.8 46.7 205 71.5 1624 1014 1731 1121 1-1/2 x 12 1032938 9.71 14.8 38.1 52.3 227 71.4 1035 731 1160 855 1-1/2 x 18 1032956 9.71 17.2 38.1 52.3 227 71.4 1340 883 1465 1008 1-1/2 x 24 1032974 9.71 19.7 38.1 52.3 227 71.4 1661 1051 1786 1176 1-3/4 x 18 1033018 12.7 24.3 44.5 66.0 238 85.0 1355 898 1503 1045 1-3/4 x 24 1033036 12.7 27.7 44.5 66.0 238 85.0 1660 1050 1807 1198 2 x 24 1033054 16.8 43.7 50.8 66.5 300 95.0 1769 1159 1949 1339 2-1/2 x 24 1033072 27.2 75.9 63.5 77.7 337 113 1853 1244 2087 1478 2-3/4 x 24 1033090 34.0 90.1 69.9 93.7 379 106 1899 1289 2172 1562 Product Notes Dual jaw configuration for pin connections Hot-dip galvanized steel construction Quenched & Tempered or normalized end fittings Bodies heat-treated by normalizing Fatigue rated to 20,000 cycles at 1.5 times WLL Meets or exceeds ASME B30.26 requirements Meets performance requirements of Federal Specifications FF-T-791b, Type 1 Form 1 - CLASS 7 Safety Features Heat-Treated Quenched & Tempered fittings for maximum strength Fatigue Resistant Rated to 20,000 cycles at 1.5x WLL Design Factor 5:1 safety margin for reliability Certifications Meets ASME, Federal Specs & ASTM standards Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products D‑Shackles & Anchor Bow Shackles Forged Wire Rope Clamps Turnbuckles / Straining Screws Quick Links Home About Us All Products Contact Certifications ASME B30.26 Certified Federal Specs FF-T-791b ASTM F-1145 Compliant ISO Quality Standards © 2025 Portside India Traders. All Rights Reserved. Crosby® is a registered trademark of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/BeamLiftingClamps.html", "text": "Portside India Traders - Crosby® IPTKW Beam Lifting Clamps Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby® IPTKW Beam Lifting Clamps Premium lifting clamps for efficient and safe beam handling Request a Quote Beam Lifting Clamps Overview Crosby® IPTKW Beam Lifting Clamps are engineered for superior performance in demanding lifting applications. Available in capacities from 2 to 25 metric tons with jaw openings ranging from 75 to 1020mm. Forged Construction Alloy steel body with forged components Individually Tested Proof tested to 2 times WLL Safety Certified Permanent markings for traceability Maintenance Kits Available for extended lifespan Key Features Available in capacities of 2 through 25 metric tons (higher WLL available on request) Wide variety of jaw openings: 75 to 1020mm Welded alloy steel body for strength and smaller size Forged alloy components where required Individually Proof Tested to 2 times the Working Load Limit with certification Company name (Crosby IP), logo, Working Load Limit and jaw opening permanently stamped on body Each product individually serialized with serial number and Proof Load test date stamped on body User manual with test certificate included with each clamp Maintenance and repair kits available Technical Specifications Design Factor: Based on EN 13155 and ASME B30.20 Proof Load Test: 2 times Working Load Limit Material: Welded alloy steel body with forged components Markings: Permanent stamps for WLL, jaw opening, serial number and test date Technical Specifications IPTK Standard Models IPTKW Hoisting Eye IPTKU Hinged Hoisting Eye IPTKUD Double Locking IPTK Standard Models Available in capacities of 2 through 25 metric tons with jaw openings from 75 to 1020mm. Key Features Welded alloy steel body for strength and smaller size. Forged alloy components where required. Individually Proof Tested to 2 times the Working Load Limit with certification. Model Working Load Limit (t)* Stock No. Weight Each (kg) Jaw A (mm) C (mm) D (mm) E (mm) F (mm) H (mm) J (mm) K (mm) IPTK 2 2700996 6.0 75 - 190 A + 80 125 75 - 25 - 20 IPTK 3 2700997 6.5 75 - 190 A + 80 125 75 - 25 - 20 IPTK 4 2700998 8.5 150 - 280 A + 100 125 75 - 35 - 20 IPTK 5 2700994 11.0 120 - 350 A + 195 125 75 - 40 - 20 IPTK 25 2702999 225 450 - 1020 A + 220 500 125 - 76 - 45 Product Notes Design Factor based on EN 13155 and ASME B30.20 Higher Working Load Limits available upon request Maintenance and repair kits available Each product is individually serialized with serial number and Proof Load test date stamped on body User manual with test certificate included with each clamp IPTKW Hoisting Eye Models with hoisting eye for versatile lifting applications. Key Features Forged alloy steel construction with hoisting eye. Individually Proof Tested to 2 times the Working Load Limit with certification. Model WLL (t) Stock No. Weight (kg) Jaw A (mm) C (mm) D (mm) E (mm) F (mm) H (mm) J (mm) K (mm) IPTKW 2 2 2700966 4.0 75 - 190 A + 80 125 - 28 25 - - IPTKW 3 3 2700967 4.5 75 - 190 A + 80 125 - 28 25 - - IPTKW 4 4 2700968 6.3 150 - 280 A + 100 125 - 33 35 - - IPTKW 5 5 2700969 8.8 120 - 350 A + 195 125 - 33 40 - - Product Notes IPTKW: With hoisting eye IPTK: Without hoisting eye IPTKUD: With double locking device Maintenance and repair kits available Each product is individually serialized IPTKU Improved Hinged Hoisting Eye Models with improved hinged hoisting eye for enhanced safety and maneuverability. Key Features Forged alloy steel construction with improved hinged hoisting eye. Suitable for demanding lifting applications. Model WLL (t) Stock No. Weight (kg) Jaw A (mm) C (mm) D (mm) E (mm) F (mm) H (mm) J (mm) K (mm) IPTKU 2 2 2707996 5.7 75 - 190 A + 100 121 76 22 99 19 - IPTKU 3 3 2707997 6.4 75 - 190 A + 100 121 89 22 122 22 - IPTKU 4 4 2707998 12.1 120 - 280 A + 150 140 89 40 122 22 - IPTKU 5 5 2707994 14.5 120 - 350 A + 175 140 89 40 122 22 - IPTKU 10 10 2707970 41.0 200 - 460 A + 300 200 105 60 152 26 - Product Notes Improved hinged hoisting eye for enhanced maneuverability Available in capacities from 2 to 10 metric tons Higher capacities available upon request Maintenance and repair kits available IPTKUD Double Locking Device Models with double locking device for enhanced safety in critical applications. Key Features Forged alloy steel construction with double locking mechanism. Suitable as anchor device for personnel fall arrest equipment. Model WLL (t) Stock No. Weight (kg) Jaw A (mm) C (mm) D (mm) E (mm) F (mm) H (mm) J (mm) K (mm) IPTKUD 2 2 2709996 6.0 75 - 190 A + 100 165 76 22 99 19 - IPTKUD 3 3 2709993 6.6 75 - 190 A + 100 165 89 - 122 22 - IPTKUD 4 4 2709995 12.3 120 - 280 A + 150 185 89 - 122 22 - IPTKUD 5 5 2709994 15.3 120 - 350 A + 175 185 89 - 122 22 - IPTKUD 10 10 2709970 43.0 200 - 460 A + 300 215 105 - 152 26 - Product Notes Double locking device for enhanced safety Suitable as anchor device for personnel fall arrest equipment - standard according to EN 795 IPTKUM 1 person model available (Stock No. 2709991) Maintenance and repair kits available Safety Features Alloy Steel Welded alloy steel body with forged components for maximum strength Proof Testing Individually tested to 2 times Working Load Limit Permanent Markings WLL, jaw opening, serial number and test date permanently stamped Certification Test certificate included with each clamp Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Beam Lifting Clamps Vertical‑Plate Clamps Horizontal‑Plate Clamps Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved. Crosby® is a registered trademark of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/VerticalLiftingClamps.html", "text": "Portside India Traders - Crosby® IPU10 Vertical Lifting Clamps Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby® IPU10 Vertical Lifting Clamps Universal lifting solution for any direction with enhanced safety features Request a Quote Universal Lifting Clamps Crosby® IPU10 Vertical Lifting Clamps are engineered for superior performance in demanding lifting applications. These universal clamps are designed for lifting in any direction with capacities from 0.5 to 30 metric tons. IPU10 Standard Clamp 0.5-30t capacity IPU10J Larger Jaw Opening 0.5-30t capacity IPU10S Stainless Steel 0.5-12t capacity IPU10H Hard Material 0.5-6t capacity Key Features Universal design - for lifting in any direction Available in capacities of 0.5 thru 30 metric tons (higher WLL available on request) Wide variety of jaw openings available: 0 to 155mm Welded alloy steel body for strength and smaller size with forged alloy components where required Individually Proof Tested to 2 times the Working Load Limit with certification Company name (Crosby IP), logo, WLL and jaw opening permanently stamped on body Each product individually serialized with serial number and Proof Load test date stamped on body User manual with test certificate included with each clamp Full 180° turning range for material transfer, turning or moving Lock open, lock closed ability with latch for pretension on material and then release of material For use with materials with a surface hardness to 279HV10 Maintenance and repair kits available Minimum WLL is 5% of maximum WLL for 0.5t IPU10 only Minimum WLL is 10% of maximum WLL for all other IPU10, IPU10J, IPU10S, IPU10H clamps Model Specifications IPU10 - Standard clamp for materials with surface hardness to 363HV10 (345 HB) IPU10J - Larger jaw opening IPU10S - For use with stainless steel material IPU10H - For use with materials with surface hardness to 472HV10 (450 HB) IPU10R - Remote control opening and closing via a cable (available on request) IPU10W - Wedge design (available on request) Technical Specifications IPU10 Standard IPU10J Large Jaw IPU10S Stainless IPU10H Hard Material IPU10 Standard Models For materials with surface hardness to 363HV10 (345 HB) Key Features Universal clamp for lifting in any direction. Welded alloy steel body with forged components. Individually Proof Tested to 2 times the Working Load Limit with certification. Model WLL (t)* Stock No. Weight (kg) Jaw A (mm) B (mm) C (mm) D (mm) E (mm) F (mm) G (mm) H (mm) J (mm) K (mm) IPU10 0.5 2701675 19 0 - 16 44 130 216 40 115 42 28 - 11 IPU10 1 2701683 2.4 0 - 20 45 139 225 40 127 42 38 - 11 IPU10 2 2701677 8.5 0 - 35 78 201 368 70 188 64 55 - 16 IPU10 3 2701665 14.8 0 - 40 100 253 436 75 222 78 60 - 20 IPU10 4.5 2701667 16.0 0 - 40 100 253 436 75 227 82 65 - 20 IPU10 6 2701669 24.0 0 - 50 126 302 525 80 292 84 95 44 20 IPU10 9 2701671 29.5 0 - 50 126 325 552 80 310 94 104 44 20 IPU10 12 2701679 57.0 0 - 54 160 392 616 80 433 121 137 41 25 IPU10 16 2701683 79.0 5 - 64 180 463 736 88 492 121 153 45 25 IPU10 22.5 2701687 126.0 5 - 80 222 554 863 110 565 139 186 49 25 IPU10 30 2701691 11.0 5 - 80 222 554 868 110 590 153 186 54 30 Product Notes Design Factor based on EN 13155 and ASME B30.20 Higher Working Load Limits available upon request Maintenance and repair kits available Each product individually serialized with serial number and Proof Load test date stamped on body User manual with test certificate included with each clamp Model IPU10R (remote control) and IPU10W (wedge) available on request IPU10J Large Jaw Models Larger jaw opening for specialized applications Key Features Universal clamp with larger jaw opening capacity. Welded alloy steel body with forged components. Individually Proof Tested to 2 times the Working Load Limit with certification. Model WLL (t)* Stock No. Weight (kg) Jaw A (mm) B (mm) C (mm) D (mm) E (mm) F (mm) G (mm) H (mm) J (mm) K (mm) IPU10J 0.5 2701647 19 15 - 30 45 128 209 40 128 42 32 - 11 IPU10J 1 2702463 2.5 20 - 40 55 151 221 40 141 42 41 - 11 IPU10J 3 2702465 17.3 40 - 50 115 270 432 75 277 78 67 - 20 IPU10J 4.5 2702467 18.9 40 - 50 115 270 432 75 281 82 72 - 20 IPU10J 6 2702469 26.5 50 - 100 126 302 515 80 336 84 95 44 20 IPU10J 9 2701673 30.5 50 - 100 126 325 550 80 360 94 105 44 20 IPU10J 12 2701681 65.0 54 - 108 208 428 662 80 491 121 136 41 25 IPU10J 16 2701685 85.0 64 - 128 208 531 734 88 582 121 106 46 25 IPU10J 22.5 2701693 149.0 80 - 165 255 628 938 110 660 139 196 48 25 IPU10J 30 2701693 165.0 80 - 155 255 628 942 110 660 153 196 54 30 Product Notes Design Factor based on EN 13155 and ASME B30.20 Larger jaw opening for specialized applications Maintenance and repair kits available Each product individually serialized IPU10S Stainless Steel Models For use with stainless steel material Key Features Specialized clamp for stainless steel applications. Welded alloy steel body with forged components. Individually Proof Tested to 2 times the Working Load Limit with certification. Model WLL (t)* Stock No. Weight (kg) Jaw A (mm) B (mm) C (mm) D (mm) E (mm) F (mm) G (mm) H (mm) J (mm) K (mm) IPU10S 0.5 2702275 19 0 - 16 44 130 216 40 115 42 28 - 11 IPU10S 1 2702263 2.4 0 - 20 45 139 225 40 127 42 38 - 11 IPU10S 2 2702277 8.5 0 - 35 78 201 368 70 188 64 55 - 16 IPU10S 3 2702265 14.8 0 - 40 100 253 436 75 222 78 60 - 20 IPU10S 4.5 2702277 16.0 0 - 40 100 253 436 75 227 82 65 - 20 IPU10S 6 2702269 24.0 0 - 50 126 302 525 80 292 84 95 44 20 IPU10S 9 2702271 29.5 0 - 50 126 325 552 80 310 94 104 44 20 IPU10S 12 2702279 57.0 0 - 54 160 392 616 80 433 121 137 41 25 Product Notes Designed specifically for stainless steel applications Corrosion-resistant construction Maintenance and repair kits available Each product individually serialized IPU10H Hard Material Models For materials with surface hardness to 472HV10 (450 HB) Key Features Specialized clamp for hard materials. Welded alloy steel body with forged components. Individually Proof Tested to 2 times the Working Load Limit with certification. Model WLL (t)* Stock No. Weight (kg) Jaw A (mm) B (mm) C (mm) D (mm) E (mm) F (mm) G (mm) H (mm) J (mm) K (mm) IPU10H 0.5 2702175 19 0 - 16 44 130 216 40 115 42 28 - 11 IPU10H 0.75 2702183 2.4 0 - 20 45 139 225 40 127 42 38 - 11 IPU10H 1 2702177 7.6 0 - 35 78 201 368 70 188 64 55 - 16 IPU10H 2 2702165 14.8 0 - 40 100 253 436 75 222 78 60 - 20 IPU10H 3 2702167 16.0 0 - 40 100 253 436 75 227 82 65 - 20 IPU10H 4.5 2702169 24.0 0 - 50 126 302 525 80 292 84 95 44 20 IPU10H 6 2702171 29.5 0 - 50 126 325 552 70 310 94 104 44 20 Product Notes Designed for materials with surface hardness to 472HV10 (450 HB) Enhanced durability for hard material applications Maintenance and repair kits available Each product individually serialized Safety Features Alloy Steel Welded alloy steel body with forged components for maximum strength Proof Testing Individually tested to 2 times Working Load Limit Locking Mechanism Lock open and lock closed ability with latch for pretension Certification Meets EN 13155 and ASME B30.20 standards Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Beam Lifting Clamps Vertical‑Plate Clamps Horizontal‑Plate Clamps Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved. Crosby® is a registered trademark of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/HorizontalLiftingClamps.html", "text": "Portside India Traders - Crosby® IPHOZ Horizontal Lifting Clamps Portside India Traders Strength that Anchors Your Success Home About Products Contact Crosby® IPHOZ Horizontal Lifting Clamps Premium solution for horizontal lifting and material transfer applications Request a Quote Horizontal Lifting Clamps Overview Crosby® IPHOZ Horizontal Lifting Clamps are engineered for superior performance in demanding lifting applications. Designed specifically for horizontal lifting and transfer operations, these clamps provide reliable and efficient material handling. Key Features Available in capacities of 0.75 through 15 metric tons (higher WLL available on request) Wide variety of jaw openings: 0 to 60mm Welded alloy steel body for strength and compact size Forged alloy components where required Equipped with handle for easy placement Individually Proof Tested to 2 times the Working Load Limit with certification Company name (Crosby IP), logo, WLL and jaw opening permanently stamped on body Each product individually serialized with serial number and Proof Load test date stamped on body User manual with test certificate included with each clamp Maintenance and repair kits available Technical Specifications Design Factor: Based on EN 13155 and ASME B30.20 Proof Load Test: 2 times Working Load Limit Material: Welded alloy steel body with forged components Markings: Permanent stamps for WLL, jaw opening, serial number and test date Working Load Limit: Per pair (as specified) Technical Specifications IPHOZ Model Specifications All models feature welded alloy steel construction with forged components. Each clamp is individually proof tested to 2 times WLL. Model Working Load Limit (Per Pair) (t)* Stock No. Weight Each (kg) Jaw A (mm) B (mm) C (mm) E (mm) F (mm) G (mm) H (mm) J (mm) K (mm) L (mm) IPHOZ 0.75 2705401 3.0 0 - 30 94 16 70 118 81 12 31 12 IPHOZ 1.5 2705402 5.5 0 - 45 133 16 125 192 100 16 36 12 IPHOZ 3 2705403 8.0 0 - 45 137 20 125 200 120 20 48 10 IPHOZ 4.5 2705404 9.5 0 - 45 138 25 126 220 120 20 50 10 IPHOZ 6 2705405 15.5 0 - 60 171 30 135 235 130 20 56 20 IPHOZ 9 2705406 25.0 0 - 60 211 30 166 276 160 25 62 20 IPHOZ 12 2705407 29.0 0 - 60 217 40 168 294 190 25 62 19 IPHOZ 15 2705408 36.5 0 - 60 220 40 183 317 250 25 62 22 Product Notes Design Factor based on EN 13155 and ASME B30.20 Higher Working Load Limits available upon request Maintenance and repair kits available Working Load Limit is specified per pair of clamps Each product individually serialized with serial number and Proof Load test date stamped on body User manual with test certificate included with each clamp Safety & Efficiency Features Alloy Steel Welded alloy steel body with forged components for maximum strength Proof Testing Individually tested to 2 times Working Load Limit Ergonomic Handle Equipped with handle for easy and precise placement Certification Meets EN 13155 and ASME B30.20 standards Safety Certified Crosby® IPHOZ Horizontal Lifting Clamps are engineered to the highest safety standards with permanent markings for traceability and verification. Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Beam Lifting Clamps Vertical‑Plate Clamps Horizontal‑Plate Clamps Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved. Crosby® is a registered trademark of The Crosby Group LLC."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/ChainPulleyBlock.html", "text": "Portside India Traders - Chain Pulley Block Portside India Traders Strength that Anchors Your Success Home About Products Contact Chain Pulley Block Premium chain hoists for maximum lifting efficiency and safety Request a Quote Product Overview Our chain pulley blocks are engineered for superior performance in demanding lifting applications. Designed with premium materials and innovative features, these hoists deliver reliable performance and enhanced safety. Alloy Steel Hooks High-strength, anti-ading alloy steel Safety Latch 360° rotating hooks with secure latch Closed Design Protects internal components Superior Safety Overload protection features Key Features Suspension and load hooks made of anti-ading alloy steel, high strength, deformation occurs as first event of overload without sudden fracture Hook with safety latch securely can rotate freely 360 degrees Ergonomic handle design engineering so that the hoist is easy to operate Closed design protects the internal components from contamination All parts of the load disc brakes made from high quality steel and anti-corrosion materials Steel reinforcement is designed so that the shell strength better long life Stably overload USF or more can be optional, superior safety performance Gakharsted filling chain can guarantee against rust and corrosion features a long time Insurance pieces snap-on design makes filling safer All gear members made from 20cmmT material for better strength and toughness Finshing lifting the chain sprocket to run more smoothly with higher strength Lock ring design line with European standards Technical Specifications Model HSH DF-025 DF-050 DF-10 DF-20 DF-30 DF-50 DF-100 DF-200 DF-300 Safe Working Load (kg) 250 500 1000 2000 3000 5000 10000 20000 30000 Standardhub (m) 3 3 3 3 3 3 3 3 3 Number of parts (m) 1 1 1 1 1 2 3 8 12 Force at hand chain (N) 220 240 315 340 370 370 380 370 390 Chain size (mm) 4x12 5x15 6x18 8x24 10x30 10x30 10x30 10x30 10x30 Running Test Load (kg) 375 1000 1500 3000 4500 7500 15000 30000 45000 Weight (kg) 4.5 5.7 11 17 26 40 73 186 260 Packing Measurements (cm) 31.5x16x12 27.5x14.5x15.5 28x17x18.5 31x17.5x22 39x19x26 44x24x26 58x46.5x24.5 - - Gewicht mit standardhub (kg) 0.341 0.451 0.77 1.36 2.2 4.4 6.6 17.6 26.4 Extra weigh per meter of extra lift (kg) 0.9 0.9 0.9 0.9 0.9 0.9 0.9 1.8 1.8 Dimensions a (mm) 102 122 152 176 216 216 244 429 519 Dimensions b (mm) 28 34 40 52 62 65 70 125 150 Dimensions c (mm) 98 118 152 170 204 204 204 376 370 Dimensions d (mm) 22 23 29 33 41 45 55 75 85 Dimensions e (mm) 114 119 145 157 167 167 167 222 218 Dimensions f (mm) 64 65 79 81 83 83 83 109 108 Hmin (mm) 261 311 361 443 431 660 705 1100 1139 Product Notes Due to continuous updating of our products. The data is subject to changes without notice. Safety Features Overload Protection Deformation occurs as first event of overload without sudden fracture Secure Hooks 360° rotating hooks with safety latch for secure lifting Protected Components Closed design protects internal components from contamination Safety Design Insurance pieces snap-on design makes filling safer Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium maritime lifting equipment engineered for safety and reliability since our founding. Products Chain Pulley Blocks Ratchet Lever Hoist Pull Push Trolley Geared Trolley Baby Chain Pulley Hoists Heavy‑Duty Wire Rope Hoists Snatch Blocks with Shackles Manual Winches Electric Winches Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/RatchetLeverHoist_PullPushTrolley_GearedTrolley.html", "text": "Portside India Traders - Lifting Solutions Portside India Traders Strength that Anchors Your Success Home About Products Contact Premium Lifting Solutions Industrial-grade hoists and trolleys for maximum efficiency and safety Request a Quote Our Lifting Products Ratchet Lever Hoist Pull Push Trolley Geared Trolley Ratchet Lever Hoist Features High-strength alloy steel construction Safety latch equipped hooks Ergonomic handle design for easy operation Closed design protects internal components Overload protection for superior safety Ratchet Lever Hoist Specifications Model 0.75t 1.0t 1.5t 2.0t 3.0t 6.0t Capacity (t) 0.75 1 1.5 2 3 6 Standard lifting height (M) 1.5 1.5 1.5 1.5 1.5 1.5 Test Load (t) 1 1.25 1.875 2.5 3.75 7.5 H min 325 325 380 380 480 480 Effort Required (N) 140 148 210 220 330 340 Diameter Load chain (mm) 6 6 8 8 10 10 Net weight (kg) 7 7.5 11 11 18.5 29 Dimensions A (mm) 148 148 171 171 190 190 Dimensions B (mm) 87 87 98 98 105 105 Dimensions C (mm) 140 140 165 165 220 250 Dimensions D (mm) 35 35 40 40 50 60 Dimensions H (mm) 310 310 420 420 550 680 Dimensions L (mm) 250 250 405 405 405 405 Product Notes In addition to the list, we can accept orders for lifting heights within 12 meters. Pull Push Trolley Features Hand chain power operation Double shafts design with high-strength soldering sleeve for minimal deformation Bend-ear type side plate for safe running Circular arc-shaped wheel sides for use on I & H beams and other orbits Adjustable bushing and washer to accommodate different orbit widths Deep groove ball bearing wheels for smooth operation Robust Construction High-strength materials ensure durability and long service life Adjustable Design Easily adapts to different beam widths for versatile application Easy Operation Smooth hand chain operation requires minimal effort Safety Features Bend-ear side plates prevent derailment for secure operation Geared Trolley Features Precision-engineered for smooth operation Robust construction for heavy-duty applications Compatible with standard I-beams Multiple capacity options for various needs Designed for safety and reliability Geared Trolley Specifications Model 0.5MK 1MK 2MK 3MK 5DK 10MK 20MK Rated capacity (ton) 0.5 1 2 3 5 10 20 Test load (KN) 7.35 14.71 29.42 44.13 61.29 122.58 245.17 Min radius of curve (m) 0.8 1.0 1.1 1.3 1.4 3.5 4.0 Dimensions A - a (mm) 236 303 317 333 355 378 449 Dimensions A - b (mm) 286 405 419 435 457 480 551 Dimensions C - a (mm) 270 334 343 357 373 423 498 Dimensions C - b (mm) 322 436 445 459 475 525 600 Dimensions E - b (mm) 194 236 268 322 362 442 555 Dimensions F - c (mm) 176 196 225 266 301 396 498 Dimensions G - d (mm) 75 96 109 124 142 190 233 Dimensions H - e (mm) 30 38 38 40 42 45 58 Dimensions J - g (mm) 28 32 42 52 52 72 95 Dimensions K - i (mm) 32 40 52 63 74 110 135 Dimensions J - j (mm) 55 58 80 100 110 134 175 Dimensions M - k (mm) 79 95 108 131 144 176 226 I-beam width range M - a (mm) 50-152 64-203 88-203 100-203 114-203 124-203 136-203 I-beam width range J - b (mm) 50-203 64-305 88-305 100-305 114-305 124-305 136-305 Plan weight - a (kg) 6.5 11.5 18 30 44 82 159 Plan weight - b (kg) 7.5 13 20 34 50 89 167 Geared weight - a (kg) 10 14.5 22 34 47 88 165 Geared weight - b (kg) 11 16 24 38 53 94 167 Safety & Reliability Overload Protection Engineered to withstand test loads beyond rated capacity Robust Construction High-strength materials ensure durability and reliability Precision Engineering Precisely manufactured components for smooth operation Quality Assurance Rigorous testing to meet industry standards Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium lifting equipment engineered for safety and reliability since our founding. Products Chain Pulley Blocks Ratchet Lever Hoist Pull Push Trolley Geared Trolley Baby Chain Pulley Hoists Heavy‑Duty Wire Rope Hoists Snatch Blocks with Shackles Manual Winches Electric Winches Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/RatchetLeverHoist_PullPushTrolley_GearedTrolley.html#ratchet-content", "text": "Portside India Traders - Lifting Solutions Portside India Traders Strength that Anchors Your Success Home About Products Contact Premium Lifting Solutions Industrial-grade hoists and trolleys for maximum efficiency and safety Request a Quote Our Lifting Products Ratchet Lever Hoist Pull Push Trolley Geared Trolley Ratchet Lever Hoist Features High-strength alloy steel construction Safety latch equipped hooks Ergonomic handle design for easy operation Closed design protects internal components Overload protection for superior safety Ratchet Lever Hoist Specifications Model 0.75t 1.0t 1.5t 2.0t 3.0t 6.0t Capacity (t) 0.75 1 1.5 2 3 6 Standard lifting height (M) 1.5 1.5 1.5 1.5 1.5 1.5 Test Load (t) 1 1.25 1.875 2.5 3.75 7.5 H min 325 325 380 380 480 480 Effort Required (N) 140 148 210 220 330 340 Diameter Load chain (mm) 6 6 8 8 10 10 Net weight (kg) 7 7.5 11 11 18.5 29 Dimensions A (mm) 148 148 171 171 190 190 Dimensions B (mm) 87 87 98 98 105 105 Dimensions C (mm) 140 140 165 165 220 250 Dimensions D (mm) 35 35 40 40 50 60 Dimensions H (mm) 310 310 420 420 550 680 Dimensions L (mm) 250 250 405 405 405 405 Product Notes In addition to the list, we can accept orders for lifting heights within 12 meters. Pull Push Trolley Features Hand chain power operation Double shafts design with high-strength soldering sleeve for minimal deformation Bend-ear type side plate for safe running Circular arc-shaped wheel sides for use on I & H beams and other orbits Adjustable bushing and washer to accommodate different orbit widths Deep groove ball bearing wheels for smooth operation Robust Construction High-strength materials ensure durability and long service life Adjustable Design Easily adapts to different beam widths for versatile application Easy Operation Smooth hand chain operation requires minimal effort Safety Features Bend-ear side plates prevent derailment for secure operation Geared Trolley Features Precision-engineered for smooth operation Robust construction for heavy-duty applications Compatible with standard I-beams Multiple capacity options for various needs Designed for safety and reliability Geared Trolley Specifications Model 0.5MK 1MK 2MK 3MK 5DK 10MK 20MK Rated capacity (ton) 0.5 1 2 3 5 10 20 Test load (KN) 7.35 14.71 29.42 44.13 61.29 122.58 245.17 Min radius of curve (m) 0.8 1.0 1.1 1.3 1.4 3.5 4.0 Dimensions A - a (mm) 236 303 317 333 355 378 449 Dimensions A - b (mm) 286 405 419 435 457 480 551 Dimensions C - a (mm) 270 334 343 357 373 423 498 Dimensions C - b (mm) 322 436 445 459 475 525 600 Dimensions E - b (mm) 194 236 268 322 362 442 555 Dimensions F - c (mm) 176 196 225 266 301 396 498 Dimensions G - d (mm) 75 96 109 124 142 190 233 Dimensions H - e (mm) 30 38 38 40 42 45 58 Dimensions J - g (mm) 28 32 42 52 52 72 95 Dimensions K - i (mm) 32 40 52 63 74 110 135 Dimensions J - j (mm) 55 58 80 100 110 134 175 Dimensions M - k (mm) 79 95 108 131 144 176 226 I-beam width range M - a (mm) 50-152 64-203 88-203 100-203 114-203 124-203 136-203 I-beam width range J - b (mm) 50-203 64-305 88-305 100-305 114-305 124-305 136-305 Plan weight - a (kg) 6.5 11.5 18 30 44 82 159 Plan weight - b (kg) 7.5 13 20 34 50 89 167 Geared weight - a (kg) 10 14.5 22 34 47 88 165 Geared weight - b (kg) 11 16 24 38 53 94 167 Safety & Reliability Overload Protection Engineered to withstand test loads beyond rated capacity Robust Construction High-strength materials ensure durability and reliability Precision Engineering Precisely manufactured components for smooth operation Quality Assurance Rigorous testing to meet industry standards Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium lifting equipment engineered for safety and reliability since our founding. Products Chain Pulley Blocks Ratchet Lever Hoist Pull Push Trolley Geared Trolley Baby Chain Pulley Hoists Heavy‑Duty Wire Rope Hoists Snatch Blocks with Shackles Manual Winches Electric Winches Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/RatchetLeverHoist_PullPushTrolley_GearedTrolley.html#pull-push-content", "text": "Portside India Traders - Lifting Solutions Portside India Traders Strength that Anchors Your Success Home About Products Contact Premium Lifting Solutions Industrial-grade hoists and trolleys for maximum efficiency and safety Request a Quote Our Lifting Products Ratchet Lever Hoist Pull Push Trolley Geared Trolley Ratchet Lever Hoist Features High-strength alloy steel construction Safety latch equipped hooks Ergonomic handle design for easy operation Closed design protects internal components Overload protection for superior safety Ratchet Lever Hoist Specifications Model 0.75t 1.0t 1.5t 2.0t 3.0t 6.0t Capacity (t) 0.75 1 1.5 2 3 6 Standard lifting height (M) 1.5 1.5 1.5 1.5 1.5 1.5 Test Load (t) 1 1.25 1.875 2.5 3.75 7.5 H min 325 325 380 380 480 480 Effort Required (N) 140 148 210 220 330 340 Diameter Load chain (mm) 6 6 8 8 10 10 Net weight (kg) 7 7.5 11 11 18.5 29 Dimensions A (mm) 148 148 171 171 190 190 Dimensions B (mm) 87 87 98 98 105 105 Dimensions C (mm) 140 140 165 165 220 250 Dimensions D (mm) 35 35 40 40 50 60 Dimensions H (mm) 310 310 420 420 550 680 Dimensions L (mm) 250 250 405 405 405 405 Product Notes In addition to the list, we can accept orders for lifting heights within 12 meters. Pull Push Trolley Features Hand chain power operation Double shafts design with high-strength soldering sleeve for minimal deformation Bend-ear type side plate for safe running Circular arc-shaped wheel sides for use on I & H beams and other orbits Adjustable bushing and washer to accommodate different orbit widths Deep groove ball bearing wheels for smooth operation Robust Construction High-strength materials ensure durability and long service life Adjustable Design Easily adapts to different beam widths for versatile application Easy Operation Smooth hand chain operation requires minimal effort Safety Features Bend-ear side plates prevent derailment for secure operation Geared Trolley Features Precision-engineered for smooth operation Robust construction for heavy-duty applications Compatible with standard I-beams Multiple capacity options for various needs Designed for safety and reliability Geared Trolley Specifications Model 0.5MK 1MK 2MK 3MK 5DK 10MK 20MK Rated capacity (ton) 0.5 1 2 3 5 10 20 Test load (KN) 7.35 14.71 29.42 44.13 61.29 122.58 245.17 Min radius of curve (m) 0.8 1.0 1.1 1.3 1.4 3.5 4.0 Dimensions A - a (mm) 236 303 317 333 355 378 449 Dimensions A - b (mm) 286 405 419 435 457 480 551 Dimensions C - a (mm) 270 334 343 357 373 423 498 Dimensions C - b (mm) 322 436 445 459 475 525 600 Dimensions E - b (mm) 194 236 268 322 362 442 555 Dimensions F - c (mm) 176 196 225 266 301 396 498 Dimensions G - d (mm) 75 96 109 124 142 190 233 Dimensions H - e (mm) 30 38 38 40 42 45 58 Dimensions J - g (mm) 28 32 42 52 52 72 95 Dimensions K - i (mm) 32 40 52 63 74 110 135 Dimensions J - j (mm) 55 58 80 100 110 134 175 Dimensions M - k (mm) 79 95 108 131 144 176 226 I-beam width range M - a (mm) 50-152 64-203 88-203 100-203 114-203 124-203 136-203 I-beam width range J - b (mm) 50-203 64-305 88-305 100-305 114-305 124-305 136-305 Plan weight - a (kg) 6.5 11.5 18 30 44 82 159 Plan weight - b (kg) 7.5 13 20 34 50 89 167 Geared weight - a (kg) 10 14.5 22 34 47 88 165 Geared weight - b (kg) 11 16 24 38 53 94 167 Safety & Reliability Overload Protection Engineered to withstand test loads beyond rated capacity Robust Construction High-strength materials ensure durability and reliability Precision Engineering Precisely manufactured components for smooth operation Quality Assurance Rigorous testing to meet industry standards Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium lifting equipment engineered for safety and reliability since our founding. Products Chain Pulley Blocks Ratchet Lever Hoist Pull Push Trolley Geared Trolley Baby Chain Pulley Hoists Heavy‑Duty Wire Rope Hoists Snatch Blocks with Shackles Manual Winches Electric Winches Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/RatchetLeverHoist_PullPushTrolley_GearedTrolley.html#geared-content", "text": "Portside India Traders - Lifting Solutions Portside India Traders Strength that Anchors Your Success Home About Products Contact Premium Lifting Solutions Industrial-grade hoists and trolleys for maximum efficiency and safety Request a Quote Our Lifting Products Ratchet Lever Hoist Pull Push Trolley Geared Trolley Ratchet Lever Hoist Features High-strength alloy steel construction Safety latch equipped hooks Ergonomic handle design for easy operation Closed design protects internal components Overload protection for superior safety Ratchet Lever Hoist Specifications Model 0.75t 1.0t 1.5t 2.0t 3.0t 6.0t Capacity (t) 0.75 1 1.5 2 3 6 Standard lifting height (M) 1.5 1.5 1.5 1.5 1.5 1.5 Test Load (t) 1 1.25 1.875 2.5 3.75 7.5 H min 325 325 380 380 480 480 Effort Required (N) 140 148 210 220 330 340 Diameter Load chain (mm) 6 6 8 8 10 10 Net weight (kg) 7 7.5 11 11 18.5 29 Dimensions A (mm) 148 148 171 171 190 190 Dimensions B (mm) 87 87 98 98 105 105 Dimensions C (mm) 140 140 165 165 220 250 Dimensions D (mm) 35 35 40 40 50 60 Dimensions H (mm) 310 310 420 420 550 680 Dimensions L (mm) 250 250 405 405 405 405 Product Notes In addition to the list, we can accept orders for lifting heights within 12 meters. Pull Push Trolley Features Hand chain power operation Double shafts design with high-strength soldering sleeve for minimal deformation Bend-ear type side plate for safe running Circular arc-shaped wheel sides for use on I & H beams and other orbits Adjustable bushing and washer to accommodate different orbit widths Deep groove ball bearing wheels for smooth operation Robust Construction High-strength materials ensure durability and long service life Adjustable Design Easily adapts to different beam widths for versatile application Easy Operation Smooth hand chain operation requires minimal effort Safety Features Bend-ear side plates prevent derailment for secure operation Geared Trolley Features Precision-engineered for smooth operation Robust construction for heavy-duty applications Compatible with standard I-beams Multiple capacity options for various needs Designed for safety and reliability Geared Trolley Specifications Model 0.5MK 1MK 2MK 3MK 5DK 10MK 20MK Rated capacity (ton) 0.5 1 2 3 5 10 20 Test load (KN) 7.35 14.71 29.42 44.13 61.29 122.58 245.17 Min radius of curve (m) 0.8 1.0 1.1 1.3 1.4 3.5 4.0 Dimensions A - a (mm) 236 303 317 333 355 378 449 Dimensions A - b (mm) 286 405 419 435 457 480 551 Dimensions C - a (mm) 270 334 343 357 373 423 498 Dimensions C - b (mm) 322 436 445 459 475 525 600 Dimensions E - b (mm) 194 236 268 322 362 442 555 Dimensions F - c (mm) 176 196 225 266 301 396 498 Dimensions G - d (mm) 75 96 109 124 142 190 233 Dimensions H - e (mm) 30 38 38 40 42 45 58 Dimensions J - g (mm) 28 32 42 52 52 72 95 Dimensions K - i (mm) 32 40 52 63 74 110 135 Dimensions J - j (mm) 55 58 80 100 110 134 175 Dimensions M - k (mm) 79 95 108 131 144 176 226 I-beam width range M - a (mm) 50-152 64-203 88-203 100-203 114-203 124-203 136-203 I-beam width range J - b (mm) 50-203 64-305 88-305 100-305 114-305 124-305 136-305 Plan weight - a (kg) 6.5 11.5 18 30 44 82 159 Plan weight - b (kg) 7.5 13 20 34 50 89 167 Geared weight - a (kg) 10 14.5 22 34 47 88 165 Geared weight - b (kg) 11 16 24 38 53 94 167 Safety & Reliability Overload Protection Engineered to withstand test loads beyond rated capacity Robust Construction High-strength materials ensure durability and reliability Precision Engineering Precisely manufactured components for smooth operation Quality Assurance Rigorous testing to meet industry standards Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium lifting equipment engineered for safety and reliability since our founding. Products Chain Pulley Blocks Ratchet Lever Hoist Pull Push Trolley Geared Trolley Baby Chain Pulley Hoists Heavy‑Duty Wire Rope Hoists Snatch Blocks with Shackles Manual Winches Electric Winches Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/BabyChainPulleyHoist.html", "text": "Portside India Traders - Baby Chain Pulley Hoist Portside India Traders Strength that Anchors Your Success Home About Products Contact Baby Chain Pulley Hoist Premium lifting solutions with German-engineered precision Request a Quote Our Baby Chain Pulley Hoist Models Standard Model With Hook Suspension Key Features Manufactured in ISO 9001:2000 Certified Company Assured quality & interchangeability of parts Equipped with Grade 80 Load Chain for long chain life & higher safety factor Rugged German design with over 30 years of proven reliability Precision machined case-hardened alloy steel gears for longer life and noiseless operation Lightweight simple mounting design for ease of installation Built-in electrical control panel - ready to use Precision machined & hardened load chain wheel for longer life and smooth operation Technical Specifications Specification Capacity 500 KG 1000 KG 2000 KG Chain Falls (no) 2 2 4 Hoisting Speed (m/min) 4.8 4.8 2.4 Hoist Motor (H.P.) 1.5 1.5 1.5 Height of Max Lift (std 3m) 9.6 9.6 4.8 Length of control cable At your choice Approx. Wt. With Chains For 3m Lift (kg) 63 63 65 Approx. Wt. Per Meter Additional Lift (kg) 2.6 2.6 5.2 Note Higher lifts offered on request With Hook Suspension (Fig 1) Traveling Motor (m/min): 10 Traveling Speed (H.P.): 0.25 Min. Runaway Bend (radius of curvature - mm): 1500 Approx. weight with chains for 3 m lift (kg): 87 (500/1000KG), 96 (2000KG) Approx. weight per metre additional lift (kg): 2.6 (500/1000KG), 5.2 (2000KG) Technical Specifications Specification Capacity 500 KG 1000 KG 2000 KG Traveling Motor (m/min) 10 10 10 Traveling Speed (H.P.) 0.25 0.25 0.25 Min. Runaway Bend (radius of curvature - mm) 1500 1500 1500 Approx. weight with chains for 3 m lift (kg) 87 87 96 Approx. weight per metre additional lift (kg) 2.6 2.6 5.2 Important Notes To calculate clearance under beam, subtract beam flange thickness from J Data tolerance: +/- 10% All dimensions in millimeters Dimensions Diagram Reference Dimensions Reference A for C Max: 493mm (500KG), 493mm (1000KG), 500mm (2000KG) A for C Min: 370mm (500KG), 370mm (1000KG), 395mm (2000KG) B: 840mm (500KG), 840mm (1000KG), 965mm (2000KG) C Max: 305mm (all capacities) C Min: 58mm (500KG), 58mm (1000KG), 90mm (2000KG) D Min: 150mm (500KG), 150mm (1000KG), 200mm (2000KG) E: 525mm (all capacities) F: 285mm (all capacities) G: 31mm (500KG), 31mm (1000KG), 37mm (2000KG) H Min: 23mm (500KG), 23mm (1000KG), 14mm (2000KG) J Max: 28mm (all capacities) Safety & Reliability Overload Protection Engineered to withstand test loads beyond rated capacity Robust Construction High-strength materials ensure durability and reliability Precision Engineering Precisely manufactured components for smooth operation Quality Assurance Rigorous testing to meet industry standards Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium lifting equipment engineered for safety and reliability since our founding. Products Chain Pulley Blocks Ratchet Lever Hoist Pull Push Trolley Geared Trolley Baby Chain Pulley Hoists Heavy‑Duty Wire Rope Hoists Snatch Blocks with Shackles Manual Winches Electric Winches Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/HeavyDutyWireropeHoist.html", "text": "Portside India Traders - Heavy Duty Wire Rope Hoist Portside India Traders Strength that Anchors Your Success Home About Products Contact Heavy Duty Wire Rope Hoist Robust Class IV design for the toughest industrial applications Request a Quote Our Heavy Duty Wire Rope Hoist Models Standard Models Heavy Duty Models Key Features Heavy Duty Class IV Robust Design Smooth operation even in toughest of applications Manufactured in ISO 9001:2000 Certified Company Assured quality and interchangeability of parts Truly Modular Construction Easily Accessible separate brake, motor, drum gear box and panel unit Seamless Pipe Accurately Machined rope drum for long life Unique and Sturdy rope guide arrangement prevents rope slackening Precision Machine Cut Case-Hardened Alloy Steel gears for noiseless operation Fall Safe Disk Brake for trouble-free operation Built in Control Panel with Std. Electricals - ready to use Technical Specifications Specification Model NP 101 WHR I NP 201 WHR II P 301 WHR III Class IV IV IV S.W.L. (Tonne) 1.0 2.0 2.5 Lift (m) 6 12 20 Approx. Weight (kg) 264 286 322 Dim B (mm) 1075 1285 1555 Dim C (mm) 552 752 1022 Hoisting Speed (m/min) 9 8 8 Hoisting Motor H.P. (kW) 3 (2.2) 5 (3.7) 7.5 (5.5) Travelling Speed (m/min) 17 17 17 Travelling Motor H.P. (kW) 0.25 (0.18) 0.25 (0.18) 0.5 (0.37) Min. Height of 'T' Beam (mm) 175 175 250 F Min - Max (mm) 90-180 90-180 125-210 Note All specifications subject to change without notice. Contact us for detailed dimensional drawings. Heavy Duty Models Enhanced specifications for demanding industrial applications Technical Specifications Specification Model NP 102 WHR I NP 202 WHR II P 302 WHR III P 303 (5T) WHR III P 303 (6T) WHR III Class IV IV IV IV IV S.W.L. (Tonne) 3.0 2.0 4.0 5.0 6.0 Lift (m) 11.4 19.2 7 10 3.3 Approx. Weight (kg) 386 414 459 546 568 Dim B (mm) 1170 1340 1610 1425 1695 Dim C (mm) 588 758 1028 805 1075 Hoisting Speed (m/min) 8 8 8 8 8 Hoisting Motor H.P. (kW) 3 (2.2) 5 (3.7) 7.5 (5.5) 7.5 (5.5) 7.5 (5.5) Travelling Speed (m/min) 17 17 17 17 17 Travelling Motor H.P. (kW) 0.25 (0.18) 0.5 (0.37) 0.75 (0.55) 0.75 (0.55) 0.75 (0.55) Min. Height of 'T' Beam (mm) 175 250 250 300 300 F Min - Max (mm) 90-180 125-210 125-210 ** ** Dimension Reference All dimensions in millimeters Dimension Description Dim B Overall length of hoist Dim C Distance from center of hook to end of hoist F Min-Max Hook approach range Safety & Reliability ISO Certified Manufactured in ISO 9001:2000 certified facility Fall Safe Disk Brake Trouble-free operation and ease of adjustment Precision Engineering Case-hardened alloy steel gears for noiseless operation Robust Construction Class IV heavy-duty design for demanding applications Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium lifting equipment engineered for safety and reliability since our founding. Products Chain Pulley Blocks Ratchet Lever Hoist Pull Push Trolley Geared Trolley Baby Chain Pulley Hoists Heavy‑Duty Wire Rope Hoists Snatch Blocks with Shackles Manual Winches Electric Winches Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/SnatchBlockWithShackle.html", "text": "Portside India Traders - Snatch Block With Shackle Portside India Traders Strength that Anchors Your Success Home About Products Contact Snatch Block With Shackle Heavy-duty lifting solutions for industrial and marine applications Request a Quote Our Snatch Block Models Champion Type Snatch Blocks Wire Rope Pulley Blocks SL 419 SNATCH BLOCK - Champion Type Heavy-duty construction for maximum durability Precision-engineered sheaves for smooth operation Compatible with a wide range of wire rope diameters Drop-forged shackles for superior strength Designed for industrial, marine, and construction applications Technical Specifications Capacity (Tons) Sheave Size (Inch) Wire Rope Dia (mm) 2 3 8 - 10 4 4.1/2 10 - 12 8 6 16 - 19 10 8 19 - 22 12 8 19 - 22 15 10 25 - 28 25 10 32 - 36 30 8 36 - 38 35 10 38 - 44 55 14 44 - 50 75 20 56 - 64 100 24 64 - 76 200 30 76 - 83 Wire Rope Pulley Blocks Pulley blocks for wire ropes with drop forged swivel eye on top C.I. pulley fitted with G.M. bushing & self lubricating system Available in single, double, triple, and four sheave configurations Grease nipple for self-lubricating system and high tensile pin with test certificate Technical Specifications Size (inches) Single Sheave Capacity (tons) Double Sheave Capacity (tons) Triple Sheave Capacity (tons) Four Sheave Capacity (tons) 6 X ½ 1.5 3 3.5 6 8 X 5/8 2.5 5 7.5 10 10 X 3/4 3 5 9 12 12 X 1 5 10 15 25 14 X 1.1/4 10 15 20 35 16 X 1.1/2 15 20 25 50 Safety & Reliability Test Certified High tensile pins come with test certificates for quality assurance Self-Lubricating Fitted with grease nipple for easy maintenance and long life Precision Engineering GM bushing ensures smooth operation and reduced wear Robust Construction Drop forged components for maximum strength and durability Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium lifting equipment engineered for safety and reliability since our founding. Products Chain Pulley Blocks Ratchet Lever Hoist Pull Push Trolley Geared Trolley Baby Chain Pulley Hoists Heavy‑Duty Wire Rope Hoists Snatch Blocks with Shackles Manual Winches Electric Winches Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/ManualWinches.html", "text": "Portside India Traders - Manual Winches Portside India Traders Strength that Anchors Your Success Home About Products Contact Manual Winches Robust hand-operated winches for demanding lifting applications Request a Quote Our Manual Winch Models Double Purchase Crab Winch Triple Purchase Crab Winch Key Features Hand operated crab winch with square type side plate Covers big pinion and reinforced by side angle Fabricated seamless pipe drum for durability Brake with shoe, ratchet, pawl and handles Robust construction for long service life Precision-engineered components for smooth operation Designed for industrial, marine, and construction applications Easy maintenance and operation Technical Specifications To Lift Direct From Barrel Drum Dia Drum Length Thickness of Side Plate Main Shaft Dia No. of Driving Shaft Dia of Driving Shaft Dia of Tie Rod No. of Tie Rod Height Width Purchase Dia Main Pinion Flange Dia Weight of Winch (kg) 1 Ton 5 1/2\" 16\" 6mm 32mm 2 1 1/8\" 16mm 4 25\" 21\" Double 17 1/4\" 9\" 150 1.5 Ton 5 1/2\" 18 1/2\" 6mm 32mm 2 1 1/4\" 16mm 4 29\" 23\" Double 21 1/4\" 9\" 175 2 Ton 6 5/8\" 22\" 8mm 40mm 2 1 3/8\" 20mm 4 35\" 27\" Double 26 1/4\" 11\" 250 3 Ton 6 5/8\" 24\" 8mm 45mm 2 1 1/2\" 22mm 4 39\" 30\" Double 30\" 11\" 280 5 Ton 8 5/8\" 30\" 10mm 50mm 2 1 3/4\" 25mm 4 48\" 34\" Double 35 5/8\" 13\" 425 Note Specifications are indicative and subject to change. Contact us for detailed dimensional drawings. Triple Purchase Crab Winch Heavy-duty solution for demanding applications Hand operated with reinforced construction Fabricated seamless pipe drum for durability Brake with shoe, ratchet, pawl and handles Precision-engineered for smooth operation Easy maintenance and operation Technical Specifications To Lift Direct From Barrel Drum Dia Drum Length Thickness of Side Plate Main Shaft Dia No. of Driving Shaft Dia of Driving Shaft Dia of Tie Rod No. of Tie Rod Height Width Purchase Dia Main Pinion Flange Dia Weight of Winch (kg) 7.5 Ton 8 5/8\" 30\" 10mm 50mm 3 1 3/4\" 25mm 4 48\" 34\" Triple 35 5/8\" 13\" 650 10 Ton 8 5/8\" 34\" 11mm 65mm 3 1.875\" 32mm 4 48\" 35\" Triple 34\" 16\" 750 Note Specifications are indicative and subject to change. Contact us for detailed dimensional drawings. Safety & Reliability Robust Braking System Brake with shoe, ratchet and pawl for secure operation Precision Engineering Fabricated seamless pipe drum for smooth operation Reinforced Construction Square type side plate reinforced by side angle Quality Materials High-strength components for long service life Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium lifting equipment engineered for safety and reliability since our founding. Products Chain Pulley Blocks Ratchet Lever Hoist Pull Push Trolley Geared Trolley Baby Chain Pulley Hoists Heavy‑Duty Wire Rope Hoists Snatch Blocks with Shackles Manual Winches Electric Winches Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/ElectricWinches.html", "text": "Portside India Traders - Electric Winches Portside India Traders Strength that Anchors Your Success Home About Products Contact Electric Winches Robust and reliable industrial winches for lifting up to 25 tons Request a Quote Our Electric Winch Models Standard Models Heavy Duty Models Key Features Heavy-duty construction for demanding industrial applications Available in capacities from 1 ton to 25 tons Robust design with high-quality components Designed for smooth operation and long service life Multiple motor options from leading manufacturers Available in both induction and slip-ring motor variants Technical Specifications Specification 1 TON 2 TON 3 TON 5 TON 7.5 TON 10 TON 15 TON 20 TON 25 TON Speed (Mtr/Min) 8/10 6/8 6/8 6/8 8 8 8 4 4 Drum Capacity (Mtr) 200 300 500 500 500 700 500 300 300 Rope Dia (mm) 10 12 16 19 22 25 32 32 32 Motor (H.P.) 5 7.5 10 15 20 30 40 30 40 Note Specifications are indicative and subject to change. Contact us for detailed dimensional drawings. Heavy Duty Models Enhanced specifications for the most demanding applications Custom drum and chassis options available Electro-hydraulic thruster brake for reliable stopping power Totally enclosed, fan cooled gearbox Weatherproof control panel with overload protection Technical Specifications Specification 30 TON 40 TON 50 TON 60 TON Speed (Mtr/Min) 4 4 3 3 Drum Capacity (Mtr) 250 200 150 120 Rope Dia (mm) 36 40 44 48 Motor (H.P.) 50 60 75 90 Note Specifications are indicative and subject to change. Contact us for detailed dimensional drawings. Safety & Reliability Robust Construction Heavy-duty design with durable components for industrial use Advanced Braking System Electro-hydraulic thruster brake for reliable stopping power Precision Engineering High-quality gears and components for smooth operation Safety Controls Integrated control panel with overload protection Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium lifting equipment engineered for safety and reliability since our founding. Products Chain Pulley Blocks Ratchet Lever Hoist Pull Push Trolley Geared Trolley Baby Chain Pulley Hoists Heavy‑Duty Wire Rope Hoists Snatch Blocks with Shackles Manual Winches Electric Winches Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/Anchors.html", "text": "Portside India Traders - Marine Anchors Portside India Traders Strength that Anchors Your Success Home About Products Contact Marine Anchors Premium quality anchors for maritime applications Request Specifications Stockless Anchors Technical Specifications Normal Weight (kg) B1 (mm) C (mm) B (mm) L2 (mm) A (mm) 50 400 270 284 172 450 75 480 318 339 200 550 100 540 358 381 232 760 120 570 420 402 245 800 140 600 443 424 258 840 165 630 456 445 271 880 180 650 480 459 280 910 200 660 487 466 284 920 240 720 530 510 310 1010 300 770 570 540 331 1080 360 820 610 560 353 1150 420 860 640 610 370 1200 480 900 670 640 387 1260 570 950 700 670 408 1330 660 1000 740 710 430 1440 780 1060 780 750 456 1480 900 1110 820 780 470 1550 1020 1160 860 820 500 1620 1140 1200 890 850 520 1680 1290 1250 920 880 540 1750 1440 1300 960 920 560 1820 1590 1340 990 950 580 1880 1740 1380 1020 980 600 1930 1920 1430 1060 1010 620 2000 2100 1470 1090 1040 640 2060 2280 1510 1120 1070 650 2100 2460 1550 1150 1100 670 2170 2640 1590 1180 1120 690 2230 2850 1630 1210 1150 700 2230 3060 1670 1240 1180 720 2340 3300 1710 1270 1210 740 2390 3540 1750 1290 1240 750 2450 3780 1790 1320 1260 770 2510 4050 1830 1350 1290 790 2560 4320 1870 1380 1320 800 2620 4590 1910 1410 1350 820 2670 4890 1950 1440 1380 840 2730 5250 2000 180 1410 860 2800 5610 2040 1510 1440 880 2860 6000 2090 1540 1480 900 2930 6450 2140 1580 1510 920 3000 6900 2190 1620 1550 0.94 3070 7350 2240 1650 1580 960 3140 7800 2280 1680 1610 680 3090 8300 2330 1720 1650 1000 3200 8700 2370 1750 1670 1020 3320 9300 2420 1790 1710 1040 3390 9900 2470 1820 1740 1060 3460 10500 2520 1860 1780 1080 3530 11100 2570 1900 1820 1100 3600 11700 2610 1930 1840 1120 3650 12300 2650 1960 1870 1140 3710 12900 2690 1990 1900 1160 3770 13500 2740 2020 1940 1180 3840 14100 2780 2050 1960 1200 3890 14700 2820 2080 1990 1210 3950 15400 2860 2110 2020 1230 4000 16100 2900 2140 2050 1250 4060 16900 2950 2180 2080 1270 4130 17800 3000 2210 2120 1290 4200 18800 3060 2260 2160 1320 4280 20000 3120 2300 2200 1340 4370 21500 3200 2360 2260 1380 4480 23000 3270 2410 2310 1410 4580 24500 3340 2460 2360 1440 4680 26000 3410 2520 2410 1470 4770 27500 3470 2560 2450 1490 4860 29000 3530 2610 2490 1520 4946 Note Dimensions are in millimeters. Specifications are indicative and subject to change. Contact us for detailed dimensional drawings. Anchor Components Shank Main structural element providing leverage Fluke Digs into seabed for holding power Crown Connects flukes to the shank Stock Ensures anchor turns to digging position Why Choose Our Anchors Superior Holding Power Designed for maximum holding capacity in various seabed conditions Quality Materials Manufactured using high-grade steel for durability and corrosion resistance Optimal Weight Ratios Engineered for the perfect balance of weight and performance International Standards Compliant with global maritime safety and quality regulations Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium marine equipment engineered for safety and reliability since our founding. Products Anchors Stud‑Link Anchor Chains Lashing Chains & Load Binders Grafil Mooring Ropes Grafil Industrial Ropes Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/StudLinkAnchorChain.html", "text": "Portside India Traders - Stud Link Anchor Chains Portside India Traders Strength that Anchors Your Success Home About Products Contact Stud Link Anchor Chains Premium quality marine chains certified for safety and reliability Request Specifications Stud Link Anchor Chains We are the exclusive selling agent in India for Jiangsu Asian Star Anchor Chain Co. Ltd., providing premium quality stud link anchor chains that meet international standards for marine applications. Technical Specifications No. of links per 27.5m (90 ft) Chain Diameter (mm) Grade 2 Grade 3 Approx. mass (kg/27.5m) No. of links per 27.5m (90 ft) Chain Diameter (mm) Grade 2 Grade 3 Approx. mass (kg/27.5m) Proof load (KN) Breaking load (KN) Proof load (KN) Breaking load (KN) Proof load (KN) Breaking load (KN) Proof load (KN) Breaking load (KN) 491 14 82 116 116 165 130 107 64 1560 2190 2130 3130 2529 429 16 107 150 150 216 170 105 66 1660 2310 2310 3300 2689 391 17.5 127 179 179 256 189 99 68 1750 2450 2450 3500 2858 357 19 150 211 211 301 226 97 70 1840 2580 2580 3690 3025 329 20.5 175 244 244 349 263 93 73 1990 2790 2790 3990 3341 305 22 200 280 280 401 303 89 76 2150 3010 3010 4300 3566 285 24 237 332 332 476 370 87 78 2260 3160 3160 4500 3756 259 26 278 389 389 556 439 85 81 2410 3380 3380 4820 4050 245 28 321 449 449 642 496 81 84 2580 3610 3610 5160 4355 225 30 368 514 514 735 564 79 87 2750 3850 3850 5500 4672 213 32 417 583 583 833 635 77 90 2920 4090 4090 5840 5000 195 34 468 655 655 937 724 73 92 3040 4260 4260 6080 5224 187 36 523 732 732 1050 812 71 95 3230 4510 4510 6440 5571 179 38 581 812 812 1160 905 71 97 3340 4680 4680 6690 5809 171 40 640 896 896 1280 1032 69 100 3530 4940 4940 7060 6174 165 42 703 981 981 1400 1075 67 102 3660 5120 5120 7320 6423 153 44 769 1080 1080 1540 1197 65 105 3850 5390 5390 7700 6806 147 46 837 1170 1170 1680 1310 63 107 3980 5570 5570 7960 7067 143 48 908 1270 1270 1810 1438 61 111 4250 5940 5940 8480 7606 137 50 981 1370 1370 1960 1536 59 114 4440 6230 6230 8890 8023 129 52 1060 1480 1480 2110 1669 57 117 4650 6510 6510 9300 8450 125 54 1140 1590 1590 2270 1780 57 120 4850 6810 6810 9720 8889 123 56 1220 1710 1710 2430 1936 57 122 5000 7000 7000 9990 9187 119 58 1290 1810 1810 2600 2086 55 124 5140 7200 7200 10280 9492 113 60 1380 1940 1940 2770 2249 55 127 5350 7490 7490 10710 9957 111 62 1470 2060 2060 2940 2373 Calculation Formula Test load = C × D × (44 - 0.08D) Where D is the nominal chain diameter in millimeters Chain Components Stud Link Core component of anchor chains Kenter Shackle For joining chain sections D-Type Shackle Connects chain to anchor Swivel Adaptor Prevents chain twisting Why Choose Our Anchor Chains Grade 2 & 3 Certified Meets international quality and safety standards Tested Strength Rigorously tested for proof and breaking loads Corrosion Resistant Specially treated for marine environments Marine Grade Designed for commercial and naval vessels Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium marine equipment engineered for safety and reliability since our founding. Products Anchors Stud‑Link Anchor Chains Lashing Chains & Load Binders Grafil Mooring Ropes Grafil Industrial Ropes Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/LashingChainsAndLoadBinders.html", "text": "Portside India Traders - Lashing Chains & Load Binders Portside India Traders Strength that Anchors Your Success Home About Products Contact Lashing Chains & Load Binders Premium cargo securing solutions for transportation and logistics Request Specifications Our Product Range Lashing Chains Our premium lashing chains are engineered for superior strength and durability in cargo securing applications. Designed to withstand heavy loads and harsh conditions, these chains provide reliable performance for transportation and logistics. Ref. Chain Diameter (mm) Inside Length (mm) Inside Width (mm) Breaking Load (kN) Weight per Meter (kg) CL-9 9 57 16 100 1.5 CL-11 11 66 18 150 2.1 CL-13 13 81 22 200 2.9 Quality Assurance All chains undergo rigorous testing to ensure they meet international safety standards and performance requirements. SL-140 Load Binders Upgraded for use with grades 70, 80 and 100 chain, the SL-140 features a new design \"one piece\" forged handle and continuous take-up feature for optimal load adjustment. One-Piece Assembly No bolts or nuts to loosen during operation Rust Protection Ratchet spring is rust-proofed for durability Forged Components All load bearing parts are forged for strength Easy Operation Positive ratchet mechanism for smooth handling Min-Max Chain Size (mm) Working Load Limit (t) Proof Load (kN) Weight (kg) Handle Length (mm) Barrel Length (mm) Take Up (mm) 8-10 4.00 79 5.49 356 254 203 10-13 6.80 134 6.66 356 254 203 13-16 7.26 143 6.60 356 254 203 Important Note Binders shown with Proof Loads have been individually proof tested to these values prior to shipment. SL-150 Load Binders Standard lever type load binders with extra heavy construction at leverage point to prevent spreading. Features ball and socket swivel joints at hook assemblies for straight line pull. Heavy Construction Reinforced leverage points prevent spreading Easy Release Heel toggles away from load for simple operation Swivel Joints Ball and socket design ensures straight line pull Safety Compliant Meets all industry safety standards Min-Max Chain Size (mm) Working Load Limit (t) Proof Load (kN) Ultimate Load (kN) Weight (kg) Handle Length (mm) Take Up (mm) 8-10 2.45 48 8.63 3.18 406 114 10-13 4.17 82 15.0 5.66 475 114 13-16 5.90 116 20.9 8.93 533 121 Important Note Ultimate load is 3 times the Working Load Limit. All binders undergo strict quality control and testing procedures. Why Choose Our Products Quality Certified All products meet international quality standards and undergo rigorous testing Safety First Engineered with safety as the top priority for secure cargo transportation Durable Construction Manufactured with premium materials for long-lasting performance Easy Operation Designed for efficient and user-friendly operation in all conditions Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium marine and industrial equipment engineered for safety and reliability. Products Anchors Stud‑Link Anchor Chains Lashing Chains & Load Binders Grafil Mooring Ropes Grafil Industrial Ropes Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/GarfilMooringRopes.html", "text": "Garfil Industrial Ropes | Portside India Traders Portside India Traders Strength that Anchors Your Success Home About Products Contact Garfil Industrial Ropes Premium synthetic ropes engineered for strength, durability, and reliability Request Specifications About Garfil Ropes The Company A world leader in synthetic ropes, exporting to more than 55 countries with ISO 9001-2000 certification. The Process Uses modern \"Parapro\" process with serrated tape extruded from virgin granules for superior quality. Product Range Diameter range from 4mm to 48mm with standard coil length of 220 meters. Special 4-twist ropes available. CAPITAL™ 3-Strand Industrial Ropes Defense & Tactical Rappelling, Stithering, & Jackstay ropes Arrestor Barriers & Helldeck nets Tentage & Reinforcement ropes Ropeways & Rope Bridges Material Handling Tower Erection & Cable Pulling Slings for Metal tube handling Pantoon Bridges Sugarcane Trolley Pulling Safety Solutions Safety Nets & Jumping Ropes Helipad Nets & Gangway Nets Escape rope ladders Scramble Nets & Bulk Cargo Nets Product Attributes Polypropylene Ropes High breaking strength & shock absorption Good abrasion resistance Easy knotting possible Inert to chemicals Nylon Ropes Excellent breaking strength & high elongation Good shock absorption Strong & Durable Impact load resilience Quality Assurance Every coil carries a test certificate for material composition, breaking strength, and safe working load. Safe working load is 1/6 th of the breaking strength. Product Specifications Polypropylene Ropes Nylon Ropes Polypropylene Parapro Ropes Our premium polypropylene ropes are engineered for superior strength and durability in various industrial applications. Diameter (mm) Breaking Strength (kgf) Runnage (m/kg) Weight per 220m Coil (kg) 4 214 135.00 1.63 6 602 60.00 3.67 8 1060 33.30 6.60 10 1560 22.00 10.00 12 2210 15.20 14.50 14 3050 11.00 20.00 16 3770 8.60 25.50 18 4810 6.80 32.50 20 5800 5.50 40.00 22 6960 4.50 48.50 24 8130 3.90 57.00 26 9410 3.20 67.60 28 10700 2.80 78.00 30 12220 2.50 89.00 32 13500 2.20 101.00 36 16930 1.70 129.00 40 20510 1.40 158.00 44 24640 1.13 194.00 48 28610 0.96 229.00 Important Notes Weight tolerance as per IS standards All values listed are as per results confirmed in accordance to test procedures IS 7071 Safe working load is 1/6 th of the breaking strength Garfil reserves the right to review its product specifications Nylon Multi-filament Ropes Our premium nylon ropes offer exceptional breaking strength and high elongation properties for demanding applications. Diameter (mm) Breaking Strength (kgf) Runnage (m/kg) Weight per 220m Coil (kg) 4 320 95.24 2.30 6 750 44.40 4.95 8 1345 25.00 8.80 10 2088 16.20 13.60 12 2995 11.20 19.60 14 4095 8.20 26.80 16 5300 6.30 35.00 18 6695 5.00 44.00 20 8300 4.10 54.00 22 10000 3.30 66.00 24 12000 2.80 78.00 26 13950 2.40 92.40 28 15800 2.10 107.00 30 17755 1.80 122.10 32 20000 1.60 139.00 36 24900 1.25 176.00 40 30000 1.00 218.00 44 35800 0.80 264.00 48 42000 0.70 312.00 Important Notes Weight tolerance as per IS standards All values listed are as per results confirmed in accordance to test procedures IS 7071 Safe working load is 1/6 th of the breaking strength Garfil reserves the right to review its product specifications Why Choose Garfil Ropes Global Leadership World leader in synthetic ropes, exporting to over 55 countries Quality Certified ISO 9001-2000 certified manufacturing with rigorous quality control Advanced Technology Modern \"Parapro\" process and state-of-the-art equipment Tested & Certified Every coil comes with test certificate for material and strength Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium marine and industrial equipment engineered for safety and reliability. Products Anchors Stud‑Link Anchor Chains Lashing Chains & Load Binders Grafil Mooring Ropes Grafil Industrial Ropes Quick Links Home About Us All Products Contact © 2025 Portside India Traders. All Rights Reserved."}, {"url": "https://theadityakashyap.github.io/PortsideIndiaTraders/GarfilIndustrialRopes.html", "text": "Garfil Industrial Ropes | Portside India Traders Portside India Traders Strength that Anchors Your Success Home About Products Contact Garfil Industrial Ropes Premium synthetic ropes engineered for strength, durability, and reliability in demanding applications Request Specifications About Garfil Ropes The Company A world leader in the manufacture of Synthetic Ropes, Twines and Nets. ISO 9001-2000 certified company exporting to more than 55 countries with an extensive distribution network. The Process Uses the most modern \"Parapro\" process with serrated tape extruded from virgin granules, twisted in state-of-the-art rope making machines for superior quality. Product Range Diameter range from 4mm to 48mm with standard coil length of 220 meters. Special 4-twist ropes for diameters 18mm and above. CAPITAL™ 3-Strand Industrial Ropes Defense & Tactical Rappelling, Stithering, & Jackstay ropes Arrestor Barriers & Helldeck nets Tentage & Reinforcement ropes Ropeways & Rope Bridges Material Handling Tower Erection & Cable Pulling Slings for Metal tube handling Pantoon Bridges Sugarcane Trolley Pulling Safety Solutions Safety Nets & Jumping Ropes Helipad Nets & Gangway Nets Escape rope ladders Scramble Nets & Bulk Cargo Nets Product Attributes Polypropylene Ropes High breaking strength & shock absorption capacity Good abrasion resistance Easy knotting possible Inert to chemicals Nylon Ropes Excellent breaking strength & high elongation Good shock absorption Strong & Durable Impact load resilience Quality Assurance Every coil carries a test certificate for: Material composition Breaking strength Safe working load Safe working load is 1/6 th of the breaking strength Product Specifications Polypropylene Ropes Nylon Ropes Polypropylene Parapro Ropes Our premium polypropylene ropes are engineered for superior strength and durability in various industrial applications. Designed to withstand heavy loads and harsh conditions, these ropes provide reliable performance across multiple industries. Diameter (mm) Breaking Strength (kgf) Runnage (m/kg) Weight per 220m Coil (kg) 4 214 135.00 1.63 6 602 60.00 3.67 8 1060 33.30 6.60 10 1560 22.00 10.00 12 2210 15.20 14.50 14 3050 11.00 20.00 16 3770 8.60 25.50 18 4810 6.80 32.50 20 5800 5.50 40.00 22 6960 4.50 48.50 24 8130 3.90 57.00 26 9410 3.20 67.60 28 10700 2.80 78.00 30 12220 2.50 89.00 32 13500 2.20 101.00 36 16930 1.70 129.00 40 20510 1.40 158.00 44 24640 1.13 194.00 48 28610 0.96 229.00 Important Notes Weight tolerance as per IS standards All values listed are as per results confirmed in accordance to test procedures IS 7071 All specifications pertain to regular laid ropes and are applicable to new ropes The products indicated in this brochure do not constitute the whole range of Garfil products Please contact us if other sizes and characteristics are required Garfil reserves the right to review its product specifications Safe working load is 1/6 th of the breaking strength Nylon Multi-filament Ropes Our premium nylon ropes offer exceptional breaking strength and high elongation properties, making them ideal for applications requiring shock absorption and durability under demanding conditions. Diameter (mm) Breaking Strength (kgf) Runnage (m/kg) Weight per 220m Coil (kg) 4 320 95.24 2.30 6 750 44.40 4.95 8 1345 25.00 8.80 10 2088 16.20 13.60 12 2995 11.20 19.60 14 4095 8.20 26.80 16 5300 6.30 35.00 18 6695 5.00 44.00 20 8300 4.10 54.00 22 10000 3.30 66.00 24 12000 2.80 78.00 26 13950 2.40 92.40 28 15800 2.10 107.00 30 17755 1.80 122.10 32 20000 1.60 139.00 36 24900 1.25 176.00 40 30000 1.00 218.00 44 35800 0.80 264.00 48 42000 0.70 312.00 Important Notes Weight tolerance as per IS standards All values listed are as per results confirmed in accordance to test procedures IS 7071 All specifications pertain to regular laid ropes and are applicable to new ropes The products indicated in this brochure do not constitute the whole range of Garfil products Please contact us if other sizes and characteristics are required Garfil reserves the right to review its product specifications Safe working load is 1/6 th of the breaking strength Why Choose Garfil Ropes Global Leadership World leader in synthetic ropes, exporting to over 55 countries with an extensive distribution network Quality Certified ISO 9001-2000 certified manufacturing with rigorous quality control processes Advanced Technology Modern \"Parapro\" process and state-of-the-art manufacturing equipment Tested & Certified Every coil comes with test certificate for material, breaking strength & safe working load Contact Us Email sales@portsideindia.com Phone +91 93071 04214 Address I-WING GURUPREM SOCIETY KATRAP, BADALPUR, MUMBAI SUBURBS, 421503 Portside India Traders Providing premium marine and industrial equipment engineered for safety and reliability since our founding. Products Anchors Stud‑Link Anchor Chains Lashing Chains & Load Binders Grafil Mooring Ropes Grafil Industrial Ropes Quick Links Home About Us Products Contact © 2025 Portside India Traders. All Rights Reserved."}]